Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Controls whether all activities during thread creation should be ignored. By default enabled only on Solaris. Solaris provides higher throughput, parallelism and scalability than other operating systems, at the cost of more fine-grained locking activity. This means for example that when a thread is created under glibc, just one big lock is used for all thread setup. Solaris libc uses several fine-grained locks and the creator thread resumes its activities as soon as possible, leaving for example stack and TLS setup sequence to the created thread. This situation confuses Helgrind as it assumes there is some false ordering in place between creator and created thread; and therefore many types of race conditions in the application would not be reported. To prevent such false ordering, this command line option is set to yes by default on Solaris. All activity (loads, stores, client requests) is therefore ignored during:</p><p>* pthread_create() call in the creator thread</p><p>* thread creation phase (stack and TLS setup) in the created thread</p><p>Also new memory allocated during thread creation is untracked, that is race reporting is suppressed there. DRD does the same thing implicitly. This is necessary because Solaris libc caches many objects and reuses them for different threads and that confuses Helgrind.</p></body></html>
ar: <html><head/><body><p>يتحكّم فيما إذا كان يجب تجاهل كل الأنشطة أثناء إنشاء السلسلة. بشكل مبدئي يفعّل على Solaris فقط. يوفّر Solaris إنتاجية أعلى، توازي، و قابلية توسّع أكبر من أنظمة تشغيل أخرى، بكلفة نشاط قفل أدق. يعني هذا مثلاً أنه عندما تنشأ سلسلة تحت glibc، يستخدم قفل كبير واحد فقط لكل إعدادات السلسلة. تستخدم مكتبة Solaris libc عدة أقفال دقيقة و تستأنف سلسلة المنشئ أنشطتها في أقرب وقت ممكن، تارِكةً مثلاً المكدّس و تسلسل إعداد TLS للسلسلة المنشأة. يربك هذا الموقف Helgrind لأنه يفترض وجود بعض التّرتيب الخاطئ بين سلسلة المنشئ و السلسلة المنشأة؛ و لذلك لا يبلّغ عن أنواع كثيرة من ظروف التزاحم في التطبيق. لمنع مثل هذا التّرتيب الخاطئ، يضبط خيار سطر الأوامر هذا على نعم بشكل مبدئي على Solaris. بالتالي تجاهل كل الأنشطة (التحميلات، التخزين، طلبات العميل) أثناء:</p><p>* نداء ()pthread_create في سلسلة المنشئ</p><p>* مرحلة إنشاء السلسلة (إعداد المكدّس و TLS) في السلسلة المنشأة</p><p>و أيضاً الذاكرة الجديدة المخصصة أثناء إنشاء السلسلة غير متتبعة، أي كبت الإبلاغ عن التزاحم هناك. ينفّذ DRD الشيء نفسه بشكل ضمني. هذا ضروري لأن مكتبة Solaris libc تخبّئ العديد من الكائنات و تعيد استخدامها لسلاسل مختلفة و هذا يربك Helgrind.</p></body></html>
ca: <html><head/><body><p>Controla si cal ignorar totes les activitats durant la creació dels fils. De manera predeterminada, només està activat en el Solaris. El Solaris proporciona una velocitat de transferència de dades, un paral·lelisme i una escalabilitat més altes que altres sistemes operatius, amb un cost més gran d'activitat de bloqueig més granular. Això vol dir, per exemple, que quan es crea un fil amb la «glibc», només s'usa un bloqueig gran per a tota la configuració del fil. La «libc» del Solaris usa diversos bloqueigs granulars i el fil creador reprèn les seves activitats tan aviat com sigui possible, deixant, per exemple, la configuració de la pila i del TLS al fil creat. Aquesta situació és confusa pel Helgrind, ja que assumeix que hi ha una ordenació falsa entre el fil creador i el creat; i per tant, moltes condicions de situació de competició de l'aplicació no s'informen. Per a evitar aquesta ordenació falsa, aquesta opció de la línia d'ordres es defineix a «sí» de manera predeterminada en el Solaris. Tota l'activitat (càrregues, emmagatzematges, peticions del client) s'ignora durant:</p><p>* la crida «pthread_create()» en el fil creador </p><p>* la fase de creació del fil (configuració de la pila i el TLS) al fil creat</p><p>També, la nova memòria assignada durant la creació del fil no se segueix, i per tant, aquí se suprimeixen els informes de situació de competició. El DRD fa el mateix implícitament. Això és necessari perquè la «libc» del Solaris fa memòria cau de molts objectes i els reutilitza per a fils diferents i això confon al Helgrind.</p></body></html>
eo: <html><head/><body><p>Regas ĉu ĉiuj agadoj dum kreado de fadenoj estu ignoritaj. Defaŭlte ebligita nur ĉe Solaris. Solaris disponigas pli altan trairon, paralelecon kaj skaleblon ol aliaj operaciumoj, koste de pli fajngrajna ŝlosa agado. Ĉi tio signifas ekzemple ke kiam fadeno estas kreita sub glibc, nur unu granda seruro estas uzata por ĉiuj fadenaj aranĝoj. Solaris libc uzas plurajn fajnajn serurojn kaj la kreinto-fadeno rekomencas siajn agadojn kiel eble plej baldaŭ, lasante ekzemple stakon kaj TLS-agordan sekvencon al la kreita fadeno. Ĉi tiu situacio konfuzas Helgrind ĉar ĝi supozas ke ekzistas iu malvera ordigo inter kreinto kaj kreita fadeno; kaj tial multaj specoj de raskondiĉoj en la aplikaĵo ne estus raportitaj. Por malhelpi tian falsan mendon, ĉi tiu komandlinia opcio estas agordita al jes defaŭlte ĉe Solaris. Ĉia agado (ŝarĝoj, butikoj, klientpetoj) estas do ignorita dum:</p><p>* pthread_create() voko en la kreintofadeno</p><p>* fadeno-kreadfazo (stako kaj TLS-agordo) en la kreita fadeno</p><p>Ankaŭ nova memoro asignita dum kreado de fadeno estas nespurita, tio estas kuro raportado estas subpremita tie. DRD faras la samon implicite. Ĉi tio estas necesa ĉar Solaris libc konservas multajn objektojn kaj reuzas ilin por malsamaj fadenoj kaj tio konfuzas Helgrind.</p></body></html>
es: <html><head/><body><p>Controla si se deben ignorar todas las actividades durante la creación de hilos. Por omisión, solo está activada en Solaris. Solaris proporciona un alto rendimiento, paralelismo y escalabilidad superiores a los de otros sistemas operativos, a costa de una actividad de bloqueo más detallada. Esto significa, por ejemplo, que cuando «glibc» crea un hilo, solo se usa un gran bloqueo para toda la configuración del hilo. La biblioteca «libc» de Solaris usa varios bloqueos más detallados y el hilo creador continúa sus actividades tan pronto como sea posible, dejando la secuencia de configuración de la pila y de TLS a los hilos que ha creado. Esta situación confunde a Helgrind, ya que asume que existe cierto orden falso entre el hilo creador y los hilos creados; de ahí que muchos tipos de condiciones de carrera de la aplicación no se lleguen a notificar. Para impedir este falso orden, esta opción de la línea de órdenes se define como «yes» de forma predeterminada en Solaris. Por ello, toda actividad (cargas, almacenamientos, peticiones de clientes) se ignora durante:</p><p>* la llamada a «pthread_create()» en el hilo creador</p><p>* la fase de creación de hilos (configuración de la pila y de TLS) en los hilos creados</p><p>Además, la nueva memoria asignada durante la creación del hilo no se rastrea, lo que significa que aquí se suprimen las notificaciones sobre carreras. DRD hace lo mismo de forma implícita. Esto resulta necesario porque la biblioteca «libc» de Solaris mantiene una caché de muchos objetos y vuelve a usarlos en distintos hilos, lo que confunde a Helgrind.</p></body></html>
fr: <html><head/><body><p>Contrôle si toutes les activités durant la création du process doivent être ignorées. Par défaut, cette option n'est activée que pour « Solaris ». Solaris met à disposition plus de capacités, de parallélisme et d'extensibilité que d'autres systèmes d'exploitation, au coût d'une activité de verrouillage plus finement adaptée. Ceci signifie par exemple que lorsqu'un processus est créé sous « glibc », un seul verrouillage de grande taille est utilisé pour le paramétrages de tous les processus. La bibliothèque « libc » de « Solaris » utilise plusieurs verrous très précis et le processus de création reprend ses activités dès que possible, en quittant par exemple, la séquence de paramétrage de la pile et du module « TLS ». Cette situation perturbe « DRD », qui considère qu'il y a un ordonnancement incorrect en cours, entre le créateur de processus et le processus créé. Ainsi, les types d'accès concurrents de l'application ne seront pas signalés. Pour prévenir ces ordonnancements incorrects, l'option en ligne de commandes est « yes » par défaut pour Solaris. Toutes les activités (chargements, enregistrements, requêtes vers client) sont ainsi ignorés durant :</p><p>* l'appel à « pthread_create() » dans le processus créateur</p><p>* la phase de création du processus (paramétrage de la pile et de « TLS ») dans le processus créé.</p> <p> Ainsi, les nouvelles zones mémoire allouées durant la création du processus sont non tracées ce qui implique que les rapports d'accès concurrents sont supprimés. Le module « DRD » fait exactement la même chose implicitement. Ceci est nécessaire car la bibliothèque Solaris « libc » met de nombreux accès en cache et les réutilise pour différents processus, ce qui perturbe Helgrind. </p></body></html>
gl: <html><head/><body><p>Controla se deben ignorarse todas as actividades durante a creación de fíos. Só está activado de maneira predeterminada en Solaris. Solaris fornece un maior rendemento, paralelismo e escalabilidade que outros sistemas operativos, a cambio dunha actividade de bloqueo máis granular. Isto significa por exemplo que cando se crea un fío baixo glibc, úsase un único, gran bloqueo para a preparación de todos os fíos. A libc de Solaris usa varios bloqueos granulares e o fío creador continúa a súa actividade o antes posíbel, deixando a secuencia de preparación do montón e de TLS ao fío creado. Esta situación confunde a Helgrind, que asume que hai unha orde falsa entre o fío creador e o creado; e polo tanto non se informa de moitos dos tipos de condicións de carreira da aplicación. Para evitar esa orde falsa, estabelécese esta opción da liña de ordes a «yes» (si) de maneira predeterminada en Solaris. Polo tanto toda a actividade (cargas, almacenamentos, solicitudes do cliente) ignórase durante:</p> <p>* a chamada a pthread_create() no fío creador, e</p> <p>* a fase de creación (preparación do montón e de TLS) no fío creado.</p> <p>Ademais non se fai seguimento da memoria nova asignada durante a creación do fío, é dicir, nese momento suprímense os informes de carreiras. DRD fai o mesmo de maneira implícita. Isto é necesario porque a libc de Solaris garda na caché moitos obxectos e os aproveita para distintos fíos e iso confunde a Helgrind.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, უნდა იქნას თუ არა უგულებელყოფილი ყველა აქტივობა ნაკადის შექმნისას. ნაგულისხმევად ჩართულია მხოლოდ Solaris-ზე. Solaris სხვა ოპერაციულ სისტემებთან შედარებით უზრუნველყოფს უფრო მაღალ გამტარუნარიანობას, პარალელიზმს და მასშტაბირებადობას, რაც მიიღწევა დაბლოკვის უფრო დეტალური (fine-grained) მექანიზმებით. ეს ნიშნავს, რომ მაგალითად, როდესაც ნაკადი იქმნება glibc-ის ქვეშ, ნაკადის გამართვისთვის გამოიყენება მხოლოდ ერთი დიდი ბლოკი. Solaris libc იყენებს რამდენიმე დეტალურ ბლოკს და შემქმნელი ნაკადი აგრძელებს თავის საქმიანობას რაც შეიძლება მალე, ხოლო სტეკის და TLS-ის გამართვას უტოვებს შექმნილ ნაკადს. ეს ვითარება აბნევს Helgrind-ს, რადგან იგი ვარაუდობს, რომ არსებობს გარკვეული მცდარი თანმიმდევრობა შემქმნელ და შექმნილ ნაკადებს შორის; ამის გამო, აპლიკაციაში არსებული მრავალი სახის დავის პირობა შესაძლოა არ იქნას მოხსენებული. ასეთი მცდარი თანმიმდევრობის თავიდან ასაცილებლად, ეს ბრძანების პარამეტრი Solaris-ზე ნაგულისხმევად დაყენებულია მნიშვნელობაზე yes. შესაბამისად, ყველა აქტივობა (ჩატვირთვა, შენახვა, კლიენტის მოთხოვნები) უგულებელყოფილია შემდეგი პროცესებისას:</p><p>* pthread_create() გამოძახება შემქმნელ ნაკადში</p><p>* ნაკადის შექმნის ფაზა (სტეკის და TLS-ის გამართვა) შექმნილ ნაკადში</p><p>ასევე, ნაკადის შექმნისას გამოყოფილი ახალი მეხსიერება არ კონტროლდება, რაც ნიშნავს, რომ იქ დავების მოხსენება შეჩერებულია. DRD იმავეს აკეთებს იმპლიციტურად. ეს აუცილებელია, რადგან Solaris libc ახდენს მრავალი ობიექტის ქეშირებას და მათ ხელახლა იყენებს სხვადასხვა ნაკადისთვის, რაც აბნევს Helgrind-ს.</p></body></html>
ko: <html><head/><body><p>스레드 생성 시 모든 활동을 무시할지 여부를 설정합니다. 기본값으로는 Solaris에서만 활성화되어 있습니다. Solaris는 잠금 활동을 더 미세하게 조정할 수 있는 대신 다른 운영 체제에 비해서 높은 대역폭, 병렬성, 확장성을 제공합니다. 이는 glibc에서 스레드를 생성할 때 모든 스레드 설정에 거대한 잠금 하나만을 사용함을 의미합니다. Solaris libc에서는 미세한 잠금 여러 개를 사용하고, 생성자 스레드는 최대한 빠르게 작업을 다시 시작하며, 생성된 스레드에서 스택과 TLS 설정 등을 진행합니다. Helgrind에서는 생성자와 생성된 스레드 사이에서 작업 순서가 잘못 진행되고 있다는 것으로 착각할 수 있으며, 앱의 경쟁 조건이 보고되지 않을 수도 있습니다. 잘못된 순서를 방지하기 위해서 이 명령행 옵션은 Solaris에서는 기본값으로 yes로 설정됩니다. 이에 따라서 다음 작업 중 모든 활동(불러오기, 저장, 클라이언트 요청)을 무시합니다:</p><p>* 생성자 스레드에서의 pthread_create() 호출 </p><p>* 생성된 스레드에서의 스레드 생성 과정(스택과 TLS 설정)</p> <p>또한 스레드 생성 중에 할당된 메모리는 추적되지 않으며, 그 과정에서 발생하는 경쟁 조건도 보고되지 않습니다. DRD에서도 같은 작업을 암시적으로 수행합니다. Solaris libc에서는 대량의 객체를 캐시에 저장하고 다른 스레드에서 동시에 사용하기 때문에 Helgrind에 혼동을 줄 수 있기 때문에 이 설정이 필요합니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in of tijdens de creatie van een thread alle andere activiteiten genegeerd moeten worden. Dit is standaard alleen bij Solaris ingeschakeld. Solaris heeft een hogere doorvoer (throughput), parallelliteit (parallelism) en schaalbaarheid dan andere besturingssystemen, ten koste van een fijnere instelling voor het vergrendelen. Dit houdt in dat als bijvoorbeeld onder glibc een thread wordt aangemaakt, er een grote vergrendeling is voor alle thread-instellingen. Solaris libc gebruikt verschillende nauwkeurig ingestelde vergrendelingen en de creator thread vervolgt zo snel mogelijk zijn activiteiten, waarbij bijvoorbeeld de aanmaak procedure voor de stack en de TLS wordt overgelaten aan de gecreëerde thread. Deze situatie verwart Helgrind omdat het aanneemt dat er een foute volgorde is tussen de aanmakende en gecreëerde thread; zodat er veel verschillende types race condities in het programma niet worden gemeld. Om deze foute volgorden te voorkomen, is bij Solaris deze commandoregel-optie standaard op <span style=" font-family:'Monospace';">yes</span> gezet. Daarom worden alle activiteiten (loads, stores, client requests) genegeerd tijdens:</p><p>* pthread_create() call in de creator thread </p><p>* thread creatie fase (stack en TLS aanmaak) in de gecreëerde thread</p><p>Ook wordt tijdens de thread-creatie nieuw gereserveerde geheugen niet gevolgd, zodat op dat moment race rapportering is uitgeschakeld. DRD doet impliciet hetzelfde. Dat is noodzakelijk omdat Solaris libc vele objecten cached en ze voor verschillende threads hergebruikt, wat verwarrend voor Helgrind is.</p></body></html>
pl: <html><head/><body><p>Określa czy pomijać wszystkie czynności podczas tworzenia wątku. Domyślnie włączone tylko na Solarisie. Solaris zapewnia większą przepustowośc, równoległość i skalowalność niż inne systemy operacyjne kosztem dokładniejszego blokowania. Oznacza to, że jeśli wątek jest tworzony w glibc, to tylko jedna duża blokada jest używana dla wszystkich wątków. Solaris libc używa kilku dokładniejszych blokad, a wątek tworzący wznawia wszystkie aktywności tak szybko jak to tylko możliwe, pozostawiając na przykład stos i sekwencję ustawień TLS wątkowi tworzącemu. Taka sytuacja myli Helgrinda, gdyż przypuszcza on, że nastąpiła zła kolejność pomiędzy wątkiem tworzącym i tworzonym; przez to wiele rodzajów warunków gonitw w aplikacji nie zostanie zgłoszonych. Aby zapobiec takiej błędnej kolejności, wartość ta jest domyślnie włączana na Solarisie. Wszystkie czynności (wczytywanie, zapisywanie, żądania klienta) są przez to pomijane podczas:</p><p>* wywołania pthread_create() w wątku tworzącym</p><p>* fazy tworzenia wątku (ustawienia stosu i TLS) w torzonym wątku</p><p>Także nowa pamięć przydzielona podczas tworzenia wątku jest nieśledzona, co oznacza, że zgłaszanie gonitw jest w tej chwili wyłączone. DRD robi to samo niejednoznacznie. Jest to niezbędne, bo Solaris libc zrzuca do pamięci podręcznej wiele obiektów i używa ich ponownie dla innych wątków, a to myli Helgrinda.</p></body></html>
pt: <html><head/><body><p>Controla se todas as actividades durante a criação das tarefas devem ser ignoradas. Por omissão, só está activo no Solaris. O Solaris oferece mais débito, paralelismo e escalabilidade que os outros sistemas operativos, às custas de uma actividade de bloqueio mais controladas. Isto significa, por exemplo, que quando é criada uma nova tarefa na 'glibc', é usado apenas um grande bloqueio para toda a configuração da tarefa. A 'libc' do Solaris usa diversos bloqueios mais finos e a tarefa criadora retoma as suas actividades o mais rapidamente possível, deixando por exemplo a pilha e a sequência de configuração do TLS para a tarefa criada. Esta situação confunde o Helgrind, dado que assume que existe alguma ordenação falsa a tomar lugar entre a tarefa criadora e a tarefa criada; como tal, muitos tipos de condições erradas de concorrência na aplicação não seriam comunicadas. Para evitar essa ordenação falsa, esta opção da linha de comandos é configurada como activa por omissão no Solaris. Todas as actividades (leituras, gravações, pedidos de clientes) é ignorada por esse facto durante:</p><p>* a chamada 'pthread_create()' na tarefa criadora</p><p>* a fase de criação da tarefa (configuração da pilha e do TLS) na tarefa criada</p><p>Também a memória alocada durante a criação da tarefa não é registada, ou seja, o relatório de erros de concorrência é omitido aqui. O DRD faz a mesma coisa de forma implícita. Isto é necessário porque a 'libc' do Solaris faz 'cache' de muitos objectos e reutiliza-os para as diferentes tarefas, o que poderá confundir o Helgrind.</p></body></html>
pt_br: <html><head/><body><p>Controla se todas as atividades durante a criação da thread devem ser ignoradas. Por padrão, habilitado apenas no Solaris. O Solaris oferece maior taxa de transferência, paralelismo e escalabilidade do que outros sistemas operacionais, ao custo de uma atividade de bloqueio mais refinada. Isso significa, por exemplo, que quando uma thread é criada sob a glibc, apenas um bloqueio grande é usado para toda a configuração da thread. A libc do Solaris usa vários bloqueios refinados e a thread criadora retoma suas atividades o mais rápido possível, deixando, por exemplo, a pilha e a sequência de configuração do TLS para a thread criada. Essa situação confunde o Helgrind, pois ele assume que há alguma ordem falsa entre a thread criadora e a criada; e, portanto, muitos tipos de condições de corrida no aplicativo não seriam relatados. Para evitar essa ordem falsa, esta opção de linha de comando é definida como sim por padrão no Solaris. Toda a atividade (carregamentos, armazenamentos, solicitações de clientes) é, portanto, ignorada durante:</p><p>* chamada pthread_create() na thread criadora</p><p>* fase de criação da thread (configuração de pilha e TLS) na thread criada</p><p>Além disso, a nova memória alocada durante a criação da thread não é rastreada, ou seja, o relatório de corrida é suprimido aqui. O DRD faz a mesma coisa implicitamente. Isso é necessário porque a libc do Solaris armazena em cache muitos objetos e os reutiliza para diferentes threads, o que confunde o Helgrind.</p></body></html>
sv: <html><head/><body><p>Bestämmer om alla aktiviteter när trådar skapas ska ignoreras. Normalt bara aktiverad på Solaris. Solaris erbjuder högre genomströmning, parallellism och skalbarhet än andra operativsystem, till bekostnad av mer finkornig låsningsaktivitet. Det betyder exempelvis att när en tråd skapas i glibc, används bara ett stort lås för hela trådens initiering. Solaris libc använder flera finkorniga lås och trådens skapare återupptar sina aktiviteter så snart som möjligt, och lämnar exempelvis stack- och TLS-inställningssekvensen till den skapade tråden. Situationen förvirrar Helgrind, eftersom det antar att det finns någon falsk ordningsföljd på plats mellan skapare och skapad tråd, och att därför skulle många typer av kapplöpningar i programmet inte rapporteras. För att förhindra en sådan falsk ordningsföljd, ändras kommandoradsväljaren till yes på Solaris. All aktivitet (läs, skriv klientbegäran) ignoreras därför vid:</p><p>* Anrop till pthread_create() i den skapande tråden </p><p>* Fasen då tråden skapas (stack- och TLS-inställning) i den skapade tråden</p><p>Också nya minnestilldelningar som görs när tråden skapas spåras inte, det vill säga rapportering av kapplöpning är undertryckt där. DRD gör implicit samma sak. Det är nödvändigt eftersom Solaris libc lagrar många objekt i en cache och återanvänder dem för olika trådar, och det förvirrar Helgrind.</p></body></html>
tr: <html><head/>İş parçacığı oluşturma sırasındaki tüm etkinliklerin göz ardı edilip edilmeyeceğini denetler. Varsayılan olarak yalnızca Solaris üzerinde etkindir. Solaris daha hassas kilitleme etkinliğinin pahasına diğer işletim sistemlerinden daha yüksek çıktı, paralellik ve ölçeklenebilirlik sağlar. Bu örneğin bir iş parçacığı glibc altında oluşturulduğunda, tüm iş parçacığı kurulumu için yalnızca bir büyük kilit kullanılır anlamına gelmektedir. Solaris glibc birkaç hassas kilit kullanır ve oluşturucu iş parçacığı etkinliklerini bir an evvel sürdürür, örneğin yığın ve TLS kurulumu sırasını oluşturulmuş iş parçacığına bırakarak. Bu durum Helgrind oluşturucu ve oluşturulan iş parçacığı arasında bazı yanlış sıralamalar olduğunu varsaydığı için kafasını karıştırır; bu nedenle uygulamadaki pek çok yarış durumu bildirilmeyecektir. Böyle bir yanlış sıralamayı önlemek için, bu komut satırı seçeneği Solaris üzerinde varsayılan olarak evet ' e ayarlanmıştır. Tüm etkinlik (yüklemeler, saklamalar, istemci istekleri) bu yüzden </p><p>oluşturucu iş parçacığı içerisinde * pthread_create() çağrısı</p><p>* sırasında göz ardı edilir: oluşturulmuş iş parçacığı içinde iş parçacığı oluşum fazı (yığın ve TLS kurulumu)</p><p>Ayrıca iş parçacığı oluşumu sırasındaki yeni önbellek tahsisi izlenmez ki yarış raporlaması orada bastırılır. DRD tam olarak aynı şeyi yapar. Bu gereklidir çünkü Solaris libc birçok nesneleri önbellekler ve farklı iş parçacıkları için tekrar kullanır ve bu Helgrind ' in kafasını karıştırır.</p></body></html>
uk: <html><head/><body><p>Керує тим, чи слід ігнорувати усі дії під час створення потоку виконання. Типово увімкнено лише у Solaris. У Solaris вищий за інші системи рівень пропускної здатності, паралельності та масштабованості. Це реалізовано за рахунок додаткових варіантів дій з блокування. Це, наприклад, означає, що під час створення потоку у системі з glibc, для налаштувань усіх потоків використовується одне велике блокування. У Solaris з libc використовується декілька точніше регульованих блокувань, а потік виконання, у якому відбувалося створення, відновлює свою роботу якнайшвидше, лишаючи, наприклад, послідовність налаштовування стека і TLS створеному потоку. Такі принципи роботи заважають Helgrind отримувати належні дані, оскільки програма припускає, що між потоком створення і створеним потоком виникло помилкове упорядковування; отже, програма не зможе повідомити про багато типів помилок із конкуренцією у програмі. Щоб запобігти такому помилковому упорядковуванню, типово у Solaris для цього параметра встановлено значення «yes». У такому режимі усі дії (завантаження, зберігання, запити клієнтів) ігноруються під час таких подій:</p><p>* виклику pthread_create() у потоці створення</p><p>* фази створення потоку (налаштування стека та TLS) у створеному потоці</p><p>Крім того, не відбувається стеження на розміщеннями у пам’яті, які було виконано під час створення потоку, тобто виконується придушення звітування про конкуренцію у цих областях пам’яті. DRD дає те саме, але неявно. Це необхідно, оскільки libc у Solaris кешує багато об’єктів і повторно використовує їх для різних потоків, що збиває Helgrind з пантелику.</p></body></html>
zh_cn: <html><head/><body><p>控制是否应忽略线程创建过程中的所有活动。默认仅在 Solaris 上启用。比起其他操作系统，Solaris 提供更高的吞吐率、并行化率和可扩展性，但是代价是更精细化的加锁操作。例如当线程在 glibc 下创建时，整个线程设置过程被一个大锁保护，而 Solaris libc 使用多个精细的锁。这使得创建线程能尽快恢复其原有活动，而将包括堆栈和 TLS 设置过程留给新创建的线程完成。这种情况会使 Helgrind 陷入混乱，因为它会认为创建者和被创建的线程之间有某种虚假的次序。作为结果，许多种应用程序中的竞争条件不会被报告。为了避免这种对虚假次序的认知，该命令行参数默认在 Solaris 上被设置为 yes。所有活动（读取，写入，客户请求）都会在以下过程中被忽略：</p><p>* 创建者线程的 pthread_create() 调用中 </p><p>* 被创建线程的线程创建阶段（堆栈和 TLS 设置）</p><p>另外，线程创建时分配的内存不会被追踪，也就是说在这些区域竞争性访问不会被报告。DRD 会隐式地进行相同的操作。之所以需要这么干，是因为 Solaris libc 会缓存大量的对象并且在不同线程间重用它们，而这会令 Helgrind 陷入混乱。</p></body></html>
