Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Whether to report calls to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> where the mutex associated with the signal through <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> or <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> is not locked at the time the signal is sent. Sending a signal without holding a lock on the associated mutex is a common programming error which can cause subtle race conditions and unpredictable behavior. There exist some uncommon synchronization patterns however where it is safe to send a signal without holding a lock on the associated mutex.</p></body></html>
ar: <html><head/><body><p>إذا كان يبلّغ عن نداءات <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> حيث المؤَمّن (Mutex) المرتبط بالإشارة من خلال <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> أو <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> ليس مقفلاً في وقت إرسال الإشارة. إرسال إشارة دون حيازة قفل على المؤَمّن المرتبط خطأ برمجي شائع قد يسبّب ظروف تزاحم خفية و سلوكاً لا يمكن توقّعه. توجد بعض أنماط المزامنة غير الشائعة و لكن حيث من الآمن إرسال إشارة دون حيازة قفل على المؤَمّن المرتبط.</p></body></html>
ca: <html><head/><body><p>Si informar les crides a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> quan el «mutex» associat amb el senyal a través de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> no està bloquejat en el moment en què s'envia el senyal. L'enviament d'un senyal sense efectuar un bloqueig al «mutex» associat és un error de programació freqüent que pot provocar situacions de competició subtils i un comportament no predictible. Tanmateix, existeixen diversos patrons de sincronització poc freqüents en què és segur enviar un senyal sense efectuar un bloqueig al «mutex» associat.</p></body></html>
eo: <html><head/><body><p>Ĉu raporti vokojn al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> kaj <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> kie la mutex asociita kun la signalo per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> aŭ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> ne estas ŝlosita kiam la signalo estas sendita. Sendi signalon sen tenado de seruro sur la rilata mutex estas ofta programa eraro kiu povas kaŭzi subtilajn raskondiĉojn kaj neantaŭvideblan konduton. Ekzistas kelkaj maloftaj sinkronigaj ŝablonoj tamen kie estas sekure sendi signalon sen tenado de seruro sur la rilata mutekso.</p></body></html>
es: <html><head/><body><p>Controla si se debe informar de llamadas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> en las que el semáforo mutex asociado con la señal mediante <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> no está bloqueado en el momento en que se envía la señal. El envío de una señal sin mantener el bloqueo sobre el semáforo mutex asociado es un error común en programación que puede causar repentinas condiciones de carrera y un comportamiento impredecible. No obstante, existen algunos patrones de sincronización poco comunes en los que resulta seguro el envío de una señal sin mantener el bloqueo sobre el semáforo mutex asociado.</p></body></html>
fr: <html><head/><body><p>Définit s'il faut signaler les appels à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « pthread_cond_signal » </span> et <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « pthread_cond_broadcast » </span> lorsque le mutex associé au signal de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « pthread_cond_wait » </span> ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « pthread_cond_timed_wait » </span> n'est pas verrouillé au moment où le signal est envoyé. L'envoi d'un signal sans effectuer un verrouillage du mutex correspondant est une erreur de programmation courante, pouvant causer des conditions subtiles d'accès concurrents et des comportements aléatoires. Il existe certains profils de synchronisation un peu exotiques cependant, où l'envoi d'un signal sans effectuer un verrouillage du mutex correspondant est sûr.</p></body></html>
gl: <html><head/><body><p>Se informar de chamadas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> onde o peche de exclusión mutua asociado co sinal a través de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> non está bloqueado no momento no que se envía o sinal. Enviar un sinal sen manter un bloqueo no peche de exclusión mutua asociado é un erro de programación habitual que pode causar condicións de carreira sutís e comportamento impredicíbel. Existen porén algúns padróns de sincronización pouco comúns nos que é seguro enviar un sinal sen manter un bloqueo no peche de exclusión mutua asociado.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს, მოხდეს თუ არა <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> ფუნქციების გამოძახებების მოხსენება მაშინ, როდესაც სიგნალის გაგზავნის მომენტში დაკავშირებული მუტექსი (რომელიც ასოცირებულია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> ან <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> მეშვეობით) არ არის დაბლოკილი. სიგნალის გაგზავნა შესაბამის მუტექსზე ბლოკის გარეშე არის გავრცელებული პროგრამული შეცდომა, რამაც შეიძლება გამოიწვიოს ფარული დავის პირობები და არაპროგნოზირებადი ქცევა. თუმცა არსებობს სინქრონიზაციის ზოგიერთი იშვიათი შაბლონი, სადაც სიგნალის გაგზავნა დაკავშირებული მუტექსის დაბლოკვის გარეშე უსაფრთხოა.</p></body></html>
ko: <html><head/><body><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> 또는 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span>로 시그널과 연관된 뮤텍스가 시그널을 보낼 때 잠겨 있지 않을 때 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span>과 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadc-ast</span> 호출을 보고할지 여부입니다. 연관된 뮤텍스에 잠금을 획득하지 않고 시그널을 보내는 것은 자주 발생하는 프로그래밍 오류이며 경쟁 조건과 예상하지 못한 오류가 발생할 수도 있습니다. 하지만 연관된 뮤텍스에 잠금을 획득하지 않고 시그널을 보내도 되는 동기화 패턴이 드물게 존재합니다.</p></body></html>
nl: <html><head/><body><p>Of er gerapporteerd moet worden of er aanroepen zijn naar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> terwijl de mutex die bij het signaal hoort waarbij <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> of <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> niet gelocked is op het moment dat het signaal is verstuurd. Een signaal versturen zonder een lock op de bijbehorende mutex is een veelvoorkomende programmeerfout die subtiele race condities en onvoorspelbaar gedrag kan veroorzaken. Er bestaan echter ook ongewone synchronisatie-patronen waarbij het toch veilig is om zonder een lock op de bijbehorende mutex een signaal te versturen.</p></body></html>
pl: <html><head/><body><p>Określa czy rejestrować wywołania <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> w których mutex skojarzony z sygnałem przez <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> lub <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> nie jest zablokowany w chwili wysłania sygnału. Wysyłanie sygnału bez zablokowania na skojarzonymmuteksie jest powszechnym błędem programistycznym, który może powodować subtelne warunki gonitwy i nieprzewidywalne zachowanie. Istnieją jednakże pewne niepowszechne sposoby synchronizacji, w których bezpiecznie jest wysłać sygnał bez blokowania skojarzonego muteksu.</p></body></html>
pt: <html><head/><body><p>Se deve comunicar as chamadas ao <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span>, onde a exclusão mútua associada ao sinal com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> ou o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> não está bloqueado na altura em que é enviado o sinal. O envio de um sinal sem manter um bloqueio sobre a exclusão mútua associada é um erro de programação comum que poderá provocar erros de concorrência subtis e algum comportamento imprevisível. Existem alguns padrões de sincronização não-comuns em que seja, por outro lado, seguro enviar um sinal sem manter um bloqueio sobre a exclusão mútua associada.</p></body></html>
pt_br: <html><head/><body><p>Se deve relatar chamadas para <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> onde o mutex associado ao sinal por meio de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> não está bloqueado no momento em que o sinal é enviado. Enviar um sinal sem manter um bloqueio no mutex associado é um erro de programação comum que pode causar condições de corrida sutis e comportamento imprevisível. No entanto, existem alguns padrões de sincronização incomuns nos quais é seguro enviar um sinal sem manter um bloqueio no mutex associado.</p></body></html>
sv: <html><head/><body><p>Om anrop till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> ska rapporteras, där den mutex som hör ihop med signalen via <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> eller <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> inte är låst vid tillfället då signalen skickas. Att skicka en signal utan att ha låst tillhörande mutex är ett vanligt programmeringsfel som kan orsaka subtila kapplöpningar och oförutsägbart beteende. Det finns dock ett antal ovanliga synkroniseringsmönster då det är säkert att skicka en signal utan att ha låst tillhörande mutex.</p></body></html>
tr: <html><head/><body><p>Çağrıları <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span>'e rapor edip etmeyeceği ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> burada muteks <span style=" font-family yoluyla sinyalle ilişkilendirilir: 'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> veya <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span>, sinyal gönderildiğinde kilitli değil. İlişkili muteks üzerinde bir kilit tutmadan bir sinyal göndermek, ince yarış koşullarına ve öngörülemeyen davranışlara neden olabilen yaygın bir programlama hatasıdır. Bazı olağan dışı durumlar vardır. ancak ilgili muteks üzerinde bir kilit tutmadan bir sinyal göndermenin güvenli olduğu senkronizasyon kalıpları mevcuttur.</p></body></html>
uk: <html><head/><body><p>Визначає, чи слід звітувати про виклики <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> та <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span>, де прапорець, який пов’язано із сигналом за допомогою <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> або <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span>, не заблоковано на час надсилання сигналу. Надсилання сигналу без утримання блокування на пов’язаному прапорці є типовою помилкою програмування, яка може призводити до майже непомітних конкуренцій та непередбачуваної поведінки. Втім, існують деякі нетипові шаблони коду, у яких можна безпечно надсилати сигнал без утримання блокування на пов’язаному прапорці.</p></body></html>
zh_cn: <html><head/><body><p>是否要报告对 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_signal</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_broadcast</span> 的调用，如果在用它们发送信号时，通过 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_wait</span> 或 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">pthread_cond_timed_wait</span> 和这个信号相关联的互斥锁并没有被锁住。在没有持有相关的互斥锁时发送信号是一个常见的编程错误，这可能会导致微妙的竞争性访问条件以及不可预测的行为。然而，在某些少见的同步模式中，不持有相关的互斥锁而直接发送信号是安全的。</p></body></html>

source: Report calls to unlocked signals
ar: بلّغ عن نداءات للإشارات غير المقفلة
ca: Informa les crides a senyals no bloquejats
eo: Raporti vokojn al neŝlositaj signaloj
es: Informar de llamadas a señales no bloqueadas
fr: Signaler les appels à des signaux non verrouillés
gl: Informar de chamadas a sinais non bloqueados.
it: Segnala chiamate a segnali sbloccati
ka: განბლოკილი სიგნალების გამოძახებების ანგარიში
ko: 잠금 해제된 시그널 호출 반복
nl: Aanroepen naar ontgrendelde signalen rapporteren
pl: Zgłaszaj odwołania do odblokowanych sygnałów
pt: Comunicar as chamadas aos sinais desbloqueados
pt_br: Relatar chamadas para sinais desbloqueados
sv: Rapportera anrop till olåsta signaler
tr: Kilidi açılmış sinyallere yapılan çağrıları rapor et
uk: Звітувати про виклики незаблокованих сигналів
zh_cn: 报告对未加锁的信号量的调用

source: <html><head/><body><p>Controls segment merging. Segment merging is an algorithm to limit memory usage of the data race detection algorithm. Disabling segment merging may improve the accuracy of the so-called 'other segments' displayed in race reports but can also trigger an out of memory error.</p></body></html>
ar: <html><head/><body><p>يتحكّم بدمج الأجزاء. دمج الأجزاء هو خوارزمية لتحديد استخدام خوارزمية كشف تزاحم البيانات للذاكرة. تعطيل دمج الأجزاء قد يحسّن دقّة ما يسمّى ب 'الأجزاء الأخرى' المعروضة في تقارير التزاحم و لكن قد يشغّل أيضاً خطأ نفاد الذاكرة.</p></body></html>
ca: <html><head/><body><p>Controla la fusió de segments. La fusió de segments és un algorisme per a limitar l'ús de memòria de l'algorisme de detecció de situacions de competició. La desactivació de la fusió de segments pot millorar la precisió de l'anomenat «altres segments» mostrat als informes de competició, però també pot provocar un error de manca de memòria.</p></body></html>
eo: <html><head/><body><p>Regas segmenta kunfandiĝo. Segmentfuzio estas algoritmo por limigi memoruzokutimon de la datenvetkura detektalgoritmo. Malŝalti segmentan kunfandiĝon povas plibonigi la precizecon de la tiel nomataj 'aliaj segmentoj' montrataj en rasraportoj sed ankaŭ povas deĉenigi eraron sen memoro.</p></body></html>
es: <html><head/><body><p>Controla la fusión de segmentos. La fusión de segmentos es un algoritmo para limitar el uso de memoria del algoritmo de detección de carreras de datos. La desactivación de la fusión de segmentos puede mejorar la precisión de lo que se denomina «otros segmentos» en los informes de carreras, pero también puede provocar un error de memoria agotada.</p></body></html>
fr: <html><head/><body><p>Contrôle la fusion des segments. La fusion de segment est un algorithme permettant de limiter l'utilisation de mémoire de l'algorithme de détection d'excursion mémoire. La désactivation de la fusion de segment pourrait améliorer la précision de la soit-disant « Autres segments », affiché dans les rapports d'excursion mais elle peut aussi déclencher une erreur « Erreur d'accès mémoire ».</p></body></html>
gl: <html><head/><body><p>Controla a mestura de segmentos. A mestura de segmentos é un algoritmo para limitar o uso de memoria do algoritmo de detección de carreiras de datos. Desactivar a mestura de segmentos podería mellorar a exactitude dos chamados «outros segmentos» que se mostran nos informes de carreiras, pero tamén pode causar un erro de esgotamento de memoria.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს სეგმენტების გაერთიანებას. სეგმენტების გაერთიანება არის ალგორითმი, რომელიც ზღუდავს მონაცემთა დავის აღმოჩენის მექანიზმის მიერ მეხსიერების გამოყენებას. სეგმენტების გაერთიანების გამორთვამ შესაძლოა გააუმჯობესოს დავის ანგარიშებში ნაჩვენები ე.წ. „სხვა სეგმენტების“ სიზუსტე, თუმცა ამავდროულად შესაძლოა გამოიწვიოს მეხსიერების ამოწურვის შეცდომა.</p></body></html>
ko: <html><head/><body><p>세그먼트 합치기를 제어합니다. 세그먼트 합치기는 데이터 경쟁 감지 알고리즘의 메모리 사용량을 제한하는 알고리즘입니다. 세그먼트 합치기를 비활성화하면 경쟁 보고서에서 표시되는 '다른 세그먼트'의 정확도를 개선할 수 있으나 메모리 부족 오류가 발생할 수도 있습니다.</p></body></html>
nl: <html><head/><body><p>Bestuurt samenvoegen van segmenten. Samenvoegen van segmenten is een algoritme om geheugengebruik van het algoritme voor detecteren van gegevens-races te beperken. Samenvoegen van segmenten uitschakelen kan de nauwkeurigheid verbeteren van de zogenaamde 'andere segmenten' getoond in race-rapporten maar kan ook een fout van gebrek aan geheugen veroorzaken.</p></body></html>
pl: <html><head/><body><p>Określa scalanie segmentów. Scalanie segmentów jest algorytmem do ograniczenia wykorzystania pamięci algorytmu do wykrywania gonitw. Wyłączenie scalania segmentów może poprawić dokłaność tzw. 'innych segmentów' wyświetlanych w dzienniku gonitw lecz może także spowodować błąd wyczerpania pamięci.</p></body></html>
pt: <html><head/><body><p>Controla a reunião de segmentos. A reunião de segmentos é u algoritmo para limiar a utilização de memória da detecção de concorrência nos dados. A desactivação dessa reunião poderá melhor a precisão dos ditos 'outros segmentos' que aparecem nos relatórios de concorrência, mas também poderá despoletar um erro de falta de memória.</p></body></html>
pt_br: <html><head/><body><p>Controla a mesclagem de segmentos. A mesclagem de segmentos é um algoritmo para limitar o uso de memória do algoritmo de detecção de corrida de dados. Desabilitar a mesclagem de segmentos pode melhorar a precisão dos chamados "outros segmentos" exibidos nos relatórios de corrida, mas também pode acionar um erro de falta de memória.</p></body></html>
sv: <html><head/><body><p>Kontrollerar segmentsammanfogning. Segmentsammanfogning är en algoritm för att begränsa minnesanvändning hos algoritmen för datakapplöpningsdetektering. Att inaktivera segmentsammanfogning kan förbättra noggrannheten hos de så kallade 'other segments' i kapplöpningsrapporter, men kan också utlösa ett slut på minnesfel.
tr: <html><head/><body><p>Bölüt bütünleştirmeyi denetler. Bölüt bütünleştirme, veri yarışı tespit etme algoritmasının bellek kullanımını sınırlayan bir algoritmadır. Bölüt bütünleştirmeyi devre dışı bırakmak, yarış raporlarında gösterilen 'diğer dilimlerin' doğruluğunu iyileştirebilir; ancak aynı zamanda bir bellek yetersizliğini tetikleyebilir.</p></body></html>
uk: <html><head/><body><p>Керує об’єднанням сегментів. Об’єднання сегментів є алгоритмом, який обмежує споживання пам’яті алгоритмом виявлення конкуренції за дані. Вимикання об’єднання сегментів може поліпшити точність показу так званих «сторонніх сегментів» у звітах щодо конкуренції, але також може призвести до помилок, які пов’язано із виходом за межі наданої області пам’яті.</p></body></html>
zh_cn: <html><head/><body><p>控制段合并。段合并是一个用于限制数据竞争性访问检测算法内存用量的方法。禁止段合并可能会提升竞争性访问报告中标注为“其它段”的部分的精确度，但是也可能会导致内存不足的问题。</p></body></html>

source: Segment merging
ar: دمج الأجزاء
ca: Fusió de segments
eo: Segmenta kunfandiĝo
es: Fusión de segmentos
fr: Fusion de segment
gl: Mestura de segmentos.
it: Fusione di segmenti
ka: სეგმენტების შერწყმა
ko: 세그먼트 합치기
nl: Samenvoegen van segmenten
pl: Scalanie segmentów
pt: Reunião de segmentos
pt_br: Mesclagem de segmentos
sv: Segmentsammanfogning
tr: Bölüt birleştirme
uk: Об’єднання сегментів
zh_cn: 段合并
