Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>When enabled, Memcheck checks that heap blocks are deallocated using a function that matches the allocating function. That is, it expects <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> to be used to deallocate blocks allocated by <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> for blocks allocated by <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> for blocks allocated by <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. If a mismatch is detected, an error is reported. This is in general important because in some environments, freeing with a non-matching function can cause crashes.</p><p>There is however a scenario where such mismatches cannot be avoided. That is when the user provides implementations of <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> that call <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> and of <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> that call <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, and these functions are asymmetrically inlined. For example, imagine that <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> is inlined but <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> is not. The result is that Memcheck &quot;sees&quot; all <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> calls as direct calls to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, even when the program source contains no mismatched calls.</p><p>This causes a lot of confusing and irrelevant error reports. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> disables these checks. It is not generally advisable to disable them, though, because you may miss real errors as a result.</p></body></html>
ar: <html><head/><body><p>عند التفعيل، يتحقق Memcheck من أن كتل الكومة يجرى إلغاء تخصيصها باستخدام دالة تطابق دالة التخصيص. أي، يتوقع أن تستخدم <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> لإلغاء تخصيص الكتل المخصصة بواسطة <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>، و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> للكتل المخصصة بواسطة <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>، و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> للكتل المخصصة بواسطة <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. إذا اكتشف عدم تطابق، يبلغ عن خطأ. هذا مهم بشكل عام لأن التحرير بدالة غير مطابقة في بعض البيئات قد يسبب أعطالًا. </p><p>ومع ذلك، هناك سيناريو لا يمكن فيه تجنب مثل هذه الاختلافات. هذا عندما يوفر المستخدم تطبيقات لـ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> تستدعي <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> ولـ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> تستدعي <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>، وتدرج هذه الدوال بشكل غير متماثل في السطر. على سبيل المثال، تخيل أن <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> مضمنة في السطر ولكن <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> ليست كذلك. والنتيجة هي أن Memcheck «يرى» كل استدعاءات <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> كاستدعاءات مباشرة لـ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>، حتى عندما لا يحتوي مصدر البرنامج على استدعاءات غير مطابقة. </p><p>يسبب هذا الكثير من تقارير الأخطاء المربكة وغير ذات الصلة. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> يعطل هذه التحققات. لا ينصح عمومًا بتعطيلها بالرغم من ذلك، لأنك قد تفوت أخطاء حقيقية نتيجة لذلك.</p></body></html>
ca: <html><head/><body><p>Quan està activat, el Memcheck comprova que els blocs de la memòria en monticles es desassignen usant una funció que quadri amb la funció d'assignació. Això és, espera que s'usi <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> per a desassignar els blocs assignats per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600;font-style:italic;">delete</span> pels blocs assignats per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> pels blocs assignats per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Si es detecta un desquadrament, s'informa d'un error. En general, això és important perquè en diversos entorns, l'alliberament amb funcions que no quadren pot provocar fallades.</p><p>Tanmateix, hi ha un escenari a on aquests desquadraments no es poden evitar. Això és quan l'usuari proporciona una implementació de <span style="font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> que criden al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> i del <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> que criden al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, i aquestes funcions són incorporades asimètricament. Per exemple, imagineu que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> està incorporada, però <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> no ho és. El resultat és que el Memcheck «veurà» totes les crides <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> com a crides directes a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, inclús quan el codi font del programa contingui crides no desquadrades.</p><p>Això provoca força confusió i informes d'errors irrellevants. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> desactiva aquestes comprovacions. En general, no s'aconsella desactivar-ho, perquè es poden ometre errors reals com a resultat.</p></body></html>
eo: <html><head/><body><p>Kiam ĝi estas ebligita, Memcheck kontrolas ke amasblokoj estas malasignitaj uzante funkcion kiu kongruas kun la atribua funkcio. Tio estas, ĝi atendas ke <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> estu uzata por malasigni blokojn asignitajn de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight: 600; font-style:italic;">delete</span> por blokoj asignitaj de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, kaj <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> por blokoj asignitaj de <span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;">new[]</span>. Se malkongruo estas detektita, eraro estas raportita. Ĉi tio ĝenerale gravas ĉar en iuj medioj, liberigi kun ne-kongrua funkcio povas kaŭzi kraŝojn.</p><p>Estas tamen scenaro kie tiaj miskongruoj ne povas esti evititaj. Tio estas kiam la uzanto disponigas efektivigojn de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;">new[]</span> kiuj vokas <span style=" font-family:'Monospace'; font-weight:600 ; font-style:italic;">malloc</span> kaj de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> tiun vokon <span style=" font-family: 'Monospace'; font-weight:600; font-style:italic;">free</span>, kaj ĉi tiuj funkcioj estas malsimetrie enliniitaj. Ekzemple, imagu, ke <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> estas enliniita sed <span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;">new[]</span> ne estas. La rezulto estas, ke Memcheck "vidas" ĉiujn <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> vokojn kiel rektajn vokojn al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, eĉ kiam la programfonto enhavas neniujn miskongruajn vokojn.</p><p>Ĉi tio kaŭzas multajn konfuzajn kaj sensignifajn erarajn raportojn. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> malŝaltas ĉi tiujn kontrolojn. Ĝenerale ne estas konsilinde malŝalti ilin, ĉar vi eble maltrafos verajn erarojn kiel rezulto.</p></body></html>
es: <html><head/><body><p>Cuando se activa, Memcheck comprueba que los bloques del montículo se liberan usando una función que concuerde con la función de asignación. Es decir, espera que se use <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> para liberar los bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> para los bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> para los bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Si se detecta una discordancia, se informará del error. Esto es generalmente importante, ya que en algunos entornos la liberación con una función que no corresponda puede original bloqueos del programa.</p><p>Sin embargo, existe un escenario en el que estas discordancias no se pueden evitar. Esto ocurre cuando el usuario proporciona implementaciones para <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> que llaman a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> y para <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> que llaman a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, y dichas funciones se usan «inline» de forma asimétrica. Por ejemplo, imagine que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> es «inline», pero <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> no. El resultado es que Memcheck «ve» todas las llamadas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> como llamadas directas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, incluso cuando el código fuente del programa contiene llamadas no coincidentes.</p><p>Esto causa gran cantidad de confusión y de informes de error irrelevantes. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> desactiva estas comprobaciones. Por lo general, no es aconsejable desactivarlas, ya que como resultado puede perder errores reales.</p></body></html>
fr: <html><head/><body><p>Quand cette option est activée, Memcheck vérifie que les blocs du tas local sont libérés en utilisant une fonction fonctionnant de façon similaire à la fonction d'allocation. Cela veut dire qu'elle suppose être <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">libre</span> d'être utilisée pour libérer des blocs alloués par <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « malloc » </span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « delete » </span> pour les blocs alloués par <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, et <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> pour les blocs alloués par <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « new [] » </span>. Si une incohérence est détectée, une erreur est signalée. En général, cette incohérence est importante car, dans certains environnements, une libération avec cette fonction de non vérification peut conduire à des plantages.</p><p>Cependant, ceci est un scénario où de telles incohérences ne peuvent être évitées. Ce cas se produit quand l'utilisateur propose des implémentations de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « new » </span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « new [] » </span> appelant <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « malloc » </span> et de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « delete » </span> / <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « delete [] »</span> appelant <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « free »</span> et ces fonctions sont intégrées de façon asymétrique. Par exemple, imaginez que la fonction <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « delete[] » </span> est intégrée mais que la fonction <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « new[] » </span> ne le soit pas. Le résultat est que Memcheck &quot;voit&quot; tous les appels à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « delete [] » </span> comme des appels directs à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « free »</span>, même quand la source du programme ne contient aucun appel incohérent.</p><p> Ceci cause beaucoup de confusion et des rapports d'erreurs non pertinents. L'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> désactive ces vérifications. Cependant, il n'est pas souhaitable de les désactiver car vous pourriez alors passer à côté de véritables erreurs.</p></body></html>
gl: <html><head/><body><p>Ao activarse, Memcheck comproba que os bloques do monte (heap) se liberan usando unha función que se corresponde coa función de asignación. É dicir, espera que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> se use para liberar bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> para bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> para bloques asignados con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Se se detecta unha incoherencia, infórmase dela como erro. Isto é importante en xeral porque en algúns ambientes liberar cunha función que non corresponda pode causar quebras.</p><p>Porén existe un escenario no que a falta de coincidencia non se pode evitar. É cando o usuario fornece implementacións de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span> ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> que chaman a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> ou de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> ou<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> que chaman a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, e estas funcións incrústanse de maneira asimétrica. Por exemplo, imaxine que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> está incrustada pero <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> non. Como resultado, Memcheck «ve» todas as chamadas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> como chamadas directas a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, incluso cando o código do programa non contén chamadas que non coincidan.</p><p>Isto causa unha morea de confusión e de informes de erro irrelevantes. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> desactiva estas comprobacións. Porén, en xeral non se recomenda desactivalas, porque iso podería levar a perderse erros reais.</p></body></html>
ka: <html><head/><body><p>როდესაც ეს პარამეტრი ჩართულია, Memcheck ამოწმებს, რომ დინამიური მეხსიერების ბლოკების დეალოკაცია ხდება იმ ფუნქციით, რომელიც შეესაბამება გამოყოფის (allocation) ფუნქციას. კერძოდ, იგი მოელის, რომ ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> გამოყენებული იქნება ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>-ით გამოყოფილი ბლოკებისთვის, ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> — ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>-ით გამოყოფილისთვის, ხოლო ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> — ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>-ით გამოყოფილისთვის. შეუსაბამობის აღმოჩენის შემთხვევაში, მოხსენდება შეცდომა. ეს ზოგადად მნიშვნელოვანია, რადგან ზოგიერთ გარემოში შეუსაბამო ფუნქციით მეხსიერების გათავისუფლებამ შეიძლება გამოიწვიოს პროგრამის კრაში.</p><p>თუმცა, არსებობს სცენარი, როდესაც ასეთი შეუსაბამობები გარდაუვალია. ეს ხდება მაშინ, როდესაც მომხმარებელი თავად ქმნის ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>-ის იმპლემენტაციებს, რომლებიც იძახებენ ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>-ს, ხოლო ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> იძახებს ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>-ს და ეს ფუნქციები ასიმეტრიულად არის ჩაშენებული (inlined). მაგალითად, წარმოიდგინეთ, რომ ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> ჩაშენებულია, ხოლო ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> — არა. შედეგად, Memcheck ყველა <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span>-ის გამოძახებას „ხედავს“, როგორც ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>-ს პირდაპირ გამოძახებას, მაშინაც კი, როდესაც პროგრამის საწყისი კოდი არ შეიცავს შეუსაბამო გამოძახებებს.</p><p>ეს იწვევს ბევრ დამაბნეველ და უადგილო შეცდომის ანგარიშს. პარამეტრი <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> თიშავს ამ შემოწმებებს. თუმცა, მათი გათიშვა ზოგადად არ არის რეკომენდებული, რადგან ამის გამო შეიძლება გამოგეპაროთ რეალური შეცდომები.</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면 Memcheck에서 힙 블록 해제를 힙 블록 할당 함수와 일치하는 함수로 하는지 검사합니다. 즉, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> 함수가 호출되면 해당 블록이 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>으로 할당되었는지, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> 함수가 호출되면 해당 블록이 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>로 할당되었는지, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 함수가 호출되면 해당 블록이 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>로 할당되었는지 확인합니다. 함수가 일치하지 않으면 오류를 보고합니다. 일부 환경에서는 일치하지 않는 함수로 해제할 때 충돌이 발생할 수 있기 때문에 일반적으로 중요합니다.</p><p>한편 이러한 불일치가 필요한 경우가 있습니다. 예를 들어서 사용자 정의 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> 구현이 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>을 호출하고 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 구현이 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>를 호출하며, 해당 함수 중 한 쪽만 인라인되는 경우가 있습니다. 예를 들어서 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span>는 인라인되었지만 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>는 인라인되지 않았을 수도 있습니다. 이 때 Memcheck에서는 짝이 맞지 않는 경우가 없더라도 모든 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 호출을 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> &quot;직접&quot; 호출로 간주합니다.</p><p>따라서 관계 없는 혼동되는 오류를 보고하게 됩니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> 옵션은 이 검사를 비활성화합니다. 실제 오류를 놓칠 수도 있기 때문에 비활성화하지 않기를 추천합니다.</p></body></html>
nl: <html><head/><body><p>Indien u het heeft ingeschakeld, dan controleert Memcheck of heap blokken zijn gedealloceerd door de functie die bij de allocatie-functie hoort. Dit houd in dat het verwacht dat <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> wordt gebruikt voor het dealloceren van blokken die gealloceerd zijn door <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> voor blokken gealloceerd door <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> voor blokken gealloceerd door <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Bij detectie van een mismatch, volgt een foutmelding. Dit is in het algemeen belangrijk omdat in sommige omgevingen, vrijgave met een niet bijbehorende functie een crash kan veroorzaken.</p><p>Er is echter een scenario waar dergelijke mismatches onvermijdbaar zijn. Dat is wanneer de gebruiker een implementatie geeft van <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> dat <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> en of <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> aanroept dat op zijn beurt <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> aanroept, en dat deze functies asymmetrisch inlined zijn. Bijvoorbeeld, stelt u zich voor dat <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> is inlined maar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> is dat niet. Het resultaat zal zijn dat Memcheck &quot;ziet&quot; dat alle <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> aanroepen als directe calls naar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, zelfs als in de broncode van het programma geen mismatched aanroepen heeft.</p><p>Dit veroorzaakt veel verwarrende en irrelevante foutmeldingen. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> schakelt deze controle uit. Het algemene advies is echter om het niet uit te schakelen omdat u dan echte fouten kan missen.</p></body></html>
pl: <html><head/><body><p>Gdy włączone, to Memcheck sprawdza czy bloki sterty są zwalniane przy użyciu pasującej funkcji przydzielającej. To jest, oczekuje użycia <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> do zwolnienia bloków przydzielonych przez <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> dla bloków przydzielonych przez <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, oraz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> dla bloków przydzielonych przez <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Gdy zostanie wykryta niezgodność, to zgłaszany jest błąd. W ogólności jest to ważne, bo w niektórych środowiskach, zwalnianie przy użyciu niepasującej funkcji może powodować usterki.</p><p>Istnieją jednak scenariusze, w których takich niezgodności nie da się uniknąć. Są to przypadki, w których użytkownik dostarcza implementacje <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> które wywołują <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> oraz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> które wywołują <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, oraz gdy funkcje te są asymetrycznie wplatane w wierszu. Na przykład wyobraź sobie, że <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> jest wpleciony w wiersz lecz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> nie jest. Wynikiem jest to, że Memcheck &quot;widzi&quot; wszystkie wywołania <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> jako bezpośrednie wywołania do <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, nawet w przypadku, w którym kod źródłowy programu nie zawiera niezgodnych wywołań.</p><p>Powoduje to wiele mylących i nieprawidłowych zgłoszeń o błędach. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> wyłącza te sprawdzenia. Ogólnie nie zaleca się ich wyłączania, bo ostatecznie można pominąć prawdziwe błędy.</p></body></html>
pt: <html><head/><body><p>Quando a opção estiver activa, o Memcheck verifica se os blocos da memória de dados são libertados, usando uma função que corresponde à função de alocação. Isto é, ele espera pelo uso do <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> para libertar os blocos alocados pelo <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> para os blocos alocados pelo <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> para os blocos alocados pelo <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Se for detectada uma inconsistência, é comunicado um erro. Isto é geralmente importante porque, em alguns ambientes, a libertação com uma função não-correspondente poderá provocar estoiros.</p><p>Conduto, existe um cenário em que essas inconsistências não possam ser evitadas. Isto é, quando o utilizador fornece implementações do <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> que invoquem o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> e do <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> que invoquem o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, estando essas funções incorporadas de forma assimétrica. Por exemplo, imagine que o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> está incorporado mas o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> não. O resultado é que o Memcheck &quot;vê&quot; todas as chamadas <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> como chamadas directas ao <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, mesmo quando o código do programa não contém chamadas não-correspondentes.</p><p>Isto provoca bastante confusão e relatórios de erros irrelevantes. O <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> desactiva essas verificações. Não é aconselhável de um modo geral desactivá-las, porque poderá ignorar erros reais como como consequência disso.</p></body></html>
pt_br: <html><head/><body><p>Quando habilitado, o Memcheck verifica se os blocos de heap foram desalocados usando uma função que corresponde à função de alocação. Ou seja, ele espera que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> seja usado para desalocar blocos alocados por <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> para blocos alocados por <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> para blocos alocados por <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Se uma incompatibilidade for detectada, um erro será relatado. Isso é geralmente importante porque, em alguns ambientes, liberar com uma função não correspondente pode causar travamentos.</p><p>No entanto, há um cenário em que tais incompatibilidades não podem ser evitadas. É quando o usuário fornece implementações de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> que chamam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> e de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> que chamam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, e essas funções são assimetricamente embutido. Por exemplo, imagine que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> esteja embutido, mas <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> não esteja. O resultado é que o Memcheck "vê" todas as chamadas <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> como chamadas diretas para <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, mesmo quando o código-fonte do programa não contém chamadas incompatíveis.</p><p>Isso causa muitos relatórios de erros confusos e irrelevantes. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> desabilita essas verificações. Geralmente, não é aconselhável desabilitá-las, pois você pode perder erros reais como resultado.</p></body></html>
sv: <html><head/><body><p>När aktiverat, kontrollerar Memcheck att heap-block frigörs med användning av en funktion som motsvarar tilldelningsfunktionen. Det vill säga, det förväntas att <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> används för att frigöra block tilldelade av <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> för block tilldelade av <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> för block tilldelade av <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Om en felparning detekteras, rapporteras ett fel. Det är i allmänhet viktigt eftersom i vissa miljöer kan frigörelse med en icke-motsvarande funktion kan orsaka krascher.</p><p>Det finns dock ett scenario då sådana felparningar inte kan undvikas. Det är när användaren tillhandahåller implementeringar av <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> som anropar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> och av <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> som anropar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, och dessa funktioner är asymmetriskt infogade på plats. Anta exempelvis att <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> är infogad med inte <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Resultatet är att Memcheck &quot;ser&quot; alla anrop till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> som direkta anrop till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, även när programmets källkod inte innehåller några felparade anrop.</p><p>Det orsakar mycket förvirring och ovidkommande felrapporter. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> inaktiverar kontrollerna. Det är i allmänhet dock inte lämpligt att inaktivera dem, eftersom det kan resultera i att man missar verkliga fel.</p></body></html>
tr: <html><head/><body><p>Etkinleştirildiğinde, Memcheck küme bloklarını, tahsis etme işlevi ile eşleşen bir işlev kullanılarak boşaltıldığını denetler. Yani, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> tarafından tahsis edilmiş blokları boşaltmak için <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> ' nin <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span> tarafından tahsis edilmiş bloklar için <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> ' in ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> tarafından tahsis edilmiş bloklar için <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> ' bin kullanılmış olduğunu bekler. Eğer bir uyumsuzluk tespit edilirse, bir hata raporlanır. Bu genel olarak önemlidir çünkü bazı ortamlarda, eşleşmeyen bir işlev ile boşaltmak kazalara sebep olabilir.</p><p>Buna rağmen bu uyumsuzluklardan kaçınılamayan bir senaryo vardır. Bu bir kullanıcı C ' yi çağıran A,B ve E ' yi çağıran D ' nin uygulamalarını sağladığında gerçekleşir ve bu işlevler asimetrik olarak yazılmıştır. Bu bir kullanıcı <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> ' u çağıran <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/ ' i çağıran <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> ' i çağıran <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, ' nin uygulamalarını sağladığında gerçekleşir ve bu işlevler asimetrik olarak yazılmıştır. Örneğin, düşünün ki <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> yazıldı ama <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> yazılmadı. Sonuçta Memcheck hepsini <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> direk çağrı <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>' e direk çağrı olarak çağırır, hatta program kaynağı hiçbir uyumsuz çağırılar içermediğinde bile.</p><p>Bu birçok kafa karıştırıcı ve alakasız hata raporlarına sebep olur. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> bu denetlemeleri devre dışı bırakır. Genel olarak bunların devre dışı bırakılması tavsiye edilebilirdir çünkü bir rapor olarak gerçek hataları gözden kaçırabilirsiniz.</p></body></html>
uk: <html><head/><body><p>Якщо увімкнено, Memcheck перевірятиме, чи вивільняються блоки «купи» за допомогою функції, яка відповідає функції розміщення блоків. Тобто, програма перевірятиме, чи використано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> для вивільнення блоків, які було отримано для розміщення даних за допомогою функції <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, чи використано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> для блоків, які отримано за допомогою <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>, і чи використано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> для блоків, які отримано за допомогою <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>. Якщо буде виявлено невідповідність, програма повідомить про помилку. Це загалом важливо, оскільки у певних середовищах вивільнення за допомогою невідповідної функції може призвести до аварійних завершень роботи програми.</p><p>Втім, існують сценарії, за яких таких невідповідностей не уникнути. Таке трапляється, якщо користувач надає реалізації <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span>, які викликають <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>, і <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span>, які викликають <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, і ці функції є асиметрично вбудованими. Наприклад, припустімо, що <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> вбудовано, а <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> — ні. У результаті Memcheck «бачить» усі виклики <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> як безпосередні виклики <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, навіть якщо у коді програми немає викликів без відповідників.</p><p>Це спричиняє багато незрозумілих та помилкових звітів щодо помилок. Параметр <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> вимикає такі перевірки. Загалом, ми не радимо вимикати ці перевірки, оскільки ви можете пропустити якісь справжні помилки.</p></body></html>
zh_cn: <html><head/><body><p>若启用，则 Memcheck 会检查堆块是否被用和分配时用的函数对应的函数释放。也就是说，它会检查 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> 被用来释放用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span> 分配的块，以及 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> 被用来释放用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span> 分配的块，以及 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 被用来释放用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> 分配的块。如果它检测到不匹配的情况，它会报告一个错误。一般来说这比较重要，因为在某些环境下，用不匹配的函数释放会导致崩溃。</p><p>然而，某些情况下这种不匹配不可避免。例如，当用户自己提供了 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> 的实现，并且它们调用了 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malloc</span>，或者提供了 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>/<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 的实现，并且它们调用了 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>，并且这些函数被不对称地内联了的话。例如，想象一下如果 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 被内联了，但是 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">new[]</span> 没有。这种情况下，Memcheck 会将所有的 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete[]</span> 调用 &quot;视作&quot; 对 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> 的直接调用，即使程序源代码中并没有不匹配的调用。</p><p>这会令人非常疑惑，并且会产生很多无关的错误报告。<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--show-mismatched-frees=no</span> 会禁止这些检查。但是，一般来说不推荐禁止它们，因为您可能会错过真实存在的错误。</p></body></html>
