Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Controls which stack trace(s) to keep for malloc'd and/or free'd blocks. </p><p>With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, a stack trace is recorded at allocation time, and is associated with the block. When the block is freed, a second stack trace is recorded, and this replaces the allocation stack trace. As a result, any &quot;use after free&quot; errors relating to this block can only show a stack trace for where the block was freed. </p><p>With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, both allocation and the deallocation stack traces for the block are stored. Hence a &quot;use after free&quot; error will show both, which may make the error easier to diagnose. Compared to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, this setting slightly increases Valgrind's memory use as the block contains two references instead of one. </p><p>With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, only the allocation stack trace is recorded (and reported). With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, only the deallocation stack trace is recorded (and reported). These values somewhat decrease Valgrind's memory and cpu usage. They can be useful depending on the error types you are searching for and the level of detail you need to analyze them. For example, if you are only interested in memory leak errors, it is sufficient to record the allocation stack traces. </p><p>With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, no stack traces are recorded for malloc and free operations. If your program allocates a lot of blocks and/or allocates/frees from many different stack traces, this can significantly decrease cpu and/or memory required. Of course, few details will be reported for errors related to heap blocks. </p><p>Note that once a stack trace is recorded, Valgrind keeps the stack trace in memory even if it is not referenced by any block. Some programs (for example, recursive algorithms) can generate a huge number of stack traces. If Valgrind uses too much memory in such circumstances, you can reduce the memory required with the options <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> and/or by using a smaller value for the option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
ar: <html><head/><body><p>يتحكم هذا الخيار في تتبع (تتبعات) المكدس المطلوب الاحتفاظ بها للكتل التي تم تخصيصها و/أو تحريرها. </p><p>باستخدام <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>، يُسجل تتبع المكدس عند التخصيص، ويُربط بالكتلة. عند تحرير الكتلة، يُسجل تتبع مكدس ثانٍ، ويحل محل تتبع مكدس التخصيص. نتيجةً لذلك، فإن أي أخطاء "استخدام بعد التحرير" تتعلق بهذه الكتلة لا تُظهر سوى تتبع المكدس لمكان تحرير الكتلة. </p><p>باستخدام <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>، يُخزن كلٌ من تتبعي مكدس التخصيص وإلغاء التخصيص للكتلة. لذا، سيُظهر خطأ "الاستخدام بعد التحرير" كلا الخيارين، مما يُسهّل تشخيص الخطأ. مقارنةً بـ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>، يزيد هذا الإعداد من استخدام Valgrind للذاكرة بشكل طفيف، حيث تحتوي الكتلة على مرجعين بدلاً من مرجع واحد. </p><p>مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>، يُسجل مسار التخصيص فقط (ويُبلغ عنه). مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>، يُسجل مسار إلغاء التخصيص فقط (ويُبلغ عنه). تُقلل هذه القيم إلى حد ما من استخدام Valgrind للذاكرة ووحدة المعالجة المركزية. يمكن أن تكون هذه البيانات مفيدةً بناءً على أنواع الأخطاء التي تبحث عنها ومستوى التفاصيل اللازمة لتحليلها. على سبيل المثال، إذا كنت مهتمًا فقط بأخطاء تسرب الذاكرة، فيكفي تسجيل تتبعات تخصيص المكدس. </p><p>مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>، لا تُسجل أي تتبعات مكدس لعمليات malloc و free. إذا خصص برنامجك عددًا كبيرًا من الكتل و/أو خصص/حرر من العديد من تتبعات المكدس المختلفة، فقد يؤدي ذلك إلى تقليل استهلاك وحدة المعالجة المركزية و/أو الذاكرة بشكل كبير. بالطبع، لن يُبلغ إلا عن تفاصيل قليلة للأخطاء المتعلقة بكتل الكومة. </p><p>لاحظ أنه بمجرد تسجيل تتبع المكدس، يحتفظ Valgrind به في الذاكرة حتى لو لم يُشر إليه بواسطة أي كتلة. يمكن لبعض البرامج (مثل الخوارزميات التكرارية) إنشاء عدد كبير من تتبعات المكدس. إذا استخدم Valgrind ذاكرةً كبيرةً جدًا في مثل هذه الظروف، يمكنك تقليل الذاكرة المطلوبة باستخدام الخيارين <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> و/أو باستخدام قيمة أصغر للخيار <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
ca: <html><head/><body><p>Controla quines traces de pila mantenir per als blocs «malloc» i/o «free». </p><p>Amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, la traça de pila s'enregistra en temps d'assignació, i està associada amb el bloc. Quan el bloc s'allibera, s'enregistra una segona traça de pila, i aquesta substitueix la traça d'assignació de la pila. Com a resultat, qualsevol error d'«ús després d'alliberar» relacionat amb aquest bloc només pot mostrar una traça de pila per a quan s'ha alliberat el bloc. </p><p>Amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, s'emmagatzemen tant les traces de pila d'assignació com les desassignació. Per això, un error d'«ús després d'alliberar» els mostrarà ambdós, que podria facilitar la diagnosi de l'error. Comparat amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, aquest paràmetre incrementarà una mica l'ús de la memòria del Valgrind, ja que el bloc conté dues referències en lloc d'una. </p><p>Amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, només s'enregistra (i informa) la traça de pila d'assignació. Amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, només s'enregistra (i informa) la traça de pila de desassignació. Aquests valors redueixen una mica l'ús de la memòria i de la CPU del Valgrind. Poden ser útils depenent dels tipus d'error que cerqueu i el nivell de detall que cal per a analitzar-los. Per exemple, si sou l'únic interessat en els errors de fuita de memòria, és suficient enregistrar les traces de pila d'assignació. </p><p>Amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, no s'enregistra cap traça de pila per les operacions de «malloc» i «free». Si el programa assigna molts blocs i/o assigna/allibera des de moltes traces de pila diferents, això pot reduir significativament la CPU i/o memòria requerida. Evidentment, s'informaran pocs detalls relacionats amb els blocs de la memòria en monticles. </p><p>Cal tenir en compte que un cop s'ha enregistrat una traça de pila, el Valgrind manté la traça de la pila en la memòria encara que no estigui referenciada per cap bloc. Diversos programes (per exemple, els algorismes recursius) poden generar un nombre enorme de piles de traces. Si el Valgrind també usa molta memòria en aquestes circumstàncies, podeu reduir la memòria requerida amb les opcions <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> i/o usant un valor més petit per a l'opció <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
eo: <html><head/><body><p>Regas kiuj stakspuroj konservendas por mallokitaj kaj/aŭ liberigitaj blokoj. </p><p>Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, stakspuro estas registrita ĉe asignotempo, kaj estas rilata al la bloko. Kiam la bloko estas liberigita, dua stakspuro estas registrita, kaj ĉi tio anstataŭigas la asignostakspuron. Kiel rezulto, ĉiuj "uzo post free" eraroj rilataj al ĉi tiu bloko povas nur montri stakspuron por kie la bloko estis liberigita. </p><p>Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, ambaŭ asigno kaj la deasignaj stakspuroj por la bloko estas stokitaj. Tial eraro "uzo post free" montros ambaŭ, kio povas faciligi la diagnozon de la eraro. Kompare kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, ĉi tiu agordo iomete pliigas la memoruzon de Valgrind kiel la bloko enhavas du referencojn anstataŭ unu. </p><p>Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, nur la asigno-stako estas registrita (kaj raportis). Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, nur la senasigna stakspuro estas registrita (kaj raportita). Ĉi tiuj valoroj iom malpliigas la memoron kaj la uzadon de CPU de Valgrind. Ili povas esti utilaj depende de la erartipoj, kiujn vi serĉas, kaj la nivelo de detalo, kiun vi bezonas por analizi ilin. Ekzemple, se vi nur interesiĝas pri memor-likaj eraroj, sufiĉas registri la asigno-stakojn. </p><p>Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">neniu</span>, neniuj stakspuroj estas registritaj por malloc- kaj free-operacioj. Se via programo asignas multajn blokojn kaj/aŭ asignas/liberigas de multaj malsamaj stakspuroj, tio povas signife malpliigi CPU kaj/aŭ memoro necesa. Kompreneble, malmultaj detaloj estos raportitaj pri eraroj rilate al amasblokoj. </p><p>Rimarku ke post kiam stakspuro estas registrita, Valgrind konservas la stakspuron en memoro eĉ se ĝi ne estas referencita de iu bloko. Kelkaj programoj (ekzemple, rekursiemaj algoritmoj) povas generi grandegan nombron da stakspuroj. Se Valgrind uzas tro da memoro en tiaj cirkonstancoj, vi povas redukti la bezonatan memoron per la opcioj <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> kaj/aŭ uzante pli malgrandan valoron por la opcio <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
es: <html><head/><body><p>Controla las trazas de la pila a guardar para los bloques asignados con «malloc» y liberados con «free».</p><p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignación y luego liberación</span>, se guarda una traza de la pila durante la asignación y se asocia con el bloque. Cuando se libera el bloque, se guarda una segunda traza de la pila, que sustituye a la traza de la pila guardada durante la asignación. Como resultado, cualquier error de «uso tras la liberación» relativo a este bloque solo podrá mostrar una traza de la pila para donde se ha liberado el bloque.</p><p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignación y liberación</span>, se guardan tanto la traza de la pila de la asignación como la de la liberación del bloque. Por consiguiente, un error de «uso tras la liberación» mostrará ambas, lo que puede facilitar el diagnóstico del error. Comparado con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignación y luego liberación</span>, este ajuste aumenta ligeramente el uso de memoria de Valgrind, ya que cada bloque contiene dos referencias en lugar de una.</p><p> Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignación</span>, se guarda (y se notifica) solo la traza de la pila de la asignación. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">liberación</span>, se guarda (y se notifica) solo la traza de la pila de la liberación. Estos valores disminuyen en cierto modo el uso de memoria y de CPU de Valgrind. Pueden ser de utilidad según los tipos de errores que esté buscando y el nivel de detalle que necesite para analizarlos. Por ejemplo, si solo está interesado en errores de fugas de memoria, es suficiente con guardar las trazas de la pila de las asignaciones.</p><p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ninguna</span>, no se guardan trazas de la pila para las operaciones de asignación y de liberación de memoria. Si su programa asigna muchos bloques y/o asigna o libera desde muchas trazas de la pila distintas, esto puede disminuir significativamente la cantidad de CPU y/o memoria necesarias. Por supuesto, se mostrarán pocos detalles en los errores relacionados con los bloques del montículo.</p><p>Tenga presente que en cuanto se guarda una traza de la pila, Valgrind la mantiene en memoria incluso si no se hace referencia a ella en ningún otro bloque. Algunos programas (por ejemplo, los algoritmos recursivos) pueden generar un número enorme de trazas de la pila. Si Valgrind usa demasiada memoria en estas circunstancias, puede reducir la memoria requerida con la opción <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> y/o usando un valor más pequeño para la opción <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
fr: <html><head/><body><p>Contrôle quelles traces de piles conserver pour les blocs alloués par « malloc » et libérés par « free ». </p><p>Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « alloc-then-free » </span>, une trace de pile est enregistrée au moment de l'allocation et est associée avec le bloc. Quand le bloc est libéré, une seconde trace de pile est enregistrée et elle remplace la trace d'allocation dans la pile. Comme résultat, toute erreur &quot;Utilisation après libération&quot; concernant ce bloc ne peut afficher qu'une trace de pile que suite à la libération du bloc. </p><p>Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « alloc-and-free » </span>, les deux traces d'allocation et de désallocation pour le bloc sont enregistrées. Par conséquent, une erreur &quot;Utilisation après libération&quot; sera affichée pour les deux évènements, ce qui peut rendre l'erreur plus facile à identifier. En comparaison de l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « alloc-then-free » </span>, ce paramétrage augmente légèrement l'utilisation mémoire de Valgrind puisque le bloc contient deux références au lieu d'une. </p><p>Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « alloc » </span>, seule la trace de la pile d'allocations est enregistrée (et affichée. Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « free » </span>, seule la trace de pile de désallocation est enregistrée (et affichée). Ces valeurs diminuent quelque peu la consommation de mémoire et de puissance processeur à Valgrind. Ces options peuvent vous être utiles selon les types d'erreurs que vous recherchez et le niveau de détails dont vous avez besoin pour les analyser. Par exemple, si vous n'êtes intéressé que par les erreurs de fuites de mémoire, il est suffisant d'enregistrer les traces de pile d'allocation. </p><p>Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;"> « none » </span>, aucune trace de pile n'est enregistrée pour les appels à « malloc » et à « free ». Si votre programme alloue beaucoup de blocs et / ou alloue / libère à partir de différentes traces de piles, ceci peut réduire significativement la consommation de mémoire et de puissance processeur nécessaires. Bien sûr, peu de détails seront fournis pour les erreurs concernant les blocs de tas local. </p> <p>Veuillez noter qu'une fois que la trace de pile est enregistrée, Valgrind conserve la trace de la pile en mémoire, même si elle n'est référencée par aucun bloc. Certains programmes (par exemple, les algorithmes récursifs) peuvent produire un nombre énorme de traces de pile. Si Valgrind utilise trop de mémoire en de tels circonstances, vous pouvez réduire la mémoire nécessaire avec les options <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> et / ou en utilisant une valeur plus petite pour l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
gl: <html><head/><body> <p>Controla que trazas de rima manter para bloques afectados por malloc ou free.</p> <p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignar-logo-liberar</span> grávase unha traza de rima no momento da asignación e asóciase co bloque. Cando se libera o bloque grávase unha segunda traza de rima que substitúe a de asignación. Como resultado, calquera erro de uso tras liberar relacionado co bloque só pode mostrar unha traza de rima do lugar onde se liberou o bloque.</p> <p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignar-e-liberar</span>, almacénanse as trazas de rima tanto da asignación como da liberación do bloque. Polo tanto os erros de uso tras liberar mostrarán as dúas, o que podería facilitar a diagnose do erro. En comparación con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignar-logo-liberar</span>, esta opción aumenta lixeiramente o uso de memoria de Valgrind, xa que o bloque contén dúas referencias en vez de unha.</p> <p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">asignar</span> só se grava (e se informa de) a traza de rima da asignación. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">liberar</span> só se grava (e se informa de) a traza de rima da liberación. Estes valores diminúen lixeiramente o uso de memoria e procesador de Valgrind. Poden ser útiles segundo o tipo de erros que busque e o nivel de detalle que necesite para analizalos. Por exemplo, se só lle interesan os erros de perdas de memoria, abonda con gravar as trazas de rima das asignacións.</p> <p>Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ningunha</span> non se grava ningunha traza de rima para operacións de malloc e de free. Se o seu programa asigna unha morea de bloques ou asigna ou libera desde moitas trazas de rima distintas, isto pode diminuír de maneira significativa as necesidades de procesador e de memoria. Por suposto, non se fornecerán moitos detalles sobre erros relacionados cos bloques do monte (heap).</p> <p>Teña en conta que unha vez se grava unha traza de rima Valgrind mantena en memoria incluso cando non hai ningún bloque con referencia a ela. Algúns programas (por exemplo, algoritmos recursivos) poden xerar un número enorme de trazas de rima. Se Valgrind usa demasiada memoria nesas circunstancias, pode reducir a memoria necesaria coas opcións <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> (manter as trazas de rima) ou usando un valor menor para a opción <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span> (número de chamadores). </p></body></html>
ka: <html><head/><body><p>აკონტროლებს, თუ რომელი სტეკის ტრესირება (ან ტრესირებები) უნდა იქნას შენახული გამოყოფილი (malloc'd) ან/და გათავისუფლებული (free'd) ბლოკებისთვის. </p><p>რეჟიმში <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, სტეკის ტრესირება იწერება გამოყოფის დროს და ასოცირდება ბლოკთან. როდესაც ბლოკი თავისუფლდება, იწერება მეორე ტრესირება, რომელიც ანაცვლებს გამოყოფისას ჩაწერილ ინფორმაციას. შედეგად, ამ ბლოკთან დაკავშირებული ნებისმიერი „გამოყენება გათავისუფლების შემდეგ“ (use after free) შეცდომა აჩვენებს მხოლოდ იმ ადგილს, სადაც მოხდა ბლოკის გათავისუფლება.</p><p>რეჟიმში <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, ინახება ბლოკის გამოყოფის და გათავისუფლების ორივე ტრესირება. შესაბამისად, „გამოყენება გათავისუფლების შემდეგ“ შეცდომა აჩვენებს ორივეს, რაც აადვილებს პრობლემის დიაგნოსტიკას. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>-სთან შედარებით, ეს პარამეტრი ოდნავ ზრდის Valgrind-ის მეხსიერების გამოყენებას, რადგან ბლოკი შეიცავს ორ მიმთითებელს ერთის ნაცვლად.</p><p>რეჟიმში <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, იწერება (და მოხსენდება) მხოლოდ გამოყოფის ტრესირება. რეჟიმში <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, იწერება მხოლოდ გათავისუფლების ტრესირება. ეს მნიშვნელობები გარკვეულწილად ამცირებს Valgrind-ის მეხსიერებისა და პროცესორის დატვირთვას. ისინი შეიძლება სასარგებლო იყოს იმის მიხედვით, თუ რომელი ტიპის შეცდომებს ეძებთ და ანალიზისთვის რა დონის დეტალიზაცია გჭირდებათ. მაგალითად, თუ მხოლოდ მეხსიერების გაჟონვის შეცდომები გაინტერესებთ, საკმარისია გამოყოფის ტრეს
ko: <html><head/><body><p>malloc/free를 호출한 블록의 스택 추적 유지 여부를 설정합니다.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>로 지정하면 블록의 할당 시간의 스택 추적을 기록하고 블록과 연결합니다. 블록이 해제되면 두 번째 스택 추적을 기록하고 할당 스택 추적을 대체합니다. 따라서 이 블록과 관련된 &quot;해제 이후 사용&quot; 오류는 해제된 블록의 스택 추적만 표시할 수 있습니다. </p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>로 지정하면 블록의 할당과 해제 스택 추적을 모두 저장합니다. 따라서 &quot;해제 이후 사용&quot; 오류는 할당과 해제 둘 다를 표시하며 더 쉽게 진단할 수 있습니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span> 설정과 비교했을 때 이 설정은 블록에 참조를 한 개 대신 두 개 저장하므로 Valgrind의 메모리 사용량을 증가시킵니다. </p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>으로 지정하면 할당 스택 추적만 기록하고 보고합니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>로 지정하면 해제 스택 추적만 기록하고 보고합니다. 이 설정은 Valgrind의 메모리와 CPU 사용량을 감소시킵니다. 검색하려는 오류 형식과 자세한 정도에 따라서 유용할 수도 있습니다. 예를 들어 메모리 누수 오류만 탐지하려면 할당 스택 추적만 기록해도 충분합니다.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>으로 지정하면 malloc과 free 작업의 스택 추적을 기록하지 않습니다. 프로그램에서 대량의 블록을 할당하거나 서로 다른 스택 추적에서 할당/해제를 수행한다면 필요한 CPU/메모리 사용량을 줄일 수도 있습니다. 힙 블록에 관련된 오류를 더 적게 보고합니다. </p><p>한 번 스택 추적을 기록하면 Valgrind는 어떠한 블록에서 참조하지 않더라도 스택 추적을 메모리에 기록합니다. 재귀 호출 알고리즘을 사용하는 일부 프로그램은 대량의 스택 추적을 생성할 수도 있습니다. 이러한 상황에서 Valgrind가 너무 많은 메모리를 사용한다면 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> 옵션이나 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span> 옵션의 값을 작게 조정해서 메모리 사용량을 줄일 수도 있습니다. </p></body></html>
nl: <html><head/><body><p>Hier stelt u in welke stack trace(s) worden opgenomen voor malloc'd en/of free'd blocks. </p><p>Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">vrijgave-na-allocatie</span>, wordt een stack trace opgenomen tijdens allocatie, en geassocieerd met het blok. Als het blok weer vrijgegeven is, dan wordt een tweede stack trace opgenomen, waarbij deze de allocatie stack trace vervangt. Met als resultaat, alle fouten voor &quot;gebruik-na-vrijgave&quot; wat betreft dit blok kan alleen een stack trace laten zien voor waar het blok was vrijgegeven. </p><p>Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloceren-en-vrijgave</span>, worden zowel de allocatie als de vrijgave stack traces van het blok opgeslagen. Waarbij een &quot;gebruik-na-vrijgave&quot;-fout ze beiden zal laten zien, wat het een diagnose van de fout makkelijker maakt. Vergeleken met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">vrijgave-na-allocatie</span>, vergroot deze instelling het geheugengebruik van Valgrind's een beetje omdat het blok in plaats van een nu twee referenties bevat. </p><p>Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, wordt alleen de allocatie stack trace opgenomen (en gerapporteerd). Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">vrij</span>, wordt alleen de deallocation stack trace opgenomen (en gerapporteerd). Deze instellingen verkleinen het gebruik van het geheugen en de cpu door Valgrind een beetje. Afhankelijk van de soorten fouten waarnaar u zoekt en hoe gedetailleerd u ze wilt analyseren kunnen ze handig zijn. Als u bijvoorbeeld alleen geïnteresseerd bent in geheugenlekken, dan volstaat het om de allocatie stack traces op te nemen. </p><p>Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">geen</span>, worden geen stack traces opgenomen voor malloc en free operaties. Als uw programma veel blokken toekent en/of in veel verschillende stack traces toekent/vrijgeeft, dan kan dit de benodigde cpu en/of geheugen belangrijk verminderen. Natuurlijk worden dan wel minder details over fouten wat betreft heap blokken gerapporteerd.</p><p>Merk op dat nadat een stack trace is opgenomen, Valgrind de stack trace in het geheugen bewaart, zelfs als er geen referentie met een blok is. Sommige programma's (bijvoorbeeld, recursive algoritmes) kunnen een groot aantal stack traces genereren. Als Valgrind in een dergelijk geval teveel geheugen gebruikt, dan kunt u de hoeveelheid benodigde geheugen verminderen met de optie <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> en/of door een kleiner getal te gebruiken voor <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
pl: <html><head/><body><p>Określa, które ślady stosu programu zachować dla bloków malloc lub free. </p><p>Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, ślad stosu jest zapisywany w chwili przydziału i jest skojarzony z blokiem. Gdy blok jest zwalniany, to drugi ślad stosu jest zapisywany i zastępuje ślad przydzielenia stosu. W wyniku, dowolne błędy &quot;użycia po zwolnieniu&quot; do tego bloku mogą wyświetlać jedynie ślad stosu w miejscu zwolnienia bloku. </p><p>Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, zarówno ślady przydział jak i zwolnienia stosu dla bloku są zachowywane. Stąd błąd &quot;użycia po zwolnieniu&quot; pokaże oba, co może pomóc przy zdiagnozowaniu błędu. W porównaniu z <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, ustawienie to nieznacznie zwiększa wykorzystanie pamięci przez Valgrinda, bo blok zawiera dwa odniesienia zamiast jednego. </p><p>Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, zapisywany (i zgłaszany) jest tylko ślad przydziału stosu. Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, zapisywany (i zgłaszany) jest tylko ślad zwolnienia przydziału na stosie. Wartości te w pewnym stopniu zmniejszają wykorzystanie pamięci i procesora przez Valgrinda. Mogą być użyteczne w zależności od rodzaju błędów, których szukasz i poziomu szczegółowości analizy. Na przykład, jeśli jesteś zainteresowany tylko błędami wycieku pamięci, to wystarczy zapisywać ślady przydziału na stosie. </p><p>Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, nie są zapisywane żadne ślady dla działań malloc oraz free. Jeśli twój program przydziela wiele bloków i/lub przydziela/zwalnia przydział z wielu różnych śladów stosu, to może to znacznie zmniejszyć wykorzystanie procesora i/lub pamięci. Oczywiście, kilka szczegółów będzie zgłaszanych dla błędów związanych z blokami na stercie. </p><p>Pamiętaj, że w chwili zapisania śladu stosu, Valgrind trzyma ślad stosu w pamięci nawet, gdy nie ma w nim odwołania do żadnego bloku. Niektóre programy (na przykład, rekursywne algorytmy) mogą tworzyć duże liczby śladów stosu. Jeśli Valgrind wykorzystuje zbyt dużo pamięci w takich przypadkach, to możesz zmniejszyć wymaganie co do pamięci przy użyciu opcji <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> i/lub poprzez użycie mniejszej wartości dla opcji <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
pt: <html><head/><body><p>Controla quais os registos da pilha a manter para os blocos sujeitos a 'malloc' ou 'free'. </p><p>Com a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">libertação-após-alocação</span>, é feito um registo da pilha na altura da alocação, ficando associado ao bloco. Quando esse bloco for libertado, é feito um segundo registo da pilha, substituindo o registo da pilha na alocação. Como resultado, quaisquer erros de &quot;uso após a libertação&quot; relacionados com este bloco só poderão mostrar um registo das chamadas quando o bloco foi libertado.</p><p>Com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alocação-e-libertação</span>, tanto o registo na alocação como o da libertação do bloco são guardados. Como tal, um erro de &quot;uso após a libertação&quot; irá mostrar ambos, o que tornará o erro mais fácil de diagnosticar. Em comparação com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">libertação-após-alocação</span>, esta configuração aumenta ligeiramente o uso de memória do Valgrind, dado que o bloco contém duas referências em vez de uma. </p><p>Com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alocação</span>, só é feito (e comunicado) o registo da pilha na alocação. Com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">libertação</span>, só é guardado (e comunicado) o registo da pilha na libertação. Eles poderão ser bastante úteis, dependendo do tipo de erros que anda à procura e com o nível de detalhe que precisa para os analisar. Por exemplo, se só estiver interessado nos erros de fugas de memória, é suficiente fazer um registo da pilha nas alocações. </p><p>Com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">nenhum</span>, não são guardados nenhuns registos da pilha para as operações de alocação e libertação. Se o seu programa alocar bastantes blocos e/ou alocar/libertar em diversos registos da pilha, isto poderá reduzir de forma significativa o uso de CPU e/ou memória necessários. Obviamente, poucos detalhes serão comunicados por erros relacionados com os blocos da memória de dados.</p><p>Lembre-se que, uma vez guardado um registo da pilha, o Valgrind mantém esse registo em memória, mesmo que não seja referenciado por nenhum bloco. Alguns programas (por exemplo, os algoritmos recursivos) poderão gerar uma grande quantidade de registos da pilha. Se o Valgrind usar demasiada memória nessas circunstâncias, poderá reduzir a memória necessária com as opções <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> e/ou usar um valor menor para a opção <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
pt_br: <html><head/><body><p>Controla qual(is) rastreamento(s) de pilha manter para blocos mallocados e/ou liberados. </p><p>Com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, um rastreamento de pilha é registrado no momento da alocação e associado ao bloco. Quando o bloco é liberado, um segundo rastreamento de pilha é registrado, substituindo o rastreamento de pilha de alocação. Como resultado, quaisquer erros de &quot;uso após liberação&quot; relacionados a este bloco podem mostrar apenas um rastreamento de pilha para onde o bloco foi liberado. </p><p>Com <span style=" font-family:'Monospace'; font-weight:600;font-style:italic;">alloc-and-free</span>, tanto os rastreamentos de pilha de alocação quanto os desalocação para o bloco são armazenados. Portanto, um erro "use after free" mostrará ambos, o que pode facilitar o diagnóstico do erro. Comparado a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, esta configuração aumenta ligeiramente o uso de memória do Valgrind, pois o bloco contém duas referências em vez de uma. </p><p>Com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, apenas o rastreamento da pilha de alocação é registrado (e relatado). Com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>,apenas o rastreamento da pilha de desalocação é registrado (e relatado). Esses valores diminuem um pouco o uso de memória e CPU do Valgrind. Eles podem ser úteis dependendo dos tipos de erro que você está procurando e do nível de detalhe necessário para analisá-los. Por exemplo, se você estiver interessado apenas em erros de vazamento de memória, é suficiente registrar os rastreamentos de pilha de alocação. </p><p>Com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, nenhum rastreamento de pilha é registrado para operações malloc e free. Se o seu programa aloca muitos blocos e/ou aloca/libera de muitos rastreamentos de pilha diferentes, isso pode diminuir significativamente a CPU e/ou a memória necessária. Obviamente, poucos detalhes serão relatados para erros relacionados a blocos de heap. </p><p>Observe que, uma vez registrado um rastreamento de pilha, o Valgrind o mantém na memória mesmo que não seja referenciado por nenhum bloco. Alguns programas (por exemplo, algoritmos recursivos) podem gerar um grande número de rastreamentos de pilha. Se o Valgrind usar muita memória nessas circunstâncias, você pode reduzir a memória necessária com as opções <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> e/ou usando um valor menor para a opção <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
sv: <html><head/><body><p>Bestämmer vilka stackföljder som ska behållas för block tilldelande med malloc eller frigjorda med free. </p><p>Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, lagras en stackföljd vid tilldelningstid, och kopplas till blocket. När blocket frigörs lagras en andra stackföljd, som ersätter stackföljden vid tilldelning. Som resultat, kan eventuella fel av typen &quot;användning efter frigörelse&quot; som hör ihop med blocket bara visa en stackföljd för var blocket frigjordes. </p><p>Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, lagras både stackföljden för tilldelning och frigörelse av blocket. Sålunda visar ett fel av typen &quot;användning efter frigörelse&quot; båda, vilket kan göra det enklare att diagnostisera felet. Jämfört med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, ökar inställningen Valgrinds minnesanvändning något eftersom blocket innehåller två referenser istället för en. </p><p>Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, lagras (och rapporteras) bara tilldelningsstacken. Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, lagras (och rapporteras) bara frigörelsestacken. Dessa värden minskar Valgrinds minnes- och processoranvändning något.De kan vara användbara beroende på typen av fel som du letar efter och detaljnivån som behövs för att analysera dem. Om du exempelvis bara är intresserad av minnesläckage, är det tillräckligt att lagra stackföljder för tilldelningar. </p><p>Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, lagras inga stackföljder för operationerna malloc och free. Om programmet tilldelar många block och/eller tilldelar eller frigör från många olika stackföljder, kan det minska processor- och/eller minnesanvändning märkbart. Naturligtvis rapporteras få detaljer för fel som har att göra med heap-block. </p><p>Observera att när en stackföljd väl har lagrats, håller Valgrind reda på stackföljden i minnet även om den inte refereras av något block. Vissa program (exempelvis rekursiva algoritmer) kan generera ett enormt antal stackföljder. Om Valgrind använder för mycket minne under sådana omständigheter, kan nödvändigt minne reduceras med väljarna <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> och/eller genom att använda ett mindre värde för väljaren <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. </p></body></html>
tr: <html><head /><body><p> malloc'lar ve/veya free'd blokları için hangi yığın izi/izleri ' nin korunacağını denetler.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span> ile bir yığın izi tahsis sırasında kaydedilir ve blokla ilişkilendirilir. Blok boşaltıldığında, ikinci bir yığın izi kaydedilir ve bu tahsis yığın izinin yerini alır. Sonuç olarak, bu bloğa bağlı herhangi bir "boşalt sonra kullan" hatası yalnızca bloğun boşaltıldığı bir yığın izi gösterebilir. </p><p> <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span> ile, blok için hem tahsis hem de boşaltma yığın izleri saklanır. Dolayısıyla "boşalt sonra kullan" hatası ikisini de gösterecektir ki hatayı teşhis etmeyi daha kolay hale getirebilir. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span> ile kıyaslandığında, bu ayar Valgrind ' in bellek kullanımını hafifçe artırır çünkü blok bir yerine iki referans içerir. </p><p> <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span> ile yalnızca tahsis yığın izi kaydedilir (ve raporlanır). <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> ile yalnızca boşaltma yığın izi kaydedilir (ve raporlanır). Bu değerler bir şekilde Valgrind ' in bellek ve işlemci kullanımını azaltır. Aradığınız hata tiplerine ve onları analiz etmeniz gereken detay düzeyine bağlı olarak yararlı olabilirler. Örneğin, eğer yalnızca bellek sızma hataları ile ilgileniyorsanız, tahsis yığın izlerini kaydetmek yeterlidir. </p><p> <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span> ile malloc ve free operasyonları için hiçbir yığın izi kaydedilmez. Eğer programınız bir çok blok tahsis ederse ve/veya birçok farklı yığın izlerinden tahsis ederse/boşaltırsa bu gerekli işlemciyi ve/veya belleği belirgin bir şekilde düşürebilir. Tabiki küme bloklarıyla ilgili hatalar için az detaylar raporlanacaktır. </p><p> Unutmayınız ki bir yığın izi bir kere kaydedildiğinde, herhangi bir blok tarafından referanslanmasa da Valgring yığın izini bellekte tutacaktır. Bazı programlar (örneğin özyinelemeli algoritmalar) çok büyük sayıda yığın izleri üretebilirler. Böyle durumlarda eğer Valgrind çok fazla bellek kullanırsa, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> seçeneği ile ve/veya <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>. seçeneği için daha küçük bir değer kullanarak gerekli bellek miktarını azaltabilirsiniz. </p></body></html>
uk: <html><head/><body><p>Керує тим, які трасування стека слід зберігати для блоків, отриманих malloc і/або звільнених free.</p><p>Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, трасування стека записуватиметься на момент розміщення даних у пам’яті і буде пов’язано із блоком. Коли блок звільнятиметься, записуватиметься інше трасування стека, яким замінюватиметься трасування стека на час розміщення даних. У результаті для будь-яких помилок «використання після вивільнення», пов’язаних із цим блоком, може бути показано лише трасування стека там, де блок було звільнено.</p><p>Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>, зберігатимуться трасування стека для розміщення даних у пам’яті і для вивільнення місця у пам’яті. Отже, для помилки «використання після вивільнення» буде показано обидва стека, що може полегшити визначення причини помилки. Порівняно з <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>, у цьому варіанті дещо зростає вживання пам’яті Valgrind, оскільки блок міститиме два посилання замість одного.</p><p>Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>, записуватиметься (і включатиметься до звіту) лише стек на момент розміщення даних у пам’яті. Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>, записуватиметься (і включатиметься до звіту) лише стек на момент вивільнення пам’яті. Ці значення дещо зменшують вживання пам’яті і потужності процесора Valgrind. Вони можуть бути корисним, якщо ви шукаєте помилки певного типу або потребуєте певного рівня деталізації для аналізу помилок. Наприклад, якщо ви вивчаєте лише помилки, які пов’язано із витоками пам’яті, достатньо записувати трасування стека на час розміщення даних.</p><p>Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>, трасування стека для дій malloc і free не записуватимуться. Якщо у вашій програмі розміщується багато блоків даних і/або розміщуються дані або вивільняється пам’ять з багатьох різних трасувань стека, це може значно зменшити вживання потужностей процесора і/або пам’яті. Звичайно ж, до звіту буде включено певні подробиці для помилок, які пов’язано із блоками «купи».</p><p>Зауважте, що після записування трасування стека, Valgrind зберігає трасування стека у пам’яті, навіть якщо на нього не посилається жоден блок. Деякі програми (наприклад програми з рекурсивними алгоритмами роботи) можуть призводити до створення величезної кількості трасувань стека. Якщо Valgrind за таких обставин вживає надто багато пам’яті, ви можете зменшити споживання за допомогою параметрів <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> і/або менших значень для параметра <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>.</p></body></html>
zh_cn: <html><head/><body><p>控制对被 malloc / free 的块要保留哪些堆栈跟踪。</p><p>如果选择 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>，那么分配时会记录一个堆栈跟踪，并且关联到分配的块上。当此块被释放时，会记录第二个堆栈跟踪，并且这会替代掉分配时记录的堆栈跟踪。这么做的结果是，所有关于此块的 &quot;释放后使用&quot; 错误只会显示一个该块被释放时的堆栈跟踪。</p><p>如果选择 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-and-free</span>，那么一个块分配时和释放时的堆栈跟踪都会被保留。因此，对 &quot;释放后使用&quot; 的错误，这两个都会被显示出来，这样可能会使得对问题的诊断变容易。比起 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc-then-free</span>，此设置会稍微增加 Valgrind 的内存使用，因为每个块会有两条记录，而不是一条。</p><p>如果设置为 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alloc</span>，那么只有分配时的堆栈跟踪会被记录（及报告）。如果选择 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>，那么只有释放时的堆栈跟踪会被记录（及报告）。这两个值会略微减少 Valgrind 的内存和 CPU 使用。根据您在寻找的错误类型以及您分析它们需要的资料详细程度，它们或许有用。例如，如果您只关心内存泄漏错误，记录分配时的堆栈跟踪就足够了。</p><p>如果选择 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">none</span>，那么对 malloc 和 free 操作不会记录堆栈跟踪。如果您的程序分配大量的块，或者在许多不同的调用堆栈下分配或释放内存，那么这可以大幅减少 CPU 及 内存使用。当然，如果有和堆块相关的问题，在这种设置下不会报告细节。</p><p>注意，一旦堆栈跟踪被记录了，那么 Valgrind 会一直把它保存在内存中，即使没有任何块引用它。某些程序（例如，递归算法）可能会产生大量的调用堆栈。如果 Valgrind 在这种情况下使用了过多内存，您可以通过设置选项 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--keep-stacktraces</span> 来减少内存使用，或者将选项 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers</span>设置为一个更小的值。</p></body></html>
