Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Maximum size of a stack frame:
ar: الحجم الأقصى لإطار مكدّس:
ca: Mida màxima d'un marc de la pila:
eo: Maksimuma grandeco de staka kadro:
es: Tamaño máximo de un marco de pila:
fr: Taille maximale de la pile :
gl: Tamaño máximo dos marcos de montón:
it: Dimensione massima stack frame:
ka: სტეკის კადრის მაქს. ზომა:
ko: 스택 프레임 최대 크기:
nl: Maximale grootte van een stackframe:
pl: Maksymalny rozmiar stosu ramki:
pt: Tamanho máximo de uma área da pilha:
pt_br: Tamanho máximo da pilha de chamadas:
sv: Maximal storlek för en aktiveringspost:
tr: Bir yığın çerçevesinin azami boyutu:
uk: Максимальний розмір кадру стека:
zh_cn: 堆栈帧最大尺寸：
