Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>The maximum size of a stack frame. If the stack pointer moves by more than this amount then Valgrind will assume that the program is switching to a different stack.</p><p>You may need to use this option if your program has large stack-allocated arrays. Valgrind keeps track of your program's stack pointer. If it changes by more than the threshold amount, Valgrind assumes your program is switching to a different stack, and Memcheck behaves differently than it would for a stack pointer change smaller than the threshold. Usually this heuristic works well. However, if your program allocates large structures on the stack, this heuristic will be fooled, and Memcheck will subsequently report large numbers of invalid stack accesses. This option allows you to change the threshold to a different value.</p><p>You should only consider use of this option if Valgrind's debug output directs you to do so. In that case it will tell you the new threshold you should specify.</p><p>In general, allocating large structures on the stack is a bad idea, because you can easily run out of stack space, especially on systems with limited memory or which expect to support large numbers of threads each with a small stack, and also because the error checking performed by Memcheck is more effective for heap-allocated data than for stack-allocated data. If you have to use this option, you may wish to consider rewriting your code to allocate on the heap rather than on the stack.</p></body></html>
ar: <html><head/><body><p>الحجم الأقصى لإطار مكدّس. إذا تحرك مؤشر المكدّس بأكثر من هذا المقدار، فإنّ Valgrind يفترض أن البرنامج يتبدّل إلى مكدّس مختلف.</p><p>قد تحتاج استخدام هذا الخيار إذا كان لبرنامجك صفيفات كبيرة مخصصة في المكدّس. يتابع Valgrind مؤشر مكدّس برنامجك. إذا تغيّر بأكثر من قيمة العتبة، يفترض Valgrind أن برنامجك يتبدّل إلى مكدّس مختلف، و يتصرف Memcheck بشكل مختلف عمّا إذا كان تغيير مؤشر المكدّس أصغر من العتبة. في الغالب يعمل هذا الاستدلال جيداً. و لكن، إذا خصص برنامجك بنيات كبيرة على المكدّس، س ينخدع هذا الاستدلال، و يبلّغ Memcheck لاحقاً عن عدد كبير من الوصولات غير الصالحة للمكدّس. يسمح لك هذا الخيار بتغيير العتبة إلى قيمة مختلفة.</p><p>يجب ألا تفكر في استخدام هذا الخيار إلا إذا وجهتك مخرجات تنقيح Valgrind لفعل ذلك. في هذه الحالة، يخبرك بالعتبة الجديدة التي يجب أن تحددها.</p><p>في العام، تخصيص بنيات كبيرة على المكدّس فكرة سيئة، لأنك قد تنفد مساحة المكدّس بسهولة، خصوصاً على الأنظمة ذات الذاكرة المحدودة أو التي تتوقع دعم عدد كبير من السلاسل ب مكدّس صغير لكلّ منها، و أيضاً لأن فحص الأخطاء الذي ينفذه Memcheck أكثر فعالية للبيانات المخصصة في الكومة من البيانات المخصصة في المكدّس. إذا كان عليك استخدام هذا الخيار، قد تفكّر في إعادة كتابة شفرتك للتخصيص على الكومة بدلاً من المكدّس.</p></body></html>
ca: <html><head/><body><p>La mida màxima d'un marc de pila. Si l'apuntador de pila es mou més que aquest valor, llavors el Valgrind assumirà que el programa ha canviat a una pila diferent.</p><p>Us caldria usar aquesta opció si el programa té matrius grans assignades a la pila. El Valgrind manté el rastre de l'apuntador de la pila del programa. Si canvia més que la quantitat del llindar, el Valgrind assumeix que el programa està canviant a una pila diferent, i el Memcheck es comportarà diferent del que seria si el canvi de l'apuntador de pila fos inferior al llindar. Normalment, aquesta heurística funciona bé. Tanmateix, si el programa assigna estructures grans a la pila, aquesta heurística es confondrà, i el Memcheck informarà d'un nombre elevat d'accessos no vàlids a la pila. Aquesta opció permet canviar el llindar a un valor diferent.</p><p>Només hauríeu de considerar l'ús d'aquesta opció si la sortida de depuració del Valgrind indica que ho feu. En aquest cas, us indicarà el llindar que cal especificar.</p><p>En general, l'assignació d'estructures grans a la pila és una mala idea, perquè us podeu quedar fàcilment sense espai a la pila, especialment en sistemes amb memòria limitada o quan s'espera permetre un nombre elevat de fils, cada un amb una pila petita, i també perquè la comprovació d'errors portada a terme pel Memcheck és més efectiva per a les dades assignades a la memòria en monticles que per a les dades assignades a la pila. Si cal usar aquesta opció, potser desitjareu tornar a escriure el codi per a assignar a la memòria en monticles que a la pila.</p></body></html>
eo: <html><head/><body><p>La maksimuma grandeco de staka kadro. Se la stakmontrilo moviĝas je pli ol ĉi tiu kvanto tiam Valgrind supozos ke la programo ŝanĝas al malsama stako.</p><p>Vi eble bezonos uzi ĉi tiun opcion se via programo havas grandajn stak-asignitajn tabelojn. Valgrind kontrolas la stakmontrilon de via programo. Se ĝi ŝanĝiĝas je pli ol la sojla kvanto, Valgrind supozas, ke via programo ŝanĝas al malsama stako, kaj Memcheck kondutas malsame ol ĝi farus por stakmontrilo ŝanĝo pli malgranda ol la sojlo. Kutime ĉi tiu heŭristiko funkcias bone. Tamen, se via programo asignas grandajn strukturojn sur la stako, ĉi tiu heŭristiko estos trompita, kaj Memcheck poste raportos grandajn nombrojn da nevalidaj stakaj aliroj. Ĉi tiu opcio ebligas al vi ŝanĝi la sojlon al malsama valoro.</p><p>Vi devus konsideri la uzon de ĉi tiu opcio nur se la sencimiga eligo de Valgrind instruas vin fari tion. Tiukaze ĝi diros al vi la novan sojlon, kiun vi devus specifi.</p><p>Ĝenerale, asigni grandajn strukturojn sur la stako estas malbona ideo, ĉar vi povas facile elĉerpi la stakspacon, precipe ĉe sistemoj kun limigitaj memoro aŭ kiuj atendas subteni grandajn nombrojn da fadenoj ĉiu kun malgranda stako, kaj ankaŭ ĉar la erarkontrolado farita de Memcheck estas pli efika por amas-asignitaj datenoj ol por stak-asignitaj datenoj. Se vi devas uzi ĉi tiun opcion, vi eble volas konsideri reverki vian kodon por asigni sur la amaso prefere ol sur la stako.</p></body></html>
es: <html><head/><body><p>El tamaño máximo de un marco de pila. Si el puntero de la pila se mueve más de este valor, Valgrind supondrá que el programa está cambiando a una pila distinta.</p><p>Es posible que necesite usar esta opción si el programa tiene usa matrices grandes asignadas en la pila. Valgrind sigue el rastro del puntero de la pila del programa. Si cambia más del valor de umbral, Valgrind supone que el programa está cambiando a una pila distinta y Memcheck se comporta de un modo distinto al que lo haría para un cambio más pequeño del puntero de la pila que el del umbral. Normalmente, esta heurística funciona bien. No obstante, si el programa asigna grandes estructuras en la pila, esta heurística se confundirá y Memcheck informará de un alto número de accesos no válidos a la pila. Esta opción le permite cambiar este umbral a un valor distinto.</p><p>Solo debería considerar el uso de esta opción si la salida de depuración de Valgrind le pide que lo haga. En tal caso, le indicará el nuevo umbral que debe especificar.</p><p>En general, la asignación de grandes estructuras en la pila es una mala idea, ya que se puede agotar el espacio de la pila con facilidad, especialmente en sistemas con memoria limitada o que esperan un gran número de hilos con una pila pequeña cada uno, y también porque la comprobación de errores que realiza Memcheck es más efectiva para los datos asignados en el montículo que para los asignados en la pila. Si debe usar esta opción, debería considerar la reescritura del código fuente para asignar en el montículo en lugar de en la pila.</p></body></html>
fr: <html><head/><body><p>La taille maximale de la pile. Si le pointeur de pile se déplace de plus de cette quantité, alors Valgrind considérera que le programme bascule sur une autre pile.</p><p>Vous devriez utiliser cette option si votre programme possède des tableaux importants alloués dans la pile. Valgrind garde une trace du pointeur de pile de votre programme. Si celui-ci change de plus de la quantité définie comme seuil, Valgrind considère que le programme bascule sur une autre pile et le logiciel Memcheck se comporte différemment qu'il le devrait pour un changement de pointeur de pile restant sous le seuil de déclenchement. Généralement, cette logique sera contournée et Memcheck signalera en conséquence un grand nombre d'accès non valables à la pile. Cette option vous permet de modifier la valeur de déclenchement.</p><p> Vous devriez prendre en compte l'utilisation de cette option si la sortie de débogage de Valgrind vous demande de le faire. Dans ce cas, la nouvelle valeur de déclenchement vous sera indiquée par Valgrind.</p><p>En général, allouer dans la pile de grandes structures de données est déconseillé. En effet, vous pouvez vous retrouver facilement en débordement de pile, surtout pour les systèmes avec une quantité de mémoire limitée ou devant prendre en charge un grand nombre de process, chacun avec une pile limitée. Ainsi, la vérification réalisée par Memcheck est plus efficace pour les données allouées dans le tas local plutôt que celles allouées dans la pile. Si vous devez utiliser cette option, vous devriez envisager une ré-écriture de votre code pour une allocation dans le tas local et non dans la pile.</p></body></html>
gl: <html><head/><body><p>O tamaño máximo dun marco de rima. Se o punteiro da rima se move máis desta cantidade Valgrind asume que o programa está cambiando a unha rima distinta.</p> <p>Pode que necesite usar esta opción se o seu programa ten matrices longas asignadas á rima. Valgrind fai seguimento do punteiro da rima do seu programa. Se cambia máis da cantidade límite, Valgrind asume que o seu programa está a cambiar a unha rima diferente e Memcheck compórtase de maneira distinta a como o faría para un cambio de punteiro de rima inferior ao límite. Esta heurística adoita funcionar ben. Porén, se o seu programa asigna grandes estruturas á rima, a heurística non funcionará, e polo Memcheck informará dun gran número de accesos incorrectos á rima. Esta opción permítelle cambiar o límite por un valor distinto.</p> <p>Só debería considerar o uso desta opción se a saída de depuración de Valgrind llo indica. Nese caso indicaralle o novo límite que debe indicar.</p> <p>En xeral, asignar estruturas grandes á rima é unha mala idea, porque pode quedar facilmente sen espazo na rima, especialmente en sistemas cunha memoria limitada ou que esperan permitir un gran número de fíos con unha rima pequena cada un, e tamén porque a comprobación de erros que realiza Memcheck é máis efectiva para datos asignados ao monte que para datos asignados á rima. Se ten que usar esta opción, quizais lle interese considerar reescribir o código para asignar no monte en vez de na rima.</p></body></html>
ka: <html><head/><body><p>სტეკის ჩარჩოს მაქსიმალური ზომა. თუ სტეკის მაჩვენებელი ამ რაოდენობაზე მეტით გადაადგილდება, Valgrind ჩათვლის, რომ პროგრამა სხვა სტეკზე გადადის.</p><p>შესაძლოა დაგჭირდეთ ამ პარამეტრის გამოყენება, თუ თქვენს პროგრამას აქვს სტეკზე გამოყოფილი დიდი მასივები. Valgrind თვალყურს ადევნებს თქვენი პროგრამის სტეკის მაჩვენებელს. თუ ის ზღვრულ მნიშვნელობაზე მეტით იცვლება, Valgrind ვარაუდობს, რომ თქვენი პროგრამა სხვა სტეკზე გადადის და Memcheck განსხვავებულად იქცევა, ვიდრე ზღვარზე მცირე ცვლილების შემთხვევაში. როგორც წესი, ეს ევრისტიკა კარგად მუშაობს. თუმცა, თუ თქვენი პროგრამა სტეკზე დიდ სტრუქტურებს გამოყოფს, ეს ევრისტიკა შეცდება და Memcheck შემდგომში დიდი რაოდენობით სტეკზე არავალიდური წვდომის შემთხვევებს დააფიქსირებს. ეს პარამეტრი საშუალებას გაძლევთ, შეცვალოთ ზღვარი სხვა მნიშვნელობით.</p><p>ამ პარამეტრის გამოყენება მხოლოდ იმ შემთხვევაში უნდა განიხილოთ, თუ Valgrind-ის გამართვის გამონატანი ამისკენ მიგითითებთ. ასეთ შემთხვევაში, ის თავად გეტყვით ახალ ზღვარს, რომელიც უნდა მიუთითოთ.</p><p>ზოგადად, სტეკზე დიდი სტრუქტურების გამოყოფა ცუდი აზრია, რადგან შეიძლება ადვილად ამოგეწუროთ სტეკის სივრცე, განსაკუთრებით შეზღუდული მეხსიერების მქონე სისტემებზე ან იქ, სადაც მოსალოდნელია დიდი რაოდენობით ნაკადების მხარდაჭერა მცირე სტეკებით; ასევე იმიტომ, რომ Memcheck-ის მიერ შესრულებული შეცდომების შემოწმება უფრო ეფექტურია მეხსიერების გროვაზე გამოყოფილი მონაცემებისთვის, ვიდრე სტეკზე გამოყოფილისთვის. თუ ამ პარამეტრის გამოყენება მაინც გიწევთ, სასურველია განიხილოთ კოდის გადაწერა, რათა მონაცემები სტეკის ნაცვლად მეხსიერების გროვაზე გამოყოთ.</p></body></html>
ko: <html><head/><body><p>스택 프레임 최대 크기입니다. 스택 포인터가 이 값 이상으로 움직이면 Valgrind에서 프로그램이 다른 스택으로 전환한다고 간주합니다.</p><p>프로그램에서 스택 영역에 큰 메모리를 할당했다면 이 옵션을 사용해야 할 수도 있습니다. Valgrind는 프로그램의 스택 포인터를 추적합니다. 이 임곗값 이상으로 포인터가 변경되면 Valgrind에서는 프로그램이 스택을 전환하고 있다고 간주하고, Memcheck는 스택 포인터가 이 임곗값보다 더 작은 만큼 변경되었을 때와 다르게 작동합니다. 대개 이 추측은 잘 작동하지만, 프로그램에서 스택에 대형 구조체를 할당했다면 이 추측은 제대로 작동하지 않고 Memcheck에서는 잘못된 스택 접근을 보고할 수도 있습니다. 이 옵션을 사용하면 임곗값을 변경할 수 있습니다.</p><p>Valgrind 디버그 출력에서 이 옵션을 사용할 것을 명시한 경우에만 이 옵션을 사용하십시오. 대개의 경우 사용해야 할 새 임곗값을 명시합니다.</p><p>일반적으로 스택에 대형 구조체를 할당하는 것은 좋은 행동이 아닙니다. 스택 공간이 쉽게 부족해질 수 있으며, 특히 메모리 공간이 제한되었거나 작은 스택을 가진 스레드를 대량으로 동시에 실행해야 하는 시스템에서 문제가 더 크게 발생합니다. 또한 Memcheck의 오류 검사는 스택에 할당된 데이터보다 힙에 할당된 데이터에서 더 효과적입니다. 이 옵션을 사용해야 한다면 코드를 재작성해서 데이터를 스택이 아닌 힙에 할당하는 것을 고려해 보십시오.</p></body></html>
nl: <html><head/><body><p>De maximale grootte van een stackframe. Als de stack pointer met meer dan deze grootte verplaatst dan neemt Valgrind aan dat het programma naar een andere stack omschakelt.</p><p>U heeft wellicht deze instelling nodig als uw programma grote arrays op de stack heeft geplaatst. Valgrind houd uw de stack pointer van uw programma in de gaten. Als het meer dan de ingestelde waarde wijzigt, dan neemt Valgrind aan dat uw programma naar een andere stack omschakelt, en gedraagt Memcheck anders dan bij een wijziging van een stack pointer die kleiner is dan de ingestelde waarde. Meestal pakken deze regels goed uit. Maar als uw programma grote structuren op de stack reserveert, dan raken deze regels in de war, en zal Memcheck daardoor grote aantallen ongeldige stack accesses melden. Hier kunt u de drempelwaarde wijzigen.</p><p>U zou dit alleen moeten overwegen als de Valgrind's debug uitvoer u hiervoor opdracht geeft. In dat geval zal het u vertellen welke drempelwaarde u moet instellen.</p><p>In het algemeen is het reserveren van ruimte voor grote structuren in de stack een slecht idee, omdat u makkelijk de ruimte in de stack op kunt maken, met name bij systemen met beperkte geheugen of als u een groot aantal threads met elk een kleine stack kunt verwachten, en ook omdat de door Memcheck uitgevoerde foutcontrole effectiever is bij data geplaatst op de heap dan bij data geplaatst op de stack. Als u deze instellingen heeft moeten wijzigen, dan zou u moeten overwegen om uw code te herschrijven zodat het data op de heap plaatst in plaats van op de stack.</p></body></html>
pl: <html><head/><body><p>Graniczny rozmiar ramki stosu. Gdy wskaźnik stosu przemieszcza się o więcej niż ta wielkość, to Valgrind założy, że program przełącza się na inny stos.</p><p>Możesz chcieć użyć tej opcji, gdy twój program ma duże tablice przydzielane na stosie. Valgrind śledzi wskaźnik stosu twojego programu. Jeśli zmieni się on o więcej niż wartość progowa, to Valgrind założy, że program przełącza się na inny stos, a Memcheck zachowa się inaczej niż gdyby wskaźnik stosu przemieścił się o wartość mniejszą niż progowa. Taka heurystyka zazwyczaj działa dobrze. Jednakże, jesli twój program przydziela duże struktury na stosie, to ta heurustyka nie zadziała, a Memcheck będzie zgłaszał duże liczby nieprawidłowych adresów stosu. Opcja ta umożliwia ci ustawienie progu na inną wartość.</p><p>Opcję tę powinno się ustawiać, tylko gdy wynik diagnozowania Valgrinda tak doradzi. W takim przypadku podana zostanie również wartość nowego progu.</p><p>W ogólności, przydzielanie dużych struktur na stosie to zły pomysł, bo łatwo można wyczerpać pamięć, szczególnie na systemach z ograniczoną ilością pamięci lub takich, które oczekują dużej liczby wątków, każdy o małym stosie, a także ponieważ sprawdzanie błędów przez Memcheck jest bardziej efektywne dla danych przydzielonych na stercie niż na stosie. Jeśli musisz używać tej opcji, to rozważ przepisanie swojego kodu tak, aby przydzielać pamięć raczej na stercie niż na stosie.</p></body></html>
pt: <html><head/><body><p>O tamanho máximo de uma área da pilha. Se o ponteiro da pilha se deslocar mais que esta quantidade, então o Valgrind irá assumir que o programa está a mudar para uma pilha diferente.</p><p>Poderá necessitar de usar esta opção se o seu programa tiver grandes listas alocadas na pilha. O Valgrind mantém um registo do ponteiro da pilha do seu programa. Se mudar por um valor superior ao limite, o Valgrind assume que o seu programa está a mudar para uma pilha diferente, e o Memcheck comporta-se de forma diferente da que usaria para uma mudança do ponteiro da pilha menor que o limite. Normalmente esta heurística funciona bem. Contudo, se o seu programa alocar grandes estruturas na pilha, esta heurística seria enganada e o Memcheck irá subsequentemente relatar grandes quantidades de acessos inválidos à pilha. Esta opção permite-lhe alterar o limite para um valor diferente.</p><p>Deverá só ter em consideração o uso desta opção se o o resultado de depuração do Valgrind o apontar para isso. Nesse caso, comunicar-lhe-á o novo limite que deverá definir.</p><p>De um modo geral, a alocação de grandes estruturas na pilha é uma má ideia, porque poderá facilmente ficar sem espaço na pilha, principalmente em sistemas com memória limitada ou que esperam suportar um grande número de tarefas, cada uma com uma pilha pequena para si, e também porque a verificação de erros efectuada pelo Memcheck é mais efectiva para os dados alocados na memória de dados que nos dados alocados na pilha. Se tiver de usar esta opção, poderá pensar em remodelar o seu código para alocar na memória de dados em vez da pilha.</p></body></html>
pt_br: <html><head/><body><p>O tamanho máximo de um quadro de pilha. Se o ponteiro da pilha se mover mais do que esse valor, o Valgrind assumirá que o programa está alternando para uma pilha diferente.</p><p>Você pode precisar usar esta opção se o seu programa tiver grandes matrizes alocadas na pilha. O Valgrind rastreia o ponteiro da pilha do seu programa. Se ele mudar mais do que o valor limite, o Valgrind assume que seu programa está alternando para uma pilha diferente, e o Memcheck se comporta de maneira diferente do que se comportaria para uma alteração no ponteiro da pilha menor que o limite. Normalmente, essa heurística funciona bem. No entanto, se o seu programa alocar grandes estruturas na pilha, essa heurística será enganada e o Memcheck relatará, subsequentemente, um grande número de acessos inválidos à pilha. Esta opção permite que você altere o limite para um valor diferente.</p><p>Você só deve considerar o uso desta opção se a saída de depuração do Valgrind o instruir a fazê-lo. Nesse caso, ele informará o novo limite que você deve especificar.</p><p>Em geral, alocar estruturas grandes na pilha é uma má ideia, porque você pode facilmente ficar sem espaço na pilha, especialmente em sistemas com memória limitada ou que esperam suportar um grande número de threads, cada uma com uma pilha pequena, e também porque a verificação de erros realizada pelo Memcheck é mais eficaz para dados alocados no heap do que para dados alocados na pilha. Se você precisar usar esta opção, pode considerar reescrever seu código para alocar no heap em vez de na pilha.</p></body></html>
sv: <html><head/><body><p>En aktiveringsposts maximala storlek. Om stackpekaren flyttas mer än detta värde antar Valgrind att programmet byter till en annan stack.</p><p>Alternativet kan behöva användas om programmet har stora fält tilldelade på stacken. Valgrind håller reda på programmets stackpekare. Om den ändras med mer än tröskelvärdet antar Valgrind att programmet byter till en annan stack, och Memcheck beter sig annorlunda än det skulle göra för en ändring av stackpekaren mindre än tröskeln. Oftast fungerar heuristiken bra. Om programmet dock tilldelar stora strukturer på stacken, blir heuristiken lurad och Memcheck rapporterar senare ett stort antal ogiltiga stackaccesser. Alternativet gör det möjligt att ändra tröskeln till ett annat värde.</p><p>Överväg endast att använda alternativet om Valgrinds felsökningsutmatning anvisar dig att göra det. I sådana fall, talar den om för dig den nya tröskeln som ska anges.</p><p>I allmänhet är det en dålig idé att tilldela stora strukturer på stacken, eftersom stackutrymmet lätt kan ta slut, särskilt på system med begränsat minne eller som förväntar sig att stödja stort antal trådar, var och en med en liten stack, och dessutom eftersom felkontrollen som utförs av Memcheck är effektivare för heap-tilldelad data än för stacktilldelad. Om alternativet måste användas, bör du överväga att skriva om koden för att göra heap-tilldelningar istället för stacktilldelningar.</p></body></html>
tr: <html><head/><body><p>Bir yığın çerçevesinin en büyük boyutu. Eğer yığın işaretçisi bu miktardan daha fazla hareket ederse Valgrind programın başka bir yığına geçtiğini varsayacaktır.</p><p>Eğer programınız geniş yığın-tahsis dizilere sahipse bu seçeneği kullanmaya ihtiyacınız olabilir. Valgrind programınızın yığın işaretçisini takip eder. Eğer eşik miktarından daha fazla değişirse Valgrind programınızın başka bir yığına geçtiğini varsayar ve Memcheck bir yığın işaretçisi için eşik değerinden daha küçük değişiklikte davranacağından farklı davranır. Genellikle bu sezgisel yöntem iyi çalışır. Bununla birlikte, programınız yğın üzerinde geniş yapılar tahsis ederse, bu sezgisel yöntem kandırılacaktır ve Memcheck akabinde çok sayıda geçersiz yığın erişimleri raporlayacaktır. Bu seçenek size eşiği başka bir değere değiştirme imkanı sunar.</p><p> Bu seçeneğin kullanımını yalnızca eğer Valgrind ' in hata ayıklama çıktısı sizi yapmaya yönlendirirse düşünmelisiniz. Bu durumda size belirtmeniz gereken yeni yeni eşiği söyleyecektir.</p><p>Genel olarak, yığın üzerinde geniş yapılar tahsis etmek kötü bir fikirdir çünkü kolayca yığın alanının dışına çıkabilirsiniz özellikle limitli bellekli sistemler veya küçük bir yığınla her biri büyük sayıda iş parçacıklarını desteklemesi beklenenler üzerinde ve ayrıca Memcheck tarafından gerçekleştirilen hata denetimi küme-tahsis edilmiş veriler için yığın-tahsis edilmiş verilerden daha verimli olduğundan. Eğer bu seçeneği kullanmak zorundaysanız, kodunuzu yığın üzerinde tahsis etmek yerine küme üzerinde tahsis etmeyi düşünerek tekrar yazmayı dileyebilirsiniz.</p></body></html>
uk: <html><head/><body><p>Максимальний розмір кадру стека. Якщо зміщення вказівника стека перевищить це значення, Valgrind припускатиме, що програма перемкнулася на інший стек.</p><p>Цей параметр може знадобитися, якщо програма використовує великі масиви, які розміщуються у стеку. Valgrind стежитиме за вказівником стека вашої програми. Якщо він змінюватиметься на значення, яке є більшим за порогове, Valgrind вважатиме, що ваша програма перемкнулася на інший стек, а Memcheck поводитиметься інакше, ніж він це робить, коли зміна вказівника стека є меншою за порогову. Зазвичай, така евристика працює як слід. Втім, якщо ваша програма розміщує великі структури у стеку, евристика не спрацює, а Memcheck почне повідомляти про велику кількість некоректних доступів до стека. За допомогою цього параметра ви можете змінити порогове значення.</p><p>Вам варто змінювати типове значення, лише якщо діагностичні повідомлення Valgrind просять вас це зробити. Програма сама має повідомити вам нове порогове значення, яке слід вказати.</p><p>Загалом, не варто розміщувати великі структури даних у стеку, оскільки ви ризикуватимете виходом за простір стека, особливо у системах із малим обсягом пам’яті або системах, де реалізовано підтримку великої кількості потоків виконання з малими стеками для кожного потоку. Ще однією причиною відмовитися від такого розміщення даних є те, що пошук помилок, який виконується Memcheck, є ефективнішим для даних, які розміщено у «купі», а не у стеку. Якщо виникає потреба у використанні цього параметра, варто подумати, чи не слід переписати код програми так, щоб дані розміщувалися у «купі» пам’яті, а не у стеку.</p></body></html>
zh_cn: <html><head/><body><p>堆栈帧的最大大小。如果您的堆栈指针移动了超过这个距离，那么 Valgrind 会认为程序切换到了一个不同的堆栈。</p><p>如果您的程序使用大的堆栈对其的数组，那您可能需要设置此选项。Valgrind 跟踪您程序的堆栈指针。如果它变化了超过这个阈值，那么 Valgrind 会认为您的程序切换到了一个不同的堆栈，同时 Memcheck 的行为也会和堆栈指针变化小于这个阈值时的行为不同。一般来说这个经验法则效果不错。但是，如果您的程序在堆栈上分配大型结构，那这个经验法则可能会失效，于是 Memcheck 会报告大量的非法堆栈访问。该选项允许您改变该阈值。</p><p>您应当仅在 Valgrind 调试输出指导您这么做时考虑此选项。此时，它会告诉您应该设置的新阈值。</p><p>一般来说，在堆栈上分配大型结构是个坏主意，因为您很容易耗尽堆栈空间，特别是在那些内存有限或者设计成支持大量带有小堆栈的线程的系统。另外，比起在堆栈上分配的数据，Memcheck 进行的错误检查也是对在堆上分配的数据更有效。如果您必须要使用此选项，您可能需要考虑重写您的代码来在堆上进行分配，而不是在堆栈上。</p></body></html>
