Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Conflict cache size:
ar: حجم خبيئة التّضارب:
ca: Mida de la memòria cau dels conflictes:
eo: Konflikta kaŝmemorgrando:
es: Tamaño de la caché de conflictos:
fr: Taille du cache de conflit :
gl: Tamaño da caché dos conflitos:
ka: კონფლიქტის კეშის ზომა:
ko: 충돌 캐시 크기:
nl: Conflicterende cachegrootte:
pl: Rozmiar pamięci na sprzeczności:
pt: Tamanho da 'cache' de conflitos:
pt_br: Tamanho do cache de conflito:
sv: Konflikt-cachestorlek:
tr: Çakışan önbellek boyutu:
uk: Розмір кешу конфліктів:
zh_cn: 冲突缓存大小：

source: <html><head/><body><p>This flag only has any effect at <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Information about &quot;old&quot; conflicting accesses is stored in a cache of limited size, with LRU-style management. This is necessary because it isn't practical to store a stack trace for every single memory access made by the program. Historical information on not recently accessed locations is periodically discarded, to free up space in the cache.</p><p>This option controls the size of the cache, in terms of the number of different memory addresses for which conflicting access information is stored. If you find that Helgrind is showing race errors with only one stack instead of the expected two stacks, try increasing this value.</p><p>The minimum value is 10,000 and the maximum is 30,000,000 (thirty times the default value). Increasing the value by 1 increases Helgrind's memory requirement by very roughly 100 bytes, so the maximum value will easily eat up three extra gigabytes or so of memory.</p></body></html>
ar: <html><head/><body><p>هذه العلامة يكون لها أي تأثير فقط عند <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>تخزّن المعلومات حول الوصولات المتضاربة «القديمة» في خبيئة ذات حجم محدود، بإدارة بنمط LRU. هذا ضروري لأنه ليس عملياً تخزين تتبّع مكدّس لكل وصول ذاكرة ينفّذ بواسطة البرنامج. تهمل المعلومات التّاريخية حول المواقع التي لم يوصل إليها حديثاً بشكل دوري، لتحرير مساحة في الخبيئة.</p><p>يتحكّم هذا الخيار بحجم الخبيئة، بمصطلح عدد عناوين الذاكرة المختلفة التي تخزّن لها معلومات الوصول المتضارب. إذا وجدت أن Helgrind يعرض أخطاء تزاحم بمكدّس واحد فقط بدلاً من المتوقّع مكدّسين، حاول زيادة هذه القيمة.</p><p>القيمة الصغرى هي 10,000 و القصوى هي 30,000,000 (ثلاثين ضعف القيمة المبدئية). زيادة القيمة ب 1 يزيد من متطلّب Helgrind للذاكرة ب 100 بايت تقريباً، لذا القيمة القصوى تستهلك بسهولة ثلاثة غيغابايت إضافية أو نحو ذلك من الذاكرة.</p></body></html>
ca: <html><head/><body><p>Aquest indicador només té efecte amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full (complet)</span>.</p><p>La informació quan als accessos «anteriors» en conflicte s'emmagatzema en una memòria cau de mida limitada, amb una gestió d'estil LRU. Això és necessari perquè no és pràctic emmagatzemar una traça de pila per a cada accés únic a memòria fet pel programa. La informació històrica a les ubicacions no recents es descarta periòdicament, per a alliberar espai a la memòria cau.</p><p>Aquesta opció controla la mida de la memòria cau, en termes del nombre d'adreces de memòria diferents per a les quals s'emmagatzema la informació d'accés conflictiva. Si trobeu que el Helgrind mostra errors de competència amb només una pila en lloc de les dues piles esperades, intenteu augmentar aquest valor.</p><p>El valor mínim és 10.000 i el màxim és 30.000.000 (trenta vegades el valor predeterminat). Augmentat el valor en 1, s'augmenta el requisit de memòria del Helgrind en uns 100 bytes, així que el valor màxim pot consumir fàcilment uns tres gigabytes extres de memòria.</p></body></html>
eo: <html><head/><body><p>Tiu ĉi flago nur efikas ĉe <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Informoj pri "malnovaj" konfliktantaj aliroj estas konservitaj en kaŝmemoro de limigita grandeco, kun LRU-stila administrado. Ĉi tio estas necesa ĉar ne estas praktike stoki stakspuron por ĉiu unuopa memoraliro farita de la programo. Historiaj informoj pri ne ĵus aliritaj lokoj estas periode forĵetitaj, por liberigi spacon en la kaŝmemoro.</p><p>Ĉi tiu opcio kontrolas la grandecon de la kaŝmemoro, laŭ la nombro da malsamaj memoradresoj por kiuj konfliktaj alirinformoj estas. konservita. Se vi trovas, ke Helgrind montras raserarojn kun nur unu stako anstataŭ la atendataj du stakoj, provu pliigi ĉi tiun valoron.</p><p>La minimuma valoro estas 10,000 kaj la maksimumo estas 30,000,000 (tridek fojojn la defaŭlta valoro). Pliigi la valoron je 1 pliigas la memorbezonon de Helgrind je tre proksimume 100 bajtoj, do la maksimuma valoro facile manĝos tri pliajn gigabajtojn da memoro.</p></body></html>
es: <html><head/><body><p>Este indicador solo tiene efecto con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>La información sobre los «antiguos» accesos conflictivos se guarda en una caché de tamaño limitado, con gestión al estilo LRU. Esto es necesario porque no resulta práctico guardar una traza de pila para cada acceso de memoria individual que haga el programa. La información histórica sobre posiciones a las que no se ha accedido recientemente se descarta de forma periódica, con el objeto de liberar espacio en la caché.</p><p>Esta opción controla el tamaño de la caché, en términos del número de direcciones de memoria distintas para las que se guarda información de acceso conflictivo. Si encuentra que Helgrind está mostrando errores de carreras con una única pila en lugar de las dos pilas esperadas, pruebe a aumentar este valor.</p><p>El valor mínimo es 10.000 y el máximo 30.000.000 (treinta veces el valor predeterminado). Un aumento de 1 de de este valor incrementa las necesidades de memoria de Helgrind unos 100 bytes, por lo que el valor máximo podría comerse hasta tres gigabytes adicionales de memoria o más.</p></body></html>
fr: <html><head/><body><p>Cette option n'a aucun effet sur <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Les informations concernant des &quot;anciens&quot; accès concurrents sont enregistrées dans un cache de taille limitée, avec une gestion de type « Le moins récemment utilisé ». Ceci est nécessaire car il n'est pas très facile d'enregistrer les traces de pile pour chaque accès mémoire effectué par le programme. Les informations d'historique sur des emplacements non accédés récemment sont périodiquement effacées, pour libérer de l'espace dans le cache.</p><p> Cette option contrôle la taille du cache, en terme de nombre d'adresses mémoire pour lesquelles des informations d'accès concurrents sont enregistrées. Si vous trouvez que Helgrind affiche des erreurs d'accès concurrents avec uniquement une pile au lieu des deux piles attendues, essayez d'augmenter cette valeur.</p><p>La valeur minimale est de 10 000 et la valeur maximale de 30 000 000 (30 fois la valeur par défaut). Un incrément de 1 de cette valeur augmente le besoin de mémoire de Helgrind très grossièrement de 100 octets. Ainsi, la valeur maximale va consommer facilement jusqu'à 3 Go supplémentaires ou plus de mémoire.</p></body></html>
gl: <html><head/><body><p>Esta marca só ten efecto xunto con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p> <p>A información sobre accesos conflitivos «vellos» se almacena nunha caché de tamaño limitado, cunha xestión do estilo da de LRU. Isto é necesario porque non é práctico almacenar unha traza de rima para todos e cada un dos accesos de memoria que fai o programa. A información do historial de accesos non recentes a lugares descártase de maneira periódica, para liberar espazo na caché.</p> <p>Esta opción controla o tamaño da caché, especificamente o número de distintos enderezos de memoria para os que se almacena información de acceso conflitivo. Se descubre que Helgrind mostra erros de carreira cunha única rima en vez das dúas rimas esperadas, probe a aumentar este valor.</p> <p>O valor mínimo é 10.000 e o máximo é 30.000.000 (trinta veces o valor predeterminado. Aumentar o valor en 1 aumenta os requisitos de memoria de Helgrind en aproximadamente 100 bytes, así que o valor máximo consumirá facilmente uns tres xigabytes adicionais de memoria.</p></body></html>
ka: <html><head/><body><p>ამ ალამს გავლენა აქვს მხოლოდ იმ შემთხვევაში, თუ მითითებულია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>ინფორმაცია „ძველი“ კონფლიქტური წვდომების შესახებ ინახება შეზღუდული ზომის ქეშში, რომელიც იმართება უახლესი გამოყენების პრინციპით (LRU). ეს აუცილებელია, რადგან პროგრამის მიერ შესრულებული მეხსიერებაზე თითოეული წვდომისთვის სტეკის ტრესირების შენახვა პრაქტიკულად შეუძლებელია. ინფორმაცია იმ მისამართების შესახებ, რომლებზეც წვდომა დიდი ხანია არ მომხდარა, პერიოდულად იშლება ქეშში ადგილის გასათავისუფლებლად.</p><p>ეს პარამეტრი აკონტროლებს ქეშის ზომას იმ მეხსიერების სხვადასხვა მისამართების რაოდენობის მიხედვით, რომელთათვისაც ინახება კონფლიქტური წვდომის ინფორმაცია. თუ შეამჩნევთ, რომ Helgrind აჩვენებს დავის შეცდომებს მხოლოდ ერთი სტეკით მოსალოდნელი ორის ნაცვლად, სცადეთ ამ მნიშვნელობის გაზრდა.</p><p>მინიმალური მნიშვნელობა არის 10,000, ხოლო მაქსიმალური - 30,000,000 (ნაგულისხმევ მნიშვნელობაზე ოცდაათჯერ მეტი). მნიშვნელობის 1-ით გაზრდა ზრდის Helgrind-ის მეხსიერების მოთხოვნას დაახლოებით 100 ბაიტით, ასე რომ, მაქსიმალურმა მნიშვნელობამ შესაძლოა თავისუფლად აითვისოს დამატებით სამი გიგაბაიტი მეხსიერება.</p></body></html>
ko: <html><head/><body><p>이 플래그는 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>을 지정했을 때에만 효과가 있습니다.</p><p>&quot;과거&quot;의 충돌하는 접근 정보는 LRU 스타일로 관리되는 제한된 크기의 캐시에 저장됩니다. 프로그램의 모든 메모리 접근에 대한 스택 추적을 저장하는 것은 실용적이지 않기 때문에 캐시 사용이 필요합니다. 최근에 접근하지 않은 위치에 대한 정보는 캐시 사용량을 줄일 수 있도록 주기적으로 삭제됩니다.</p><p>이 옵션은 접근 정보가 서로 다른 메모리 주소 개수 단위로 캐시 크기를 제어합니다. Helgrind에서 스택 두 개가 아닌 스택 한 개만의 경쟁 오류를 표시한다면 이 값을 증가시켜 보십시오.</p><p>최솟값은 10,000, 최댓값은 30,000,000(기본값의 30배)입니다. 이 값을 1씩 증가시키면 Helgrind 메모리 사용량을 대략 100바이트씩 증가시키며, 최댓값을 사용하면 최대 3 GB 메모리를 더 사용할 수 있습니다.</p></body></html>
nl: <html><head/><body><p>Deze vlag heeft alleen enig effect bij <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Informatie over &quot;oude&quot; in conflict zijnde toegang is opgeslagen in een cache van beperkte grootte, met LRU-type beheer. Dit is nodig omdat het niet praktisch is om een stacktrace op te slaan voor elke enkele toegang tot geheugen dat wordt gemaakt door het programma. Historische informatie over niet recente toegang tot locaties wordt periodiek weggegooid, om ruimte te maken in de cache.</p><p>Deze optie bestuurt de grootte van de cache, in termen van het aantal verschillende geheugenadressen waarvoor in conflict zijnde toegangsinformatie wordt opgeslagen. Als u vindt dat Helgrind race-fouten toont met slechts één stack in plaats van de verwachte twee stacks, probeer deze waarde dan te vergroten.</p><p>De minimumwaarde is 10.000 en het maximum is 30.000,000 (dertig keer de standaard waarde). De waarde vergroten met 1 verhoogt het geheugengebruik van Helgrind met ruwweg 100 bytes, de maximum waarde zal gemakkelijk ongeveer drie extra gigabytes aan geheugen gebruiken.</p></body></html>
pl: <html><head/><body><p>Flaga ta ma zastosowanie przy ustawieniu <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Informacje o &quot;starych&quot; sprzecznych adresach jest przechowywana w pamięci podręcznej o ograniczonym rozmiarze wraz z zarządzaniem w rodzaju LRU. Jest to potrzebne, bo niepraktycznym jest przechowywanie śladu stosu dla każdego dostępu do pamięci, którego dokonał program. Historyczne informacje o miejscach, do których nie było ostatnio dostępu są okresowo wymazywane, aby zwiększyć wolną przestrzeń pamięci podręcznej.</p><p>Opcja ta określa rozmiar pamięci podręcznej jako liczba różnych adresów pamięci, dla których przechowywane są informacje o sprzecznym dostępie. Jeśli zauważysz, że Helgrind pokazuje błędy gonitwy tylko w jednym stosie zamiast w oczekiwanych dwóch, to spróbuj zwiększyć tę wartość.</p><p>Najmniejsza wartość to 10,000 a największa to 30,000,000 (trzydzieści razy wartość domyślna). Zwiększenie tej wartości o 1 zwiększa zapotrzebowanie Helgrinda na około 100 bajtów, więc ustawienie na największą wartość pochłonie mniej więcej trzy gigabajty pamięci.</p></body></html>
pt: <html><head/><body><p>Esta opção apenas fará algum efeito com <span style="font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>A informação sobre os acessos em conflito &quot;antigos&quot; é guardada numa 'cache' de tamanho limitado, com uma gestão do tipo LRU. Isto é necessário porque não é prático guardar um registo de chamadas para cada acesso de memória individual feito pelo programa. A informação histórica dos locais não visitados recentemente é descartada periodicamente, para libertar espaço na 'cache'.</p><p>Esta opção controla o tamanho da 'cache', em termos do número de endereços de memória diferentes para os quais é guardada a informação de acessos em conflito. Se achar que o Helgrind está a mostrar erros de concorrência apenas com uma pilha, em vez das duas pilhas esperadas, tente aumentar este valor.</p><p>O valor mínimo é 10 000 e o máximo é de 30 000 000 (trinta vezes o valor por omissão). O aumento do valor em 1 aumenta o requisito de memória do Helgrind em aproximadamente 100 'bytes', pelo que o valor máximo irá consumir facilmente 3 gigabytes extra de memória, aproximadamente.</p></body></html>
pt_br: <html><head/><body><p>Este sinalizador só tem efeito em <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Informações sobre acessos conflitantes &quot;antigos&quot; são armazenadas em um cache de tamanho limitado, com gerenciamento no estilo LRU. Isso é necessário porque não é prático armazenar um rastreamento de pilha para cada acesso à memória feito pelo programa. Informações históricas sobre locais não acessados ​​recentemente são descartadas periodicamente para liberar espaço no cache.</p><p>Esta opção controla o tamanho do cache, em termos do número de endereços de memória diferentes para os quais informações de acesso conflitantes são armazenadas. Se você perceber que o Helgrind está apresentando erros de corrida com apenas uma pilha em vez das duas pilhas esperadas, tente aumentar este valor.</p><p>O valor mínimo é 10.000 e o máximo é 30.000.000 (trinta vezes o valor padrão). Aumentar o valor em 1 aumenta o requisito de memória do Helgrind em aproximadamente 100 bytes, então o valor máximo consumirá facilmente cerca de três gigabytes extras de memória.</p></body></html>
sv: <html><head/><body><p>Väljaren har bara effekt med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Information om &quot;gamla&quot; accesser med konflikter lagras i en cache med begränsad storlek, med LRU-liknande hantering. Det är nödvändigt eftersom det inte är praktiskt att lagra en stackföljd för varenda minnesåtkomst som programmet gör. Historisk information om inte nyligen använda platser kasseras periodiskt, för att frigöra utrymme i cachen.</p><p>Alternativet bestämmer cachens storlek, i form av antal olika minnesadresser som åtkomstinformation med konflikter lagras för. Om du märker att Helgrind visar kapplöpningsfel med bara en stack istället för de förväntade två stackarna, försök att öka värdet.</p><p>Det minsta värdet är 10 000 och det maximala är 30 000 000 (trettio gånger normalvärdet). Att öka värdet med 1, ökar minneskravet från Helgrind med mycket grovt 100 byte, så det maximala värdet lägger enkelt beslag på tre extra Gigabyte minne.</p></body></html>
tr: <html><head/><body><p>Bu bayrak yalnızca <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span> ' de herhangi bir etkiye sahiptir.</p><p>"eski" çakışan erişimlerle ilgili bilgiler LRU-tipi yönetimle sınırlı boyutlu bir bellek içerisinde saklanır. Bu gereklidir çünkü program tarafından yapılan her bir önbellek erişimi için bir yığın izi saklamak pratik değildir. Yakın zamanda erişilmemiş konumlar hakkındaki geçmiş bilgiler bellekte yer açmak için periyodik olarak göz ardı edilir.</p><p>Bu seçenek çakışan erişim bilgilerinin depolandığı farklı bellek adreslerinin sayısı açısından önbellek boyutunu denetler. Eğer Helgrind ' in beklenen iki yığın yerine yalnızca bir yığın ile yarış hatalarını gösterdiğini farkedersiniz, bu değeri artırmayı deneyiniz.</p><p>Minimum deper 10,000 ve azami 30,000,000 ' dur(varsayılan değerin 30 katı). Değeri 1 artırmak Helgrind ' in önbellek gereksinimini çok kabaca 100 bayt artırır, yani azami değer kolayca üç ekstra gigabayt kadar yiyebilir.</p></body></html>
uk: <html><head/><body><p>Цей прапорець працюватиме, лише якщо вказано параметр <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span>.</p><p>Інформація щодо «застарілих» конфліктних доступах зберігається у кеші обмеженого розміру із поступовим вилученням застарілих записів. Так зроблено, оскільки непрактично зберігати трасування стека для кожного доступу до пам’яті з боку програми. Застарілі дані щодо давніх доступів періодично відкидаються для вивільнення місця у кеші.</p><p>За допомогою цього параметра можна керувати розміром кешу, вказуючи кількість різних адрес у пам’яті, для яких слід зберігати дані щодо конфліктів доступу. Якщо вами буде виявлено, що Helgrind показує помилки лише з одним стеком замість очікуваних двох, спробуйте збільшити це значення.</p><p>Мінімальним є значення у 10000, а максимальним — у 30000000 (утридцятеро більше за типове значення). Збільшення значення на 1 збільшує використання Helgrind пам’яті на приблизно 100 байтів, отже за максимального значення буде спожито додатково приблизно 3 гігабайти пам’яті.</p></body></html>
zh_cn: <html><head/><body><p>该选项仅当 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--history-level=full</span> 时有效。</p><p>关于 &quot;旧的&quot; 冲突性访问的信息被保存在一个大小有限的缓存中，该缓存以 LRU（最近最少使用）方法管理。因为保存程序每次内存访问时的堆栈跟踪并不现实，这么做是有必要的。最近没有访问过的位置的历史信息会被周期性地丢弃，用以给缓存腾出空间。</p><p>该选项控制了缓存的大小，以被保存了冲突访问信息的不同内存地址数量计。如果您发现 Helgrind 在显示竞争性访问错误时仅显示了一个调用堆栈，而不是预期的两个，那么您可以尝试增大此值。</p><p>最小值为 10,000，最大值为 30,000,000（默认值的30倍）。将此值增加1大约会让 Helgrind 的内存需求增加100字节，因此使用最大值会轻易地额外占用三千兆字节（3GB）内存。</p></body></html>
