Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>When doing leak checking, determines how willing Memcheck is to consider different backtraces to be the same for the purposes of merging multiple leaks into a single leak report. When set to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, only the first two entries need match. When <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, four entries have to match. When <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, all entries need to match.</p><p>For hardcore leak debugging, you probably want to use <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> together with <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> or some such large number.</p><p>Note that the <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> setting does not affect Memcheck's ability to find leaks. It only changes how the results are presented.</p></body></html>
ar: <html><head/><body><p>عند إجراء فحص التّسرّب، يحدّد مدى استعداد Memcheck لاعتبار تتبّعات مكدّس مختلفة متماثلة لغرض دمج تسربات متعدّدة في تقرير تسرب واحد. عندما يضبط على <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">منخفض</span>، يجب أن يتطابق أول إدخالين فقط. عندما <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">متوسّط</span>، يجب أن تتطابق أربعة إدخالات. عندما <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">عالي</span>، يجب أن تتطابق كل الإدخالات.</p><p>لتنقيح التّسرّب الشّديد، قد ترغب في استخدام <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> أو أي عدد كبير من هذا القبيل.</p><p>لاحظ أن إعداد <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> لا يؤثر على قدرة Memcheck على إيجاد التّسرّبات. يغيّر فقط كيف تعرض النتائج.</p></body></html>
ca: <html><head/><body><p>En efectuar la comprovació de fuites, determina com el Memcheck considerarà diferents traces inverses a què siguin la mateixa amb la finalitat de fusionar múltiples fuites en un únic informe de fuita. Quan s'estableixi a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, només caldrà la coincidència de les dues primeres entrades. Quan sigui <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, cal que coincideixin quatre entrades. Quan sigui <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, cal que coincideixin totes les entrades.</p><p>Per a la depuració intensa de fuites, probablement voldreu usar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> conjuntament amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> o un nombre gran semblant.</p><p>Cal tenir en compte que el paràmetre <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> no afecta la capacitat del Memcheck per a trobar fuites. Només canvia com es presenten els resultats.</p></body></html>
eo: <html><head/><body><p>Kiam oni faras likkontroladon, determinas kiom volonte Memcheck konsideras malsamajn malantaŭajn spurojn samaj por kunfandi plurajn likojn en ununuran likraporton. Kiam estas agordita al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">malalta</span>, nur la unuaj du enskriboj devas kongrui. Kiam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, kvar enskriboj devas kongrui. Kiam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alta</span>, ĉiuj enskriboj devas kongrui.</p><p>Por malmola elpurigo, vi verŝajne volas uzi <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> kune kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> aŭ iu tia granda nombro.</p><p>Rimarku, ke la agordo <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> ne influas la Memcheck. kapablo trovi likojn. Ĝi nur ŝanĝas kiel la rezultoj estas prezentitaj.</p></body></html>
es: <html><head/><body><p>Cuando se realizan comprobaciones de fugas, determina la disposición de Memcheck para considerar distintas trazas de la pila como la misma con el propósito de fusionar múltiples fugas en un único informe de fuga. Cuando se define como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">baja</span>, solo las dos primeras entradas deben coincidir. Cuando es <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">media</span>, deben coincidir cuatro entradas. Cuando es <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">alta</span>, deben coincidir todas las entradas.</p><p>Para la depuración de fugas experta, tal vez quiera usar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> junto con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> o cualquier otro número grande.</p><p>Tenga en cuenta que el ajuste <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> no afecta a la capacidad de Memcheck para detectar fugas. Solo cambia cómo se presentan los resultados.</p></body></html>
fr: <html><head/><body><p>En réalisant une vérification de fuite mémoire, détermine comment Memcheck doit considérer les différentes traces de pile pour avoir le même traitement en fusionnant les fuites multiples dans un unique rapport de fuite mémoire. Quand cette option est positionnée à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">bas</span>, seules les deuxièmes entrées doivent correspondre. Quand cette option est positionnée à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, quatre entrées doivent correspondre. Quand cette option est positionnée à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">haut</span>, toutes les entrées doivent correspondre.</p><p>Pour un débogage extrême de fuites mémoire, vous voudriez sûrement utiliser l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> ensemble avec <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> ou un quelque chose comme un grand nombre.</p><p>Veuillez noter que l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> n'affecte pas la capacité de Memcheck à détecter des fuites mémoire. Cela ne change que la façon dont les résultats sont affichés.</p></body></html>
gl: <html><head/><body><p>Ao facer comprobacións de perdas, determina a disposición de Memcheck a considerar distintas trazas inversas como a mesma para mesturar varias perdas nun único informe de perda. Cando se estabelece a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span> (baixa), só as primeiras dúas entradas teñen que coincidir. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span> (media), teñen que coincidir catro. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span> (alta), teñen que coincidir todas.</p><p>Para a depuración avanzada de perdas, probablemente lle interese usar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> xunto con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> ou un número así de alto.</p><p>Teña en conta que a opción <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> non afecta á habilidade de Memcheck para atopar perdas, só cambia a forma en que se presentan os resultados.</p></body></html>
ka: <html><head/><body><p>მეხსიერების გაჟონვის შემოწმებისას განსაზღვრავს, რამდენად „მზადაა“ Memcheck, რომ სხვადასხვა უკუტრეისი მიიჩნიოს იდენტურად, რომ რამდენიმე გაჟონვა ერთ ანგარიშში გააერთიანოს. როდესაც დაყენებულია მნიშვნელობა <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">დაბალი</span>, მხოლოდ პირველი ორი ჩანაწერის დამთხვევაა საჭირო. მნიშვნელობაზე <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, ოთხი ჩანაწერი უნდა დაემთხვეს. ხოლო <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span> მნიშვნელობისას, ყველა ჩანაწერი უნდა იყოს იდენტური.</p><p>გაჟონვების საფუძვლიანი გამართვისთვის, სავარაუდოდ, დაგჭირდებათ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> პარამეტრის გამოყენება <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span>-თან ან სხვა მსგავს დიდ რიცხვთან ერთად.</p><p>გაითვალისწინეთ, რომ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> პარამეტრი გავლენას არ ახდენს Memcheck-ის უნარზე, იპოვოს გაჟონვები. ის მხოლოდ შედეგების წარმოდგენის ფორმას ცვლის.</p></body></html>
ko: <html><head/><body><p>누수를 검사할 때 Memcheck에서 여러 메모리 누수를 누수 보고서 하나로 합칠 때 서로 다른 역추적을 같은 것으로 간주할 정도를 설정합니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>로 설정했다면 첫 두 항목만 일치하면 합칩니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>로 설정했다면 첫 네 항목이 일치해야 합니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>로 설정했다면 모든 항목이 일치해야 합니다.</p><p>어려운 누수 디버그를 진행할 때에는 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> 옵션과 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> 정도의 큰 수로 같이 지정하기를 추천합니다.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> 설정은 Memcheck의 누수 확인에 영향을 주지 않습니다. 결과 표시에만 영향을 줍니다.</p></body></html>
nl: <html><head/><body><p>Bij controle voor leaks, moet u instellen hoe Memcheck verschillende backtraces hetzelfde zijn voor het doel om meerdere leaks in een enkele leak rapport samen te voegen. Ingesteld op <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, hoeven alleen de eerste twee entries overeen te komen. Ingesteld op <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, moeten vier entries overeen te komen. Ingesteld op <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, moeten alle entries overeenkomen.</p><p>Voor intensief leak debugging, wilt u waarschijnlijk gebruiken <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> samen met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> of vergelijkbaar groot getal.</p><p>Vergeet niet dat de instelling voor <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> niet van invloed is op de mogelijkheden van Memcheck's voor het vinden van leaks. Het wijzigt alleen hoe de resultaten worden gepresenteerd.</p></body></html>
pl: <html><head/><body><p>Przy sprawdzaniu wycieków, określa jak chętnie Memcheck roważa różne ślady programów jako te same dla celów scalania wielu wycieków w pojedyncze zgłoszenie wycieku. Gdy ustawione na <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, to tylko dwa pierwsze wspisy muszą pasować. Gdy ustawione na <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, to cztery wpisy muszą pasować. Gdy ustawione na <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, to pasować muszą wszystkie wpisy.</p><p>Dla szeroko zakrojonego szukania wycieków, chcesz prawdopodobnie użyć <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> wraz z <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> lub podobną dużą liczbą.</p><p>Pamiętaj, że ustawienie <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> nie wpływa na zdolność Memcheck do wykrywania wycieków. Zmienia się tylko sposób wyświetlania wyników .</p></body></html>
pt: <html><head/><body><p>Ao fazer a verificação de fugas, define quão determinado o Memcheck é para ter em consideração os diferentes registos das pilhas como sendo os mesmos, com o objectivo de reunir as várias fugas num único relatório de fugas. Se for configurado como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, só precisam de corresponder os dois primeiros elementos. Quando for <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, terá de haver correspondência entre quatro elementos. Quando for <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, todos os elementos têm de corresponder.</p><p>Para a depuração aprofundada de fugas, provavelmente há-de querer usar o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> em conjunto com a opção <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> ou outro número elevado qualquer.</p><p>Lembre-se que a opção <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> não afecta a capacidade do Memcheck para descobrir fugas. Só modifica a forma como os resultados são apresentados.</p></body></html>
pt_br: <html><head/><body><p>Ao realizar a verificação de vazamentos, determina a disposição do Memcheck em considerar diferentes backtraces como iguais para fins de mesclar vários vazamentos em um único relatório de vazamento. Quando definido como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">baixo</span>, apenas as duas primeiras entradas precisam corresponder. Quando definido como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">médio</span>, quatro entradas precisam corresponder. Quando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, todas as entradas precisam corresponder.</p><p>Para depuração de vazamentos hardcore, você provavelmente desejará usar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> junto com <span style=" font-family:'Monospace';font-weight:600; font-style:italic;">--num-callers=40</span> ou algum número grande semelhante.</p><p>Observe que a configuração <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> não afeta a capacidade do Memcheck de encontrar vazamentos. Isso apenas muda a forma como os resultados são apresentados.</p></body></html>
sv: <html><head/><body><p>När kontroll av läckor utförs, bestämmer hur villig Memcheck är att anse olika bakåtspårningar vara samma för syftet att sammanfoga flera läckor till en enda läckrapport. När det är inställt till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span> behöver bara de två första posterna stämma överens. Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, måste fyra poster stämma överens. Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span> måste alla poster stämma överens.</p><p>För intensiv felsökning av läckor bör man troligtvis använda <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> tillsammans med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> eller något liknande stort tal.</p><p>Observera att inställningen <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> inte påverkar Memchecks möjlighet att hitta läckor. Den ändrar bara hur resultatet presenteras.</p></body></html>
tr: <html><head/><body><p>Sızma denetlemesi yaparken, Memcheck ' in birden fazla sızıntıyı tek bir sızıntı raporuna birleştirmek amacıyla farklı geri izlemeleri göz önünde bulundurmak için ne kadar istekli olduğunu belirler. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span> ayarlandığında, yalnızca ilk iki girdinin eşleşmesi gereklidir. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span> iken, 4 girdinin eşleşmesi zorunludur. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span> iken, tüm girdilerin eşleşmesi gereklidir.</p><p>Kararlı sızma hata ayıklaması için, muhtemelen <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> ' i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> ile veya benzer daha büyük sayı ile birlikte kullanmak istersiniz.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> seçeneğinin Memcheck ' in sızmaları bulma yetisini etkilemediğini unutmayınız. O yalnızca sonuçların nasıl gösterileceğini değiştirir.</p></body></html>
uk: <html><head/><body><p>Під час перевірки на витоки визначає, наскільки Memcheck вважатиме інші зворотні трасування подібними для об’єднання декількох витоків у один звіт щодо витоку. Якщо встановлено значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>, мають збігатися перші два записи. Якщо встановлено значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>, мають збігатися перші чотири записи. Якщо встановлено значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>, мають збігатися усі записи.</p><p>Якщо потрібен доскіпливий пошук витоків, варто скористатися параметром <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> у поєднанні з <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> або якимось іншим достатньо великим числом для num-callers.</p><p>Зауважте, що встановлення параметра <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> не вплине на можливість пошуку витоків за допомогою Memcheck. Цей параметр змінить лише спосіб представлення результатів.</p></body></html>
zh_cn: <html><head/><body><p>在进行泄漏检查时，该选项决定了在将多个泄漏合并为一个泄漏报告时，Memcheck 有多倾向于将不同的调用堆栈视为相同的。如果设置为 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">low</span>，那么只需要前两项匹配即可。如果设置为 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">med</span>，那么需要有四个项目匹配。如果设置为<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">high</span>，那所有项目都需要匹配。</p><p>如果要进行硬核泄漏调试，您可能会想同时使用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution=high</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--num-callers=40</span> 或者其他较大的数目。</p><p>注意 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--leak-resolution</span> 设置不影响 Memcheck 寻找泄漏的能力。它只影响结果的展示方法。</p></body></html>

source: Show leak kinds:
ar: اعرض أنواع التسرّب:
ca: Mostra les classes de fuites:
eo: Montri likspecojn:
es: Mostrar tipos de fugas:
fr: Afficher les types de fuite :
gl: Mostrar os tipos de perda:
it: Mostra i tipi di perdite:
ka: გაჟონვის ტიპების ჩვენება:
ko: 누수 형식 표시:
nl: Soorten lekken tonen:
pl: Pokaż rodzaje wycieków:
pt: Mostrar os tipos de fugas:
pt_br: Mostrar tipos de vazamento:
sv: Visa typer av läckor:
tr: Sızma çeşitlerini göster:
uk: Показувати такі типи витоків:
zh_cn: 显示泄漏类型：

source: Specifies the leak kinds to show.
ar: يحدد أنواع التسرّب التي يجب عرضها.
ca: Especifica les classes de fuites a mostrar.
eo: Specifas la likspecojn por montri.
es: Indica los tipos de fugas a mostrar.
fr: Spécifie les types de fuites à afficher.
gl: Indica os tipos de perda para mostrar.
it: Specifica i tipi di perdite da mostrare.
ka: მიუთითებს საჩვენებელი გაჟონვის ტიპებს.
ko: 표시할 누수 형식을 지정합니다.
nl: Specificeert de te tonen soorten lekken.
pl: Określa czy wyświetlać rodzaje wycieków.
pt: Indica os tipos de fugas a mostrar.
pt_br: Especifica os tipos de vazamento a serem exibidos.
sv: Anger typer av läckor som ska visas.
tr: Gösterilecek sızma çeşitlerini belirtir.
uk: Визначає типи витоків, які слід показувати.
zh_cn: 指定要显示的泄漏类型。

source: Used heuristics:
ar: الاستدلالات المُستخدمة:
ca: Heurística usada:
eo: Uzita heŭristiko:
es: Heurística usada:
fr: Utiliser une heuristique :
gl: Heurísticas usadas:
it: Euristiche usate:
ka: გამოყენებული ევრისტიკა:
ko: 사용할 휴리스틱:
nl: Gebruikte heuristics:
pl: Użyta heurustyka:
pt: Heurísticas usadas:
pt_br: Heurísticas utilizadas:
sv: Använd heuristik:
tr: Kullanılan sezgiseller:
uk: Використана евристика:
zh_cn: 要使用的策略：
