Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Configure Valgrind Settings
ar: اضبط إعدادات Valgrind
ca: Configura els paràmetres del Valgrind
eo: Starigi Valgrind-agordojn
es: Configurar las preferencias de Valgrind
fr: Configurer les paramètres de Valgrind
gl: Configurar as opcións de Valgrind
it: Configura le impostazioni di Valgrind
ka: Valgrind-ის მორგება
ko: Valgrind 설정
nl: Valgrind-instellingen configureren
pl: Ustawienia Valgrinda
pt: Configurar as Opções do Valgrind
pt_br: Configurar as opções do Valgrind
sv: Anpassa inställningar av Valgrind
tr: Valgrind Ayarlarını Yapılandır
uk: Налаштувати параметри Valgrind
zh_cn: 配置 Valgrind 设置

source: Valgrind executables
ar: ملفّات Valgrind التنفيذيّة
ca: Executables del Valgrind
eo: Valgrind ruleblaj
es: Ejecutables de Valgrind
fr: Exécutables de Valgrind
gl: Executábeis de Valgrind
it: Eseguibili di Valgrind
ka: Valgrind -ის გამშვები ფაილები
ko: Valgrind 실행 파일
nl: Uitvoerbare bestanden van Valgrind
pl: Pliki wykonywalne Valgrinda:
pt: Executáveis do Valgrind
pt_br: Executáveis do Valgrind:
sv: Körbara Valgrind-program
tr: Valgrind çalıştırılabilir dosyaları
uk: Виконувані файли Valgrind
zh_cn: Valgrind 可执行文件

source: Visualizers executables
ar: ملفّات برامج التّصوير التنفيذيّة
ca: Executables visualitzadors
eo: Plenumeblaj vidigiloj
es: Ejecutables de visores
fr: Exécutable des afficheurs
gl: Executábeis de visualizadores
it: Eseguibili visualizzatori
ka: ვიზუალიზერის გამშვები ფაილები
ko: 시각화 도구 실행 파일
nl: Uitvoerbare bestanden van Visualizers:
pl: Plik wykonywalny wizualizatorów:
pt: Executáveis dos visualizadores
pt_br: Executáveis dos visualizadores
sv: Körbara visualiseringsprogram
tr: Görselleyici çalıştırılabilir dosyaları
uk: Виконувані файли візуалізатора
zh_cn: 可视化器可执行文件

source: Massif Visualizer:
ar: برنامج تصوير Massif:
eo: Massif-Vidigilo:
es: Visor Massif:
fr: Afficheur « Massif »
gl: Visualizador de Massif:
it: Visualizzatore Massif:
ka: ვიზუალიზერი Massif:
ko: Massif 시각화 도구:
nl: Massif-programma voor visualiseren:
pl: Wizualizacja-Massif:
pt: Visualizador do Massif:
sv: Massif visualisering:
tr: Massif Görselleyici:
uk: Візуалізатор Massif:
zh_cn: Massif 可视化工具:

source: Output
ar: المخرجات
ca: Sortida
eo: Eligo
es: Salida
fr: Sortie
gl: Saída
ka: გამოტანა
ko: 출력
nl: Uitvoer
pl: Wynik
pt: Resultado
pt_br: Saída
sv: Utdata
tr: Çıktı
uk: Виведення
zh_cn: 输出

source: <html><head/><body><p>Valgrind messages will be displayed in the output view during analysis.</p><p>Useful for plugin debugging.</p></body></html>
ar: <html><head/><body><p>رسائل Valgrind تعرض في عرض المخرجات أثناء التحليل.</p><p>مفيدة لتنقيح الملحق.</p></body></html>
ca: <html><head/><body><p>Els missatges del Valgrind es mostraran a la vista de la sortida durant l'anàlisi.</p><p>És útil per a la depuració de connectors.</p></body></html>
eo: <html><head/><body><p>Valgrind-mesaĝoj estos montrataj en la eligvido dum analizo.</p><p>Utilaj por krompurigo.</p></body></html>
es: <html><head/><body><p>Los mensajes de Valgrind se mostrarán en la vista de salida durante el análisis.</p><p>Útil para la depuración de complementos.</p></body></html>
fr: <html><head/><body><p>Les messagers de Valgrind seront affichés dans l'affichage de sortie durant l'analyse.</p><p>Utile pour le débogage du module externe.</p></body></html>
gl: <html><head/><body><p>As mensaxes de Valgrind mostraranse na vista da saída durante a análise.</p> <p>Útil para depurar complementos.</p></body></html>
ka: <html><head/><body><p>ანალიზის დროს Valgrind-ის შეტყობინებები გამოტანის ხედში იქნება ნაჩვენები .</p><p>სასარგებლოა დამატების გასამართად.</p></body></html>
ko: <html><head/><body><p>분석 중에 출력 보기에 Valgrind 메시지를 표시합니다.</p><p>플러그인 디버깅에 유용합니다.</p></body></html>
nl: <html><head/><body><p>Meldingen van Valgrind zullen getoond worden in de uitvoerweergave gedurende de analyse.</p><p>Nuttig voor debuggen van plug-ins.</p></body></html>
pl: <html><head/><body><p>Wiadomości Valgrinda będą wyświetlane w widoku wyników podczas analizy.</p><p>Użyteczne przy diagnozowaniu wtyczek.</p></body></html>
pt: <html><head/><body><p>As mensagens do Valgrind serão apresentadas na área de resultados durante a análise.</p><p>Útil para a depuração do 'plugin'.</p></body></html>
pt_br: <html><head/><body><p>As mensagens do Valgrind serão exibidas na visualização de saída durante a análise.</p><p>Útil para depuração de plugins.</p></body></html>
sv: <html><head/><body><p>Meddelanden från valgrind visas i utmatningsvyn under analys.</p><p>Användbart för avlusning av insticksprogram.</p></body></html>
tr: <html><head/><body><p>Valgrind mesajları çözümleme boyunca çıktı görünümünde gösterilecektir.</p><p>Eklenti, hata ayıklaması için kullanışlıdır.</p></body></html>
uk: <html><head/><body><p>Повідомлення Valgrind буде показано на панелі виведення під час аналізу.</p><p>Корисно для діагностики додатків.</p></body></html>
zh_cn: <html><head/><body><p>Valgrind 消息会在分析过程中显示在输出视图中。</p><p>有助于插件调试。</p></body></html>

source: Show valgrind output during analysis
ar: اعرض مخرجات Valgrind أثناء التحليل
ca: Mostra la sortida del Valgrind durant l'anàlisi
eo: Montru valgrind-eligon dum analizo
es: Mostrar la salida de Valgrind durante el análisis
fr: Afficher la sortie de Valgrind durant l'analyse
gl: Mostrar a saída de valgrind durante a análise.
it: Mostra l'output di valgrind durante l'analisi
ka: ანალიზის დროს valgrind -ის გამოტანის ჩვენება
ko: 분석 중 Valgrind 출력 표시
nl: Uitvoer van Valgrind tonen tijdens analyseren
pl: Wyświetlaj wynik valgrinda podczas analizy
pt: Mostrar o resultado do Valgrind durante a análise
pt_br: Mostrar saída valgrind durante a análise
sv: Visa utmatning från valgrind under analys
tr: Analiz boyunca valgrind çıktısının göster
uk: Показувати виведення valgrind під час аналізу
zh_cn: 分析时显示 Valgrind 输出

source: %1 Analysis (%2)
ar: تحليل %1 (%2)
ca: Anàlisi %1 (%2)
eo: %1 Analizo (%2)
es: Análisis de %1 (%2)
fr: %1 Analyse (%2)
gl: Análise de %1 (%2)
it: Analisi %1 (%2)
ka: %1 -ის ანალიზი (%2)
ko: %1 분석(%2)
nl: %1 Analyse (%2)
pt: Análise do %1 (%2)
pt_br: Análise %1 (%2)
sv: Analys med %1 (%2)
tr: %1 Çözümleme (%2)
uk: Аналіз %1 (%2)
zh_cn: %1 分析 (%2)

source: Failed to start valgrind from "%1".
ar: أخفق بدء تشغيل Valgrind من «%1».
ca: Ha fallat en iniciar «valgrind» des de «%1».
eo: Malsukcesis lanĉi valgrind de "%1".
es: Fallo al iniciar valgrind desde «%1».
fr: Impossible de démarrer Valgrind à partir de « %1 ».
gl: Non se puido iniciar Valgrind desde «%1».
it: Avvio di valgrind da «%1» non riuscito.
ka: "%1"-დან valgrind -ის გაშვების შეცდომა.
ko: "%1"에서 Valgrind를 실행할 수 없습니다.
nl: Opstarten van valgrind vanuit "%1" is mislukt.
pl: Nie udało się uruchomić valgrind z "%1".
pt: Não foi possível iniciar o Valgrind a partir do "%1".
pt_br: Não foi possível iniciar o Valgrind a partir do "%1".
sv: Misslyckades att starta Valgrind från "%1".
tr: Valgrind, "%1" konumundan başlatılamadı.
uk: Не вдалося запустити valgrind з «%1».
zh_cn: 从“%1”启动 valgrind 失败。

source: Valgrind crashed.
ar: تعطّل Valgrind.
ca: El Valgrind ha fallat.
eo: Valgrind kraŝis.
es: Valgrind ha fallado.
fr: L'application Valgrind s'est arrêtée de façon anormale.
gl: Valgrind quebrou.
it: Valgrind è andato in crash.
ka: Valgrind -ი ავარიულად დასრულდა.
ko: Valgrind가 충돌했습니다.
nl: Valgrind is gecrasht.
pl: Awaria Valgrinda.
pt: O Valgrind estoirou.
pt_br: O Valgrind estourou.
sv: Valgrind kraschade.
tr: Valgrind çöktü.
uk: Аварійне завершення Valgrind.
zh_cn: Valgrind 已崩溃。

source: Valgrind process timed out.
ar: انتهت مهلة عمليّة Valgrind.
ca: El procés del Valgrind ha excedit el temps.
eo: Valgrind-procezo eksvalidiĝis.
es: Tiempo agotado en proceso Valgrind.
fr: L'application Valgrind ne répond plus.
gl: O proceso Valgrind esgotou o tempo límite.
it: Time out del processo Valgrind.
ka: Valgrind-ის პროცესის მოლოდინის ვადა გავიდა.
ko: Valgrind 프로세스 시간이 초과되었습니다.
nl: Valgrind-proces timed out.
pl: Przekroczono czas oczekiwania na proces Valgrinda.
pt: O processo do Valgrind expirou o tempo-limite.
pt_br: O processo do Valgrind expirou o tempo-limite.
sv: Tidsgräns gick ut för Valgrind-processen.
tr: Valgrind sürecinde zaman aşımı.
uk: Перевищення часу затримки у процесі Valgrind.
zh_cn: Valgrind 进程超时。

source: Write to Valgrind process failed.
ar: أخفقت الكتابة إلى عمليّة Valgrind.
ca: Ha fallat l'escriptura al procés del Valgrind.
eo: Skribi al Valgrind-procezo malsukcesis.
es: Fallo en escritura en el proceso Valgrind.
fr: Impossible d'écrire dans le processus Valgrind.
gl: A escritura no proceso de Valgrind fallou.
it: Scrittura nel processo Valgrind non riuscita.
ka: Valgrind-ის პროცესში ჩაწერის შეცდომა.
ko: Valgrind 프로세스에 쓸 수 없습니다.
nl: Naar Valgrind-proces schrijven is mislukt.
pl: Nieudany proces zapisywania do Valgrinda.
pt: A escrita no processo do Valgrind foi mal-sucedida.
pt_br: A escrita no processo do Valgrind foi mal-sucedida.
sv: Skrivning till Valgrind-processen misslyckades.
tr: Valgrind sürecine yazma hatası.
uk: Запис до процесу Valgrind зазнав невдачі.
zh_cn: 写入 Valgrind 进程失败。

source: Read from Valgrind process failed.
ar: أخفق القراءة من عمليّة Valgrind.
ca: Ha fallat la lectura del progrés del Valgrind.
eo: Legado de Valgrind-procezo malsukcesis.
es: Fallo en lectura del proceso Valgrind.
fr: Impossible de lire depuis le processus Valgrind.
gl: A lectura do proceso de Valgrind fallou.
it: Lettura dal processo Valgrind non riuscita.
ka: Valgrind-ის პროცესიდან წაკითხვის შეცდომა.
ko: Valgrind 프로세스에서 읽을 수 없습니다.
nl: Uit Valgrind-proces lezen is mislukt.
pl: Nieudany proces odczytywania z Valgrinda.
pt: A leitura do processo do Valgrind foi mal-sucedida.
pt_br: A leitura do processo do Valgrind foi mal-sucedida.
sv: Läsning från Valgrind-processen misslyckades.
tr: Valgrind sürecinden okuma hatası.
uk: Читання з процесу Valgrind зазнало невдачі.
zh_cn: 从 Valgrind 进程读取失败。

source: Please review your Valgrind launch configuration.
ar: من فضلك راجع اضبط تشغيل Valgrind الخاص بك.
ca: Reviseu la configuració de llançament del Valgrind.
eo: Bonvolu revizii vian lanĉan agordon de Valgrind.
es: Por favor, revise la configuración de lanzamiento de Valgrind.
fr: Veuillez revoir votre configuration de démarrage de Valgrind.
gl: Revise a configuración de inicio de Valgrind.
it: Ricontrolla la configurazione di esecuzione di Valgrind.
ka: გადახედეთ Valgrind-ის გაშვების თქვენს კონფიგურაციას.
ko: Valgrind 실행 설정을 확인하십시오.
nl: Bekijk uw Valgrind opstartconfiguratie.
pl: Sprawdź swoje ustawienia uruchomieniowe Valgrinda.
pt: Reveja por favor a sua configuração de lançamento do Valgrind.
pt_br: Revise sua configuração de inicialização do Valgrind.
sv: Granska startinställning av Valgrind.
tr: Lütfen Valgrind başlatma yapılandırmanızı gözden geçiriniz.
uk: Будь ласка, перегляньте ваші налаштування запуску Valgrind.
zh_cn: 请检查您的 Valgrind 启动配置。

source: Unknown Valgrind process error.
ar: خطأ عمليّة Valgrind غير معروف.
ca: Error desconegut del procés del Valgrind.
eo: Nekonata eraro pri procezo de Valgrind.
es: Error desconocido del proceso Valgrind.
fr: Erreur inconnue du processus Valgrind.
gl: Ocorreu un erro descoñecido do proceso Valgrind.
it: Errore sconosciuto del processo Valgrind.
ka: Valgrind-ის პროცესის უცნობი შცდომა.
ko: 알 수 없는 Valgrind 프로세스 오류입니다.
nl: Onbekende procesfout in Valgrind.
pl: Nieznany błąd procesu Valgrinda.
pt: Ocorreu um erro desconhecido no processo do Valgrind.
pt_br: Ocorreu um erro desconhecido no processo do Valgrind.
sv: Okänt fel för Valgrind-processen.
tr: Bilinmeyen Valgrind süreç hatası.
uk: Невідома помилка у процесі Valgrind.
zh_cn: 未知的 Valgrind 进程错误。

source: Valgrind Error
ar: خطأ Valgrind
ca: Error del Valgrind
eo: Valgrind Eraro
es: Error de Valgrind
fr: Problème avec Valgrind
gl: Erro de Valgrind
it: Errore di Valgrind
ka: Valgrind -ის შეცდომა
ko: Valgrind 오류
nl: Valgrind-fout
pl: Błąd Valgrinda
pt: Erro do Valgrind
pt_br: Erro do Valgrind
sv: Fel i Valgrind
tr: Valgrind Hatası
uk: Помилка Valgrind
zh_cn: Valgrind 错误

source: Executing command:
ar: تنفيذ الأمر:
ca: S'està executant l'ordre:
eo: Plenumante komandon:
es: Ejecutando la orden:
fr: Exécution de la commande :
gl: Orde en execución:
it: Esecuzione del comando:
ka: ბრძანების შესრულება:
ko: 명령 실행 중:
nl: In uitvoering zijnde opdracht:
pl: Wykonywanie polecenia:
pt: A executar o comando:
pt_br: Executando comando:
sv: Kör kommando:
tr: Komut çalıştırılıyor:
uk: Виконуємо команду:
zh_cn: 执行命令：

source: Failed to execute the command:
ar: أخفق تنفيذ الأمر:
ca: Ha fallat en executar l'ordre:
eo: Malsukcesis plenumi la komandon:
es: Ha fallado la ejecución de la orden:
fr: Impossible d'exécuter la commande :
gl: Non se puido executar a orde:
it: Esecuzione del comando non riuscita:
ka: ბრძანების გაშვების შეცდომა:
ko: 명령을 실행할 수 없음:
nl: Uitvoeren is mislukt van opdracht:
pl: Nie udało się wykonać polecenia:
pt: Não foi possível executar o comando:
pt_br: Falha ao executar o comando:
sv: Misslyckades köra kommando:
tr: Komut yürütülemedi:
uk: Не вдалося виконати команду:
zh_cn: 执行命令失败：

source: Valgrind Common Settings
ar: إعدادات Valgrind الشائعة
ca: Configuració normal del Valgrind
eo: Komunaj Agordoj de Valgrind
es: Preferencias comunes de Valgrind
fr: Paramètres communs de Valgrind
gl: Configuración común de Valgrind
it: Impostazioni comuni di Valgrind
ka: Valgrind-ის საერთო პარამეტრები
ko: Valgrind 공통 설정
nl: Gemeenschappelijke instellingen van Valgrind
pl: Ogólne ustawienia Valgrinda
pt: Configuração Comum do Valgrind
pt_br: Configurações comuns do Valgrind
sv: Vanliga inställningar av Valgrind
tr: Valgrind Genel Ayarları
uk: Загальні параметри Valgrind
zh_cn: Valgrind 通用设置

source: Display stac&k to depth:
ar: اعرض المكدّس لعمق:
ca: Mostra la pila fins a la &profunditat:
eo: Montri sta&kon ĝis profundo:
es: Mostrar pila &hasta el nivel:
fr: Afficher la pile jusqu'à la profon&deur :
gl: Mostrar a pila ata a &profundidade:
it: Mostra stac&k fino in profondità:
ka: სტე&კის ჩვენება სიღრმემდე:
ko: 표시할 스택 깊이(&K):
nl: Stac&k tonen tot diepte:
pl: Pokaż stos do głębo&kości:
pt: Mostrar a pilha até à profun&didade:
pt_br: Mos&trar a pilha na profundidade:
sv: Visa stac&k till djupet:
tr: Derinlik için yığını göster:
uk: Показувати стек на &глибину:
zh_cn: 最大显示堆栈深度 (&k)：

source: <html><head/><body><p>Specifies the maximum number of entries shown in stack traces that identify program locations. Note that errors are commoned up using only the top four function locations (the place in the current function, and that of its three immediate callers). So this doesn't affect the total number of errors reported.</p><p>The maximum value for this is 500. Note that higher settings will make Valgrind run a bit more slowly and take a bit more memory, but can be useful when working with programs with deeply-nested call chains.</p></body></html>
ar: <html><head/><body><p>يحدد العدد الأقصى من الإدخالات المعروضة في تتبّعات المكدّس التي تحدد مواقع البرنامج. لاحظ أن الأخطاء تجمع باستخدام أعلى أربعة مواقع للدالة فقط (المكان في الدالة الحاليّة، وثلاثة من المستدعَيْنَ الفوريين لها). لذا هذا لا يؤثر على العدد الكلي للأخطاء المبلّغ عنها.</p><p>القيمة القصوى لهذا هي 500. لاحظ أن الإعدادات الأعلى ستجعل Valgrind يعمل ببطء أكثر قليلاً ويأخذ ذاكرة أكثر قليلاً، ولكنه قد يكون مفيداً عند العمل مع برامج بها سلاسل نداء متداخلة بعمق.</p></body></html>
ca: <html><head/><body><p>Especifica el nombre màxim d'entrades que es mostren a les traces de pila que identifiquen ubicacions de programa. Cal tenir en compte que els errors es reuneixen usant només les quatre principals ubicacions de funció (el lloc a la funció actual, i les seves tres invocadores immediates). Per tant, això no afecta el nombre total d'errors informats.</p><p>El seu valor màxim és 500. Cal tenir en compte que els paràmetres més alts faran que el Valgrind s'executi més lentament i ocupi més memòria, però pot ser útil quan treballi amb programes amb cadenes de crides amb imbricacions profundes.</p></body></html>
eo: <html><head/><body><p>Specifas la maksimuman nombron da enskriboj montritaj en stakspuroj kiuj identigas programlokojn. Notu, ke eraroj estas komunaj uzante nur la suprajn kvar funkciolokojn (la loko en la nuna funkcio, kaj tiu de ĝiaj tri tujaj alvokantoj). Do ĉi tio ne influas la totalan nombron de raportitaj eraroj.</p><p>La maksimuma valoro por ĉi tio estas 500. Notu, ke pli altaj agordoj igos Valgrind funkcii iom pli malrapide kaj prenos iom pli da memoro, sed povas esti utila kiam oni laboras kun programoj kun profunde nestitaj alvokĉenoj.</p></body></html>
es: <html><head/><body><p>Indica el número máximo de entradas que se muestran en las trazas de la pila para identificar ubicaciones de programas. Tenga en cuenta que los errores se unifican usando solo las cuatro ubicaciones de funciones superiores (la ubicación de la función actual y las de sus tres invocaciones inmediatas). Por ello, esto no afecta al número total de errores notificados.</p><p>Su valor máximo es 500. Tenga en cuenta que un valor más alto hará que Valgrind funcione algo más lento y ocupará algo más de memoria, pero puede resultar útil al trabajar con programas con cadenas de llamadas muy anidadas.</p></body></html>
fr: <html><head/><body><p>Spécifie le nombre maximum d'entrée affichées dans les traces de la pile détaillant les emplacements des programmes. Veuillez noter que les erreurs sont regroupées en n'utilisant que les quatre premiers emplacements de fonctions (soit l'emplacement dans la fonction courante et ceux des trois fonctions immédiatement appelantes). Ainsi, cela n'affecte pas le nombre total d'erreurs à signaler.</p><p>La valeur maximale est de 500. Veuillez noter que des valeurs plus hautes de ce paramètre peuvent conduire à plus de consommation de mémoire. Cela peut être utile pour des chaînes d'appels profondément imbriquées.</p></body></html>
gl: <html><head/><body><p>Indica o número máximo de entradas para mostrar nas trazas do montón (stack) que identifican lugares do programa. Teña en conta que os erros se poñen en común usando só os catro lugares de funcións superiores (o lugar na función actual, e o dos seus tres chamadores inmediatos). Así que iso non afecta ao número total de erros dos que se informa.</p><p>O valor máximo disto é 500. Un valor máis alto lentificará a execución de Valgrind e requirirá un pouco máis de memoria, pero pode ser útil ao traballar con programar con cadeas de chamadas profundamente aniñadas.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს სტეკის კვალში საჩვენებელი ჩანაწერების მაქსიმალურ რაოდენობას, რომლებიც პროგრამის მდებარეობებს აიდენტიფიცირებს. გაითვალისწინეთ, რომ შეცდომები ჯგუფდება მხოლოდ ზედა ოთხი ფუნქციის მდებარეობით (მიმდინარე ფუნქციის ადგილი და მისი სამი უშუალო გამომძახებელი). ასე რომ, ეს არ ახდენს გავლენას მოხსენებული შეცდომების საერთო რაოდენობაზე.</p><p>ამ პარამეტრის მაქსიმალური მნიშვნელობაა 500. გაითვალისწინეთ, რომ მაღალი მნიშვნელობები Valgrind-ს ოდნავ შეანელებს და მეტ მეხსიერებას წაართმევს, მაგრამ შეიძლება სასარგებლო იყოს ღრმად ჩადგმული გამოძახებების ჯაჭვების მქონე პროგრამებთან მუშაობისას.</p></body></html>
ko: <html><head/><body><p>프로그램 위치를 식별하는 스택 추적에서 표시할 최대 항목 개수를 지정합니다. 대개 발생한 오류는 4단계 안으로 역추적이 가능합니다(현재 함수에서의 위치, 해당 함수를 호출한 다른 함수 세 개). 따라서 보고하는 오류의 개수에는 영향을 주지 않습니다.</p><p>이 값의 최댓값은 500입니다. 값을 더 높게 설정하면 Valgrind 실행이 더 느려지고 메모리를 조금 더 사용할 수도 있으나, 호출 체인이 긴 프로그램을 추적할 때 유용할 수 있습니다.</p></body></html>
nl: <html><head/><body><p>Hier geeft u het maximum aantal getoonde items in de stack traces op die programma-locaties identificeren. Merk op dat fouten alleen in de locaties van de bovenste vier functies worden gemeld (de plaats in de huidige functie en dat van de drie hieruit aangeroepen functies). Het heeft daarom geen invloed op het totaal aantal gerapporteerde fouten.</p><p>Het maximum aantal hiervoor is 500. Merk op dat een hoger getal ervoor zorgt dat Valgrind langzamer gaat lopen en meer geheugen gebruikt, maar dit kan handig zijn bij programma's die gestapelde aanroepen hebben.</p></body></html>
pl: <html><head/><body><p>Określa maksymalną liczbę elementów pokazywanych na śladach stosów, które identyfikują miejsca w programie. Miej na uwadze, że błędy są grupowane przy użyciu szczytowych czterech miejsc funkcji (miejsce w bieżącej funkcji i w jej trzech bezpośrednich funkcjach wywołujących). Tak więc nie wpływa to na całkowitą liczbę zgłoszonych błędów.</p><p>Maksymalną wartością jest 500. Miej na uwadze, że większa wartość sprawi, że Valgrind będzie działał trochę wolniej i będzie wykorzystywał trochę więcej pamięci, lecz może się to okazać przydatne przy analizowaniu programów z głębokimi łańcuchami wywołań.</p></body></html>
pt: <html><head/><body><p>Define o número máximo de elementos apresentados nos registos da pilha que identificam as localizações nos programas. Lembre-se que os erros são reunidos entre si, usando apenas as quatro localizações de funções de topo (o local na função actual, e o das suas três funções chamadoras imediatas). Como tal, isto não afecta o número total de erros relatados.</p><p>O valor máximo para esta opção é 500. Lembre-se que os valores mais altos farão com que o Valgrind corra um bocado mais lento e consuma mais memória, mas mas poderá ser útil com programas que tenham sequências de chamadas bastante profundas.</p></body></html>
pt_br: <html><head/><body><p>Especifica o número máximo de entradas exibidas em rastreamentos de pilha que identificam localizações de programas. Observe que os erros são agrupados usando apenas as quatro principais localizações da função (o local na função atual e o de seus três chamadores imediatos). Portanto, isso não afeta o número total de erros relatados.</p><p>O valor máximo para isso é 500. Observe que configurações mais altas farão o Valgrind rodar um pouco mais lentamente e ocuparão um pouco mais de memória, mas podem ser úteis ao trabalhar com programas com cadeias de chamadas profundamente aninhadas.</p></body></html>
sv: <html><head/><body><p>Anger det maximala antalet poster som visas i stackspårningar som identifierar platser i programmet. Observera att fel görs gemensamma med användning av bara de fyra översta funktionsplatserna (platsen i den aktuella funktionen, och den i de tre omedelbara anropande), alltså påverkar det inte det totala antalet fel som rapporteras.</p><p>Det maximala värdet är 500. Observera att ett större värde gör att Valgrind kör något långsammare och använder något mer minne, men det kan vara användbart vid arbete med program som har djupt nästlade anropskedjor.</p></body></html>
tr: <html><head/><body><p>Program konumlarını tanımlayan yığın izlerinde gösterilen girdilerin azami sayısını belirtir. Hataların yalnızca en yüksek 4 fonksiyon konumunu kullanarak ortaklaştığına dikkat ediniz (Mevcut fonksiyondaki yer ve onun 3 hemen çağırıcısı). Yani bu raporlanmış hataların toplam sayısını etkilemez.</p><p>Bunun için azami değer 500 ' dür. Daha yüksek ayarların Valgrind ' in daha yavaş çalışmasına sebep olacağına ve biraz daha bellek alacağına dikkat ediniz, ancak derin-iç içe geçmiş çağrı zincirleri ile çalışan programlarda yararlı olabilir.</p></body></html>
uk: <html><head/><body><p>Визначає максимальну кількість записів, які буде показано у трасуваннях стека для ідентифікації місць у програмі. Зауважте, що помилки узагальнюються лише за верхніми чотирма записами функцій (місцем у поточній функції і місцями у трьох функціях, які можуть її викликати). Отже, це не вплине на загальну кількість помилок у звіті.</p><p>Максимальним значенням цього параметра є 500. Зауважте, що більші значення дещо уповільнять роботу Valgrind і призведуть до більшого споживання пам’яті. Втім, збільшення значення може бути корисним для дослідження програм із ланцюжками викликів зі значним рівнем вкладеності.</p></body></html>
zh_cn: <html><head/><body><p>指定在堆栈跟踪中显示程序位置的最多项目数。注意，错误仅用最顶上的四个函数位置来分类（当前函数位置，以及它的三个直接调用者）。因此，这不会影响总共报告的错误数量。</p><p>该值最大为 500。将此值设得更高会导致 Valgrind 运行的稍微慢一点，并且使用略微更多的内存，但是在处理有非常深的调用链的程序时可能有用。</p></body></html>
