Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Track origins of all uninitialised values
ar: راقب أصول جميع القيم غير المهيأة
ca: Traça els orígens de tots els valors sense inicialitzar
eo: Spuri originojn de ĉiuj nekomencigitaj valoroj
es: Rastrear el origen de todos los valores sin inicializar
fr: Tracer la provenance de toutes les valeurs non initialisées
gl: Facer un seguimento da orixe de todos os valores non inicializados.
it: Traccia l'origine di tutti i valori non inizializzati
ka: ყველა არაინიციალიზებული მნიშვნელობის წყაროს ტრეკინგი
ko: 모든 초기화되지 않은 값의 기원 추적
nl: Volg oorsprong van niet-geïnitialiseerde waarden
pl: Pokaż niezainicjowane wartości
pt: Registar as origens de todos os valores não-inicializados
pt_br: Rastrear origens de todos os valores não inicializados
sv: Spåra ursprung till oinitierade värden
tr: Tüm başlatılmamış değerlerin kaynağını takip et
uk: Стежити за походженням усіх неініціалізованих значень
zh_cn: 追踪所有未初始化值的来源

source: <html><head/><body><p>Controls whether Memcheck should employ more precise but also more expensive (time consuming) algorithms when checking the definedness of a value. The default setting is not to do that and it is usually sufficient. However, for highly optimised code valgrind may sometimes incorrectly complain. Invoking valgrind with <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> helps but comes at a performance cost. Runtime degradation of 25% have been observed but the extra cost depends a lot on the application at hand.</p></body></html>
ar: <html><head/><body><p>يتحكّم في ما إذا استخدم Memcheck خوارزميات أكثر دقة ولكنها أيضًا أكثر تكلفة (تستهلك وقتًا) عند فحص تعريف القيمة. الضبط المبدئي هو عدم القيام بذلك وهو كافٍ عادةً. ومع ذلك، بالنسبة للرمز المحسّن للغاية، قد يشتكي valgrind بشكل غير صحيح في بعض الأحيان. يساعد استدعاء valgrind مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> ولكنّه يأتي على حساب الأداء. لوحظ تدهور في وقت التشغيل بنسبة 25٪ ولكن التكلفة الإضافية تعتمد كثيرًا على التطبيق الذي بين يديك.</p></body></html>
ca: <html><head/><body><p>Controla si el Memcheck hauria d'utilitzar algorismes més precisos però també més costosos (en temps) en comprovar la definició d'un valor. L'opció predeterminada és no fer-ho així, i normalment és suficient. Tanmateix, per a un codi altament optimitzat, el Valgrind podria queixar-se incorrectament. Invocant el Valgrind amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> ajuda, però amb un cost de rendiment. S'ha observat una degradació del 25% en el temps d'execució, però el cost extra depèn molt de l'aplicació analitzada.</p></body></html>
eo: <html><head/><body><p>Regas ĉu Memcheck devus utiligi pli precizajn sed ankaŭ pli multekostajn (tempajn) algoritmojn dum kontrolado de la difino de valoro. La defaŭlta agordo estas ne fari tion kaj ĝi estas kutime sufiĉa. Tamen, por tre optimumigita kodo valgrind povas foje malĝuste plendi. Alvoki valgrind per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> helpas sed venas je la plej granda kvanto. rendimento kosto. Rultempa degenero de 25% estis observita sed la kromkosto dependas multe de la aplikaĵo ĉemane.</p></body></html>
es: <html><head/><body><p>Controla si Memcheck debe emplear algoritmos más precisos, aunque también más costosos (consumen más tiempo), al comprobar la precisión de un valor. El ajuste predeterminado es no hacer esto, y suele ser suficiente. No obstante, para código muy optimizado, es posible que valgrind se queje de forma incorrecta en algunas ocasiones. La invocación de valgrind con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> es de ayuda, aunque acarrea un coste de rendimiento. Se ha observado una degradación del 25% en tiempo de ejecución, aunque el coste extra depende bastante de la aplicación.</p></body></html>
fr: <html><head/><body><p>Contrôle si Memcheck doit employé des algorithmes plus précis mais plus complexes (coûteux en temps) lors de la vérification de la déclaration d'une valeur. Les paramètres par défaut est de faire simple, ce qui est en général suffisant. Cependant, pour du code hautement optimisé, Valgrind peut quelquefois se plaindre. Le lancement de Valgrind avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> aide mais au prix d'une baisse de performances. Une dégradation de l'environnement d'exécution de 25 % a été observée mais le coût additionnel dépend beaucoup de l'application.</p></body></html>
gl: <html><head/><body><p>Controla se Memcheck debería usar algoritmos máis precisos pero máis custosos (a nivel de tempo) ao comprobar se os valores están definidos. A configuración predeterminada é non facelo, e adoita abondar. Porén, para código altamente optimizado, valgrind podería ás veces queixarse incorrectamente. Chamar a valgrind con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> axuda pero ten un custo de rendemento. O empeoramento en tempo de execución será de arredor do 25%, en base á nosa experiencia, aínda que depende moito da aplicación.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, უნდა გამოიყენოს თუ არა Memcheck-მა უფრო ზუსტი, მაგრამ ასევე უფრო ძვირი (დროში ტევადი) ალგორითმები მნიშვნელობის განსაზღვრულობის შემოწმებისას. ნაგულისხმევი პარამეტრი ამას არ ითვალისწინებს და ეს ჩვეულებრივ საკმარისია. თუმცა, მაღალ დონეზე ოპტიმიზებული კოდის შემთხვევაში, Valgrind-მა შეიძლება ზოგჯერ შეცდომით დააფიქსიროს პრობლემა. Valgrind-ის გაშვება პარამეტრით <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> შველის ამ საკითხს, მაგრამ წარმადობის ხარჯზე. დაფიქსირებულია პროგრამის მუშაობის 25%-იანი შენელება, თუმცა დამატებითი დანახარჯი დიდწილად კონკრეტულ აპლიკაციაზეა დამოკიდებული.</p></body></html>
ko: <html><head/><body><p>Memcheck에서 값의 정의 정도를 확인할 때 더 정확하지만 더 시간이 오래 걸리는 알고리즘을 사용할지 여부를 제어합니다. 기본 설정은 그렇지 않으며 대개의 경우 충분합니다. 그러나 고도로 최적화된 코드에서는 Valgrind가 잘못 검사할 수도 있습니다. Valgrind를 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> 옵션을 사용하여 호출하면 해결할 수 있지만 성능에 영향을 줍니다. 런타임 성능 감소가 약 25% 정도 발생할 수 있지만 추가 비용은 앱에 따라 달라집니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in of Memcheck nauwkeuriger maar ook duurdere (langzamere) algoritmes moet gebruiken bij de controle van de correcte definitie van een waarde. De standaardinstelling is om dat niet te doen en meestal is dat voldoende. Maar, bij erg geoptimaliseerde code kan valgrind soms onterecht klagen. Valgrind opstarten met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> helpt maar komt wel met een prijs voor de performance. Er zijn meldingen van runtime vertraging van 25% maar de extra kosten hangen erg af van het te testen programma.</p></body></html>
pl: <html><head/><body><p>Określa czy Memcheck powinien zastosować bardziej dokładne, lecz także bardziej kosztowe (czasochłonne) algorytmy przy sprawdzaniu zdefiniowania wartości. Domyślnie nie robi tego, co jest zazwyczaj wystarczalne. Jednakże, dla wysoce zoptymalizowanego kodu valgrind może czasami niepoprawnie narzekać. Wywołanie valgrinda z <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> pomaga, lecz kosztem wydajności. Czasy uruchomieniowe pogarszają się o 25%, lecz zależy to znacznie od danej aplikacji.</p></body></html>
pt: <html><head/><body><p>Controla se o Memcheck deverá aplicar algoritmos mais precisos (mas que também consomem mais tempo e recursos) na verificação da definição de um dado valor. A configuração por omissão é não o fazer, o que é normalmente o suficiente. Contudo, para um código altamente optimizado, o Valgrind poder-se-á queixar de forma incorrecta. A invocação do Valgrind com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> ajuda mas traz um custo de performance. A degradação em execução de 25% foi observada, mas o custo extra depende bastante da aplicação em mãos.</p></body></html>
pt_br: <html><head/><body><p>Controla se o Memcheck deve empregar algoritmos mais precisos, mas também mais caros (demorados), ao verificar a definição de um valor. A configuração padrão não faz isso e geralmente é suficiente. No entanto, para código altamente otimizado, o valgrind pode às vezes reclamar incorretamente. Invocar o valgrind com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> ajuda, mas tem um custo de desempenho. Degradação de tempo de execução de 25% foi observada, mas o custo extra depende muito da aplicação em questão.</p></body></html>
sv: <html><head/><body><p>Styr om Memcheck ska utnyttja precisare men också dyrare (tidsödande) algoritmer när ett värdes definitionstillstånd kontrolleras. Standardinställningen är att inte göra det, och det är oftast tillräckligt. Dock kan Valgrind ibland felaktigt klaga för kraftigt optimerad kod. Att starta Valgrind med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> hjälper. men ger en prestandakostnad. Körtidsförsämringar på 25 % har observerats, men den extra kostnaden beror i hög grad på det föreliggande programmet.</p></body></html>
tr: <html><head/><body><p>Bir değerin tanımlılığını kontrol ederken Memcheck'in daha kesin ama aynı zamanda daha pahalı (zaman alıcı) algoritmalar kullanıp kullanmayacağını denetler. Varsayılan ayar bunu yapmamaktır ve genellikle yeterlidir. Ancak, yüksek düzeyde optimize edilmiş kod için valgrind bazen yanlış olarak şikayet eder. Valgrind'i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> ile çağırmak yardımcı olur; ancak bunun bir başarım maliyeti vardır. %​25'lik çalışma zamanı bozulması gözlemlendi; ancak ekstra maliyet büyük ölçüde eldeki uygulamaya bağlıdır.</p></body></html>
uk: <html><head/><body><p>Керує тим, чи слід Memcheck використовувати точніші, але повільніші алгоритми під час перевірки визначеності значення. Типово, такі алгоритми не використовуватимуться, оскільки, зазвичай, у цьому немає потреби. Втім, для високооптимізованого коду valgrind може іноді помилково повідомляти про помилки. Виклик valgrind з параметром <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> допомагає, але сповільнює роботи програми. Спостерігалося уповільнення до 25%. Вартість цієї перевірки залежить від програми, яку ви вивчаєте.</p></body></html>
zh_cn: <html><head/><body><p>指定 Memcheck 在检测一个变量是否有定义时要不要使用更精确但也更昂贵（更花时间）的算法。默认设置是不用，一般就已经能满足需求了。但是，对于被高度优化过的代码，valgrind 有时会错误地报错。如果在执行 valgrind 时使用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--expensive-definedness-checks=yes</span> 参数会有所帮助，但是这会带来性能上的开销。有观察到过 25% 的运行时性能损失，但是这些额外开销非常依赖于具体的应用程序。</p></body></html>

source: Expensive definedness checks
ar: فحوصات التعريف المكلفة
ca: Comprovacions de definicions costoses
eo: Multkostaj difinkontroloj
es: Comprobaciones precisas costosas
fr: Vérification en profondeur des définitions
gl: Comprobacións caras de estado de definición.
ka: ძვირიანი აღწერილობის შემოწმებები
ko: 비싼 정의됨 정도(definedness) 검사
nl: Dure controle op gedefinieerd
pl: Kosztowne sprawdzenia zdefiniowania
pt: Verificações dispendiosas de definições
pt_br: Verificações de definições caras
sv: Dyr kontroll av definitionstillstånd
tr: Pahalı tanımlılık denetlemeleri
uk: Перевірки вартісних визначеностей
zh_cn: 较昂贵的定义检查

source: Memcheck
ar: فحص الذاكرة
fr: Vérification de mémoire
it: Controllo della memoria
ka: მეხსიერების შემოწმება
sv: Minneskontroll
uk: Перевірка витоку пам’яті

source: Memcheck (Memory Error Detector)
ar: فحص الذاكرة (كاشف أخطاء الذاكرة)
ca: Memcheck (Detector d'errors de memòria)
eo: Memcheck (Detektilo pri Memoro-Eraro)
es: Memcheck (detector de errores de memoria)
fr: Memcheck (Détecteur d'erreur mémoire)
gl: Memcheck (detector de erros de memoria)
it: Memcheck (rilevatore di errori di memoria)
ka: Memcheck (მეხსიერების შეცდომის აღმომჩენი)
ko: Memcheck(메모리 오류 감지기)
nl: Memcheck (detector voor geheugenfouten)
pl: Memcheck (wykrywacz błędów w pamięci)
pt: Memcheck (Detector de Erros de Memória)
pt_br: Memcheck (Detector de Erros de Memória)
sv: Memcheck (detekteringsverktyg för minnesfel)
tr: Memcheck (Bellek Hata Denetleyicisi)
uk: Memcheck (засіб виявлення помилок у роботі з пам’яттю)
zh_cn: Memcheck (内存错误检测器)

source: Valgrind Output
ar: مُخرج Valgrind
ca: Sortida del Valgrind
eo: Valgrind Eligo
es: Salida de Valgrind
fr: Sortie de Valgrind
gl: Saída de Valgrind
it: Output di Valgrind
ka: Valgrind-ის გამოტანილი ინფორმაცია
ko: Valgrind 출력
nl: Valgrind-uitvoer
pl: Wyjście Valgrinda
pt: Resultado do Valgrind
pt_br: Resultado do Valgrind
sv: Utmatning från valgrind
tr: Valgrind Çıktısı
uk: Вивід Valgrind
zh_cn: Valgrind 输出

source: <b>Valgrind</b><p>Shows the output of valgrind. Valgrind detects:<br/>use of uninitialized memory;<br/>reading/writing memory after it has been free'd;<br/>reading/writing off the end of malloc'd blocks;<br/>reading/writing inappropriate areas on the stack;<br/>memory leaks &mdash; where pointers to malloc'd blocks are lost forever;<br/>passing of uninitialised and/or unaddressable memory to system calls;<br/>mismatched use of malloc/new/new [] vs free/delete/delete [];<br/>some abuses of the POSIX pthread API.</p>
ar: <b>Valgrind</b><p>يعرض مخرج valgrind. يكتشف Valgrind ما يلي:<br/>استخدام الذاكرة غير المهيأة؛<br/>قراءة/كتابة الذاكرة بعد تحريرها؛<br/>قراءة/كتابة خارج نهاية الكتل المخصّصة بـ malloc؛<br/>قراءة/كتابة مناطق غير مناسبة في المكدّس؛<br/>تسرّبات الذاكرة &mdash; حيث تفقد مؤشرات الكتل المخصّصة بـ malloc إلى الأبد؛<br/>تمرير ذاكرة غير مهيأة و/أو غير قابلة للعنونة إلى استدعاءات النظام؛<br/>الاستخدام غير المتطابق لـ malloc/new/new [] مقابل free/delete/delete []؛<br/>بعض الانتهاكات لواجهة برمجة تطبيقات POSIX pthread.</p>
ca: <b>Valgrind</b><p>Mostra la sortida de «valgrind». Valgrind detecta:<br/>ús de la memòria sense inicialitzar;<br/>lectura/escriptura de memòria després que ha estat alliberada;<br/>lectura/escriptura dels límits dels blocs de memòria assignats;<br/>lectura/escriptura d'àrees inadequades de la pila;<br/>pèrdues de memòria &mdash; on els punters als blocs assignats s'han perdut per sempre;<br/>passades de memòria no inicialitzada o no accessible a les crides del sistema;<br/>mal ús de malloc/new/new [] davant de free/delete/delete [];<br/>alguns dels abusos de l'API pthread de POSIX.</p>
eo: <b>Valgrind</b><p>Montras la eliron de valgrind. Valgrind detektas:<br/>uzon de nekomencigita memoro;<br/>legado/skribado de memoro post kiam ĝi liberiĝis;<br/>legado/forprenado de la fino de mallokitaj blokoj;<br/>legado/ skribi netaŭgajn areojn sur la stako;<br/>memorfuĝoj — kie montriloj al malloc'd blokoj estas perditaj por ĉiam;<br/>paso de neinicialigita kaj/aŭ neadresebla memoro al sistemaj vokoj;<br/>malkongrua uzo de malloc/new/new [] vs free/delete/delete [];<br/>kelkaj misuzoj de la POSIX pthread API.</p>
es: <b>Valgrind</b><p>Muestra la salida de la orden «valgrind». Valgrind detecta:<br/>el uso de memoria no inicializada;<br/>lectura/escritura de memoria que ha sido liberada;<br/>lectura/escritura fuera del límite de bloques asignados con malloc;<br/>lectura/escritura en áreas no apropiadas de la pila de llamadas;<br/>fugas de memoria (donde los punteros a bloques asignados con malloc se han perdido para siempre);<br/>paso de memoria no inicializada o no accesible a llamadas del sistema;<br/>uso equivocado de malloc/new/new [] frente a free/delete/delete [];<br/>algunos abusos de la API pthread de POSIX.</p>
fr: <b>Valgrind</b><p>Affiche la sortie de Valgrind. Valgrind détecte : <br/>l'utilisation de mémoire non initialisée ;<br/>la lecture / l'écriture de mémoire après qu'elle ait été libérée ;<br/>la lecture / l'écriture après la fin de blocs ayant fait l'objet d'une allocation de mémoire (par la fonction « malloc ») ;<br/>la lecture / l'écriture dans des zones inappropriées sur la pile ;<br/>les pertes de mémoire &mdash; lorsque des pointeurs sur des blocs ayant fait l'objet d'une allocation de mémoire (par la fonction « malloc ») sont définitivement perdus ;<br/>le passage de mémoire non initialisée et / ou non adressable aux appels système ;<br/>l'utilisation inadaptée de « malloc / new / new [] » ou « free / delete / delete [] » ;<br/>quelques abus de l'API « pthread » POSIX.</p>
gl: <b>Valgrind</b><p>Mostra a saída de valgrind. Valgrind detecta:<br/>o uso de memoria non inicializada<br/>lendo e escribindo na memoria despois de que se libere<br/>lendo e escribindo alén dos bloques reservados por «malloc»<br/>lendo e escribindo áreas non axeitadas da pila<br/>fugas de memoria &mdash; onde os punteiros a bloques reservados por malloc son perdidos para sempre<br/>pasando memoria non inicializada e/ou que non pode ter enderezo ás chamadas do sistema<br/>usos desemparellados de malloc/new/new [] contra free/delete/delete []<br/>algúns abusos da API pthread de POSIX.</p>
it: <b>Valgrind</b><p>Mostra l'output di Valgrind. Valgrind rileva<br/>l'uso di memoria non inizializzata<br/>letture/scritture in memoria dopo che è stata deallocata<br/>letture/scritture che oltrepassano i blocchi allocati con malloc<br/>letture/scritture in aree improprie sullo stack<br/>perdite di memoria &mdash; quando i puntatori ai blocchi allocati sono persi per sempre<br/>passaggio di memoria non inizializzata e/o non indirizzabile a chiamate di sistema<br/>un uso non corrispondente di malloc/new/new [] rispetto a free/delete/delete []<br/>alcuni abusi dell'API pthread POSIX.</p>
ka: <b>Valgrind</b><p>აჩვენებს Valgrind-ის გამონატანს. Valgrind აღმოაჩენს:<br/>არაინიციალიზებული მეხსიერების გამოყენებას;<br/>მეხსიერების წაკითხვას/ჩაწერას მისი გათავისუფლების შემდეგ;<br/>მეხსიერების წაკითხვას/ჩაწერას malloc-ით გამოყოფილი ბლოკების საზღვრებს გარეთ;<br/>სტეკის შეუსაბამო არეებზე წაკითხვას/ჩაწერას;<br/>მეხსიერების გაჟონვებს — შემთხვევებს, როდესაც malloc-ით გამოყოფილი ბლოკების მიმთითებლები სამუდამოდ იკარგება;<br/>არაინიციალიზებული ან/და მიუწვდომელი მეხსიერების გადაცემას სისტემური გამოძახებებისთვის;<br/>ფუნქცია malloc/new/new[]-ის შეუსაბამო გამოყენებას ფუნქცია free/delete/delete[]-ის მიმართ;<br/>POSIX pthread API-ს ბოროტად გამოყენების ზოგიერთ შემთხვევას.</p>
ko: <b>Valgrind</b><p>Valgrind 출력을 표시합니다. Valgrind는 다음을 감지합니다:<br/>할당하지 않은 메모리 사용,<br/>해제한 후 메모리에 읽기/쓰기,<br/>malloc으로 할당한 블록을 넘어간 읽기/쓰기,<br/>스택의 잘못된 영역 읽기/쓰기,<br/>메모리 누수 &mdash; malloc으로 할당한 블록을 가리키는 메모리 포인터가 사라짐,<br/>시스템 호출에 초기화되거나 접근할 수 없는 메모리 전달,<br/>malloc/new/new []와 free/delete/delete []의 일치하지 않는 사용,<br/>POSIX pthread API의 잘못된 사용.</p>
nl: <b>Valgrind</b><p>Toont de uitvoer van Valgrind. Valgrind ontdekt: <br/>het gebruiken van niet geïnitialiseerd geheugen <br/>het schrijven van reeds vrijgegeven geheugen <br/>het schrijven en lezen van geheugen buiten toegekende geheugenblokken <br/>het schrijven en lezen van niet van toepassing zijnde delen op de stack <br/>geheugenlekken, waarbij de pointer naar toegewezen geheugenbereiken geheel verloren ging <br/>het doorgeven van niet-geïnitialiseerd en/of niet-adresseerbaar geheugen aan systeemaanroepen <br/>onjuiste overeenkomsten tussen malloc/new/new[] versus free/delete/delete[];<br/>enkele overtredingen van de POSIX phtread-API.</p>
pl: <b>Valgrind</b><p>Pokazanie wyniku działania programu valgrind. Wykrywa on:<br/>użycia niezainicjowanej pamięci<br/>czytanie/pisanie do pamięci po jej zwolnieniu<br/>czytanie/pisanie za końcem bloków przydzielonych przez malloc<br/>czytanie/pisanie w niepoprawnych obszarach stosu<br/>wycieki pamięci -- kiedy wskaźniki na bloki przydzielanie przez malloc są tracone i nie można ich odzyskać<br/>przekazywanie niezainicjowanej i/lub nieadresowanej pamięci do wywołań systemowych<br/>mieszanie malloc/new/new [] i free/delete/delete []<br/>niektóre naruszenia API wątków POSIX.</p>
pt: <b>Valgrind</b><p>Mostra o resultado do Valgrind. O Valgrind detecta:<br/>a utilização de memória não-inicializada;<br/>a leitura/escrita de memória depois de libertada;<br/>a leitura/escrita fora dos limites dos blocos sob 'malloc'<br/>a leitura/escrita de áreas inapropriadas da pilha;<br/>fugas de memória &mdash; onde os ponteiros para os blocos sob 'malloc' são perdidos para sempre;<br/>a passagem de memória não-inicializada e/ou não-endereçada para as chamadas de sistema;<br/>o uso inadequado das chamadas malloc/new/new [] vs free/delete/delete [];<br/>alguns abusos da API 'pthread' do POSIX.</p>
pt_br: <b>Valgrind</b><p>Mostra o resultado do Valgrind. O Valgrind detecta:<br/>a utilização de memória não-inicializada;<br/>a leitura/escrita de memória depois de liberada;<br/>a leitura/escrita fora dos limites dos blocos sob 'malloc'<br/>a leitura/escrita de áreas inapropriadas da pilha;<br/>fugas de memória &mdash; onde os ponteiros para os blocos sob 'malloc' são perdidos para sempre;<br/>a passagem de memória não-inicializada e/ou não-endereçada para as chamadas de sistema;<br/>o uso inadequado das chamadas malloc/new/new [] vs free/delete/delete [];<br/>alguns abusos da API 'pthread' do POSIX.</p>
sv: <b>Valgrind</b><p>Visar utmatningen från valgrind. Valgrind detekterar:<br/>användning av oinitierat minne<br/>läs/skriv av minne efter det har frisläppts<br/>läs/skriv av olämpliga områden i stacken<br/>minnesläckor, där pekare till tilldelade block är förlorade för alltid<br/>om oinitierat och/eller inte adresserbart minne skickas till systemanrop<br/>användning av malloc/new/new[] mot free/delete/delete[] som inte passar ihop<br/>viss misshandel av POSIX programmeringsgränssnittet pthread.</p>
tr: <b>Valgrind</b><p>Valgrind uygulamasının çıktısını gösterir. Valgrind şunları algılar:<br/>başlatılmamış belleğin kullanımı;<br/>serbest bırakılmadan sonra belleğe okuma/yazma;<br/>ayrılmış blokların sonuna/sonundan okuma/yazma;<br/>yığındaki uygunsuz alanlara/alanları okuma/yazma;<br/>bellek sızıntıları &mdash; ayrılmış bloklardaki işaretçilerin tamamen kaybolması;<br/>sistem çağrılarının, başlatılmamaış ve/veya adreslenmemiş belleğin geçişi;<br/>mallac/new/new [] eşleşmeyen kullanımı vs free/delete/delete [];POSIX pthread API sinin bazı kötü davranışları.<br/></p>
uk: <b>Valgrind</b><p>Показує вивід valgrind. Valgrind виявляє:<br/>використання не ініціалізованої пам’яті<br/>операції читання/запису з вивільненої командою free пам’яті<br/>операції читання/запису за межами виділених командою malloc блоків пам’яті<br/>операції читання/запису у не призначені для цього області стека<br/>витоки пам’яті — ситуації, коли втрачено вказівники на виділені командою malloc блоки пам’яті<br/>передачу не ініціалізованої та/або не адресовної пам’яті системним викликам<br/>плутанину з використанням викликів malloc/new/new [x] та free/delete/delete [x]<br/>порушення правил використання API pthread, обумовленого POSIX.</p>
zh_cn: <b>Valgrind</b><p>显示 Valgrind 的输出。Valgrind 能检测<br/>使用未初始化的内存<br/>在内存释放后进行读/写<br/>读写超越 malloc 分配的内存块<br/>读写堆栈中不适当的区域<br/>内存泄露 &mdash; malloc 分配的指针永远丢失的问题<br/>传递未初始化和/或不可访问的内存给系统调用<br/>对 malloc/new/new [] 和 free/delete/delete [] 的使用不配对<br/>一些对 POSIX pthread API 的不当使用。</p>

source: callgrind_annotate:
fr: Exécutable « callgrind_annotate » :

source: cg_annotate:
fr: Exécutable « cg_annotate » :

source: Massif
eo: Masivo
tr: Masif
