Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Whether to report races between accessing memory and freeing memory. Enabling this option may cause DRD to run slightly slower. Notes:</p><p>Don't enable this option when using custom memory allocators that use the <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> because that would result in false positives. </p><p>Don't enable this option when using reference-counted objects because that will result in false positives, even when that code has been annotated properly with <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. See e.g. the output of the following command for an example: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
ar: <html><head/><body><p>إذا كان يبلّغ عن تزاحمات بين وصول الذاكرة وتحرير الذاكرة. تفعيل هذا الخيار قد يسبّب ل DRD أن يعمل ببطء أكثر قليلاً. ملاحظات:</p><p>لا تفعّل هذا الخيار عند استخدام مخصّصات ذاكرة مخصّصة التي تستخدم <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> لأن هذا قد يؤدّي إلى نتائج إيجابيّة خاطئة. </p><p>لا تفعّل هذا الخيار عند استخدام كائنات معدودة المرجع لأن هذا قد يؤدّي إلى نتائج إيجابيّة خاطئة، حتّى عندما عُلّقت تلك الشفرة بشكل مناسب ب <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. انظر مثلاً مخرجات الأمر التالي لمثال: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
ca: <html><head/><body><p>Si informar les situacions de competició entre l'accés a la memòria i l'alliberament de la memòria. L'activació d'aquesta opció pot provocar que el DRD s'executi més lent. Notes:</p><p>No activeu aquesta opció en usar assignadors de memòria personalitzats que usin el <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> i el <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> perquè podrien donar falsos positius. </p><p>No activeu aquesta opció en usar objectes de comptador de referència perquè podrien donar falsos positius, inclús quan el codi s'ha anotat adequadament amb <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Per exemple, vegeu la sortida de l'ordre següent: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
eo: <html><head/><body><p>Ĉu raporti vetkurojn inter aliro al memoro kaj liberigo de memoro. Ebligi ĉi tiun opcion povas kaŭzi DRD funkcii iomete pli malrapide. Notoj:</p><p>Ne ebligu ĉi tiun opcion kiam vi uzas kutimajn memor-asignilojn, kiuj uzas la <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> kaj <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> ĉar tio rezultigus falsajn pozitivojn. </p><p>Ne ebligu ĉi tiun opcion kiam vi uzas referenc-nombritajn objektojn ĉar tio rezultos en falsaj pozitivoj, eĉ kiam tiu kodo estis konvene komentita per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> kaj <span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;"> ANNOTATE_HAPPENS_AFTER</span>. Vidu ekz. la eligo de la sekva komando por ekzemplo: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
es: <html><head/><body><p>Controla si se debe informar de carreras entre el acceso a la memoria y la liberación de la memoria. La activación de esta opción puede hacer que DRD se ejecute un poco más lento. Notas:</p><p>No active esta opción cuando use asignadores de memoria personalizados que usen <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>, porque generaría falsos positivos.</p><p>No active esta opción cuando use objetos contados por referencia porque generaría falsos positivos, incluso cuando el código haya sido correctamente anotado con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Como ejemplo, consulte la salida de la siguiente orden: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
fr: <html><head/><body><p>Déterminer de signaler ou non les accès concurrents entre la mémoire en accès et en cours de libération. L'activation de cette option pourrait causer le ralentissement sensible de l'exécution de « DRD ». Remarques : </p> <p> Ne pas activer cette option lors de l'utilisation d'allocateurs de mémoire personnalisés utilisant le <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> et <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>. Cela pourrait conduire à des faux positifs.</p><p> Ne pas activer cette option lors de l'utilisation d'objets avec compteurs de références. En effet, cela pourra conduire à des faux positifs, même si le code a été annoté correctement avec <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> et <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Veuillez consulter par exemple, la sortie de la commande suivante : <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
gl: <html><head/><body><p>Se informar de carreiras entre o acceso á memoria e a liberación de memoria. Activar esta opción podería facer que DRD se execute lixeiramente máis lento. Notas:</p> <p>Non active esta opción cando use asignadores de memoria personalizados que usan <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> porque causaría falsos positivos.</p> <p>Non active esta opción cando use obxectos con contador de referencias porque causará falsos positivos, mesmo se o código afectado está anotado axeitadamente con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Consulte por exemplo a saída da seguinte orde: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს, მოხდეს თუ არა იმ დავების მოხსენება, რომლებიც წარმოიქმნება მეხსიერებაზე წვდომასა და მის გათავისუფლებას შორის. ამ პარამეტრის ჩართვამ შესაძლოა გამოიწვიოს DRD-ის მუშაობის უმნიშვნელო შენელება. შენიშვნები:</p><p>ნუ ჩართავთ ამ პარამეტრს მეხსიერების ისეთი მორგებული გამნაწილებლების გამოყენებისას, რომლებიც იყენებენ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> ბლოკებს, რადგან ეს გამოიწვევს ცრუ დადებით შედეგებს. </p><p>ნუ ჩართავთ ამ პარამეტრს ობიექტების მითითებების რაოდენობის აღრიცხვის (reference-counted) მექანიზმის გამოყენებისას, რადგან ეს გამოიწვევს ცრუ დადებით შედეგებს მაშინაც კი, როცა კოდი სწორადაა მონიშნული <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span> მაკროსებით. მაგალითისთვის იხილეთ შემდეგი ბრძანების გამონატანი: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
ko: <html><head/><body><p>메모리에 접근하고 해제하는 경쟁을 보고할지 여부입니다. 이 옵션을 사용하면 DRD가 약간 느리게 작동할 수도 있습니다. 메모:</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span>과 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>을 사용하는 사용자 정의 메모리 할당자를 사용한다면 이 옵션을 사용하지 마십시오. 위양성 결과가 나올 수도 있습니다. </p><p>참조 카운트되는 객체를 사용한다면 해당 코드가 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span>와 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>를 사용하여 표시되었다고 하더라도 이 옵션을 사용하지 마십시오. 다음 명령의 출력 결과를 예제로 참조하십시오: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
nl: <html><head/><body><p>Of er races gerapporteerd moeten worden tussen toegang tot geheugen en vrijgeven. Deze optie inschakelen kan zorgen dat DRD langzamer werkt. Opmerkingen:</p><p>Schakel deze optie niet in bij gebruik van eigen geheugentoekenners die de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> gebruiken omdat dat zou resulteren in false-positives. </p><p>Schakel deze optie niet in bij gebruik van reference-counted objects omdat dat zal resulteren in false-positives, zelfs wanneer die code juist is geannoteerd met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Zie bijv. de uitvoer van de volgende opdracht als een voorbeeld: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
pl: <html><head/><body><p>Określa czy zgłaszać gonitwy pomiędzy dostępem i zwolnieniem pamięci. Włączenie tej opcji może spowodować, że DRD będzie działał trochę wolniej. Uwaga:</p><p>Nie włączaj tej opcji, jeśli używasz własnego przydzielania pamięci, które używa <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> oraz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> bo będzie się to wiązało z fałszywymi pozytywami. </p><p>Nie włączaj tej opcji, gdy używasz obiektów z licznikiem odniesień, gdyż to także będzie skutkowało fałszywymi pozytywami, nawet w przypadku prawidłowego opisania kodu przy użyciu <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> oraz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Obejrzyj np. wynik następującego polecenia: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
pt: <html><head/><body><p>Se deve comunicar os erros de concorrência entre o acesso e a libertação da memória. A activação desta opção poderá fazer com que o DRD se execute de forma ligeiramente mais lenta. Notas:</p><p>Não active esta opção quando estiver a usar alocadores de memória personalizados que usem o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>, porque iria dar origem a 'falsos positivos'. </p><p>Não active esta opção quando estiver a usar objectos com contagem de referências, o que iria resultar em 'falsos positivos', mesmo quando este código foi devidamente anotado com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> e o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Veja p.ex. o resultado do seguinte comando para ter um exemplo: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
pt_br: <html><head/><body><p>Se deve relatar disputas entre o acesso à memória e a liberação de memória. Habilitar esta opção pode fazer com que o DRD rode um pouco mais devagar. Observações:</p><p>Não habilite esta opção ao usar alocadores de memória personalizados que utilizam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>, pois isso resultaria em falsos positivos.</p><p>Não habilite esta opção ao usar objetos contados por referência, pois isso resultará em falsos positivos, mesmo quando o código tiver sido anotado corretamente com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Veja, por exemplo, a saída do seguinte comando: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
sv: <html><head/><body><p>Om kapplöpningar mellan att åtkomst och frigörelse av minne ska rapporteras. Aktiveras alternativet kan DRD köra något långsammare. Observera:</p><p>Aktivera inte alternativet när egen minnestilldelning används, som använder <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>, eftersom det skulle leda till falska positiva värden.</p><p>Aktivera inte alternativet när referensräknade objekt används, eftersom det leder till falska positiva värden, även om koden har kommenterats på ett riktigt sätt med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Se exempelvis utmatningen från följande kommando: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
tr: <html><head/><body><p>belleğe erişim ve belleği boşaltma arasındaki yarışların raporlanıp raporlanmayacağı. Bu seçeneği etkinleştirmek DRD ' nin hafifçe daha yavaş çalışmasına sebep olabilir. Notlar:</p><p<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> gibi özel bellek ayırıcıları kullanırken bu seçeneği etkinleştirmeyin çünkü sahte olumlu sonuçlar verir.</p><p>Referans-sayımlı nesneleri kullanırken bu seçeneği etkinleştirmeyiniz, çünkü sahte olumlu sonuçlanacaktır, hatta o kod <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span> ile düzgün bir şekilde açıklanmış olsa bile. Örneğin, örnek için takip eden komutun çıktısına bakınız: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
uk: <html><head/><body><p>Визначає, чи слід звітувати про конкуренцію між доступом і вивільненням пам’яті. Вмикання такого звітування може трохи сповільнити роботу DRD. Зауваження:</p><p>Не вмикайте звітування, якщо використовуєте нетипові засоби отримання пам’яті, які використовують <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> і <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span>, оскільки це призведе до помилок під час виявлення вад.</p><p>Не використовуйте звітування, якщо використовуються об’єкти із обчисленням кількості посилань, оскільки це призведе до помилок під час обробки, навіть у коді, який належним чином анотовано за допомогою <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> та <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span>. Див., наприклад, виведення такої команди: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>.</p></body></html>
zh_cn: <html><head/><body><p>是否要报告访问内存和释放内存之间的竞争性访问。开启此选项可能会使得 DRD 运行得稍微慢一点。注意：</p><p>不要在使用启用了 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__MALLOCLIKE_BLOCK</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">VG_USERREQ__FREELIKE_BLOCK</span> 的自定义内存分配器时开启此选项，因为这会导致结果中出现假阳性。</p><p>不要在使用引用计数的对象时开启此选项，因为这也会导致假阳性，即使程序代码被正确地用 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER</span> 修饰过了。以下命令的输出就是一个例子：<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">valgrind --tool=drd --free-is-write=yes drd/tests/annotate_smart_pointer</span>。</p></body></html>

source: Report races between accessing and freeing memory
ar: بلّغ عن تزاحمات بين الوصول إلى الذاكرة و تحريرها
ca: Informa les situacions de competició entre l'accés a la memòria i l'alliberament de la memòria
eo: Raporti vetkurojn inter aliro kaj liberigo de memoro
es: Informa de carreras entre accesos y liberaciones de memoria
fr: Signaler les accès concurrents pour la mémoire en accès et en libération
gl: Informar de carreiras entre accesos e liberacións de memoria.
it: Segnala corse critiche tra l'accesso e la liberazione della memoria
ka: დავების შეტყობინება მეხსიერებასთან წვდომასა და მის გათავისუფლებას შორის
ko: 메모리 접근과 해제 경쟁 보고
nl: Races tussen toegang en vrijgeven van geheugen rapporteren
pl: Rejestruj gonitwy pomiędzy dostępem i zwalnianiem pamięci
pt: Comunicar as concorrências entre o acesso e libertação da memória
pt_br: Relatar corridas entre acesso e liberação de memória
sv: Rapportera kapplöpningar mellan att åtkomst och frigörelse av minne
tr: Önbellek erişim ve boşaltma arasındaki yarışları rapor et
uk: Звітувати про конкуренцію між доступом і вивільненням пам’яті
zh_cn: 报告访问和释放内存间的竞争性访问
