Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Show mismatched frees
ar: اعرض التحريرات غير المتطابقة
ca: Mostra les alliberacions sense emparellar
eo: Montri miskongruajn free-ojn
es: Mostrar liberaciones de memoria no emparejadas
fr: Afficher les blocs libres discordants
gl: Mostrar as liberacións non asociadas.
it: Mostra chiamate a free non corrispondenti
ka: შეუსაბამო გათავისუფლებების ჩვენება
ko: 일치하지 않는 해제 표시:
nl: Niet overeenkomende vrijgaven tonen
pl: Pokaż nietrafione zwolnienia
pt: Mostrar as libertações não correspondidas
pt_br: Mostrar os 'frees' não-correspondentes
sv: Visa ogiltigt återlämnande av minne
tr: Eşleşmeyen boşaltmaları göster
uk: Показувати невідповідні звільнення
zh_cn: 显示不匹配的释放

source: <html><head/><body><p>Controls how Memcheck handles 32-, 64-, 128- and 256-bit naturally aligned loads from addresses for which some bytes are addressable and others are not. When <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, such loads do not produce an address error. Instead, loaded bytes originating from illegal addresses are marked as uninitialised, and those corresponding to legal addresses are handled in the normal way.</p><p>When <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, loads from partially invalid addresses are treated the same as loads from completely invalid addresses: an illegal-address error is issued, and the resulting bytes are marked as initialised.</p><p>Note that code that behaves in this way is in violation of the ISO C/C++ standards, and should be considered broken. If at all possible, such code should be fixed.</p></body></html>
ar: <html><head/><body><p>يتحكّم في كيفية تعامل Memcheck مع التحميلات المحاذية طبيعيًا 32 و 64 و 128 و 256 بت من العناوين التي تكون فيها بعض البايتات قابلة للعنونة والبعض الآخر ليس كذلك. عندما يكون <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>، لا تنتج هذه التحميلات خطأ في العنوان. بدلاً من ذلك، توسم البايتات المحمّلة الناشئة من العناوين غير القانونية على أنّها غير مهيأة، وتُعالج تلك المطابقة للعناوين القانونية بالطريقة العادية.</p><p>عندما يكون <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>، تُعامل التحميلات من العناوين غير الصالحة جزئيًا بنفس طريقة التحميلات من العناوين غير الصالحة تمامًا: يُصدر خطأ في العنوان غير القانوني، وتوسم البايتات الناتجة على أنّها مهيأة.</p><p>لاحظ أن الرمز الذي يتصرّف بهذه الطريقة ينتهك معايير ISO C/C++، ويجب اعتباره معطلاً. إذا أمكن بأي شكل، يجب إصلاح مثل هذا الرمز.</p></body></html>
ca: <html><head/><body><p>Controla com el Memcheck gestiona la càrrega de 32, 64, 128 i 256 bits naturalment alineats des d'adreces per a les quals diversos bytes són adreçables i altres no. Si <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, aquestes càrregues no produeixen error d'adreça. En canvi, els bytes carregats originats des d'adreces il·legals es marquen com no inicialitzats, i aquells que corresponen a adreces legals es gestionen de la manera normal.</p><p>En cas <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">contrari</span>, les càrregues des d'adreces parcialment no vàlides es tracten com les càrregues des d'adreces completament no vàlides: s'informa d'un error d'adreça il·legal, i els bytes resultants es marquen com inicialitzats.</p><p>Cal tenir en compte que el codi que es comporta d'aquesta manera contradiu els estàndards ISO de C/C++, i s'hauria de considerar erroni. Si és possible, aquest codi s'hauria d'esmenar.</p></body></html>
eo: <html><head/><body><p>Regas kiel Memcheck pritraktas 32-, 64-, 128- kaj 256-bitajn nature vicigitajn ŝarĝojn de adresoj por kiuj kelkaj bajtoj estas adreseblaj kaj aliaj ne. Kiam <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">jes</span>, tiaj ŝarĝoj ne produktas adreseraron. Anstataŭe, ŝarĝitaj bajtoj devenantaj de kontraŭleĝaj adresoj estas markitaj kiel nekomencigitaj, kaj tiuj respondaj al laŭleĝaj adresoj estas traktitaj laŭ la normala maniero.</p><p>Kiam <span style=" font-family:'Monospace'; font- weight:600; font-style:italic;">ne</span>, ŝarĝoj de parte nevalidaj adresoj estas traktataj same kiel ŝarĝoj de tute nevalidaj adresoj: kontraŭleĝa-adreseraro estas eligita, kaj la rezultaj bajtoj estas markitaj kiel praligita.</p><p>Rimarku, ke kodo, kiu kondutas tiamaniere, malobservas la normojn ISO C/C++, kaj devus esti konsiderata rompita. Se entute eblas, tia kodo estu riparita.</p></body></html>
es: <html><head/><body><p>Controla cómo maneja Memcheck las cargas alineadas de forma natural a 32, 64, 128 y 256 bits de las direcciones en las que algunos bytes son direccionables y otros no. Cuando es <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">sí</span>, estas cargas no producen un error de dirección. En lugar de ello, los bytes cargados que tienen su origen en direcciones ilegales se marcan como no inicializados, mientras que los que corresponden a direcciones legales se manejan de modo normal.</p><p>Cuando es <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, las cargas de direcciones parcialmente no válidas se tratan de forma idéntica a las cargas de direcciones totalmente no válidas: se emite un error de dirección ilegal y los bytes resultantes se marcan como no inicializados.</p><p>Tenga en cuenta que el código que se comporta de esta manera viola el estándar ISO C/C++ y se debería considerar incorrecto. En la medida de lo posible, se debería corregir dicho código.</p></body></html>
fr: <html><head/><body><p>Contrôle comment Memcheck gère les chargements classiquement alignés sur des frontières en 32-, 64-, 128- et 256-bits à partir d'adresses pour lesquels certains octets sont adressables et d'autres non. Avec l'option <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, de tels chargements ne génèrent pas d'erreur d'adressage. A la place, les origines des octets chargés à partir d'adresses illégales sont marqués comme non initialisés. Ceux, correspondant à des adresses autorisés sont gérés selon la façon normale.</p><p>Quand l'option est <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, les chargements à partir d'adresses non valables sont traités comme les chargements venant d'adresses totalement illégales : une erreur « Adresse non valable » est générée et les octets concernés sont marqués comme initialisés.</p><p> Veuillez noter que le code se comportant de cette façon est en violation des standards « ISO C/C++ » et devrait être considéré comme erroné. Si possible, un tel code devrait être corrigé. </p></body></html>
gl: <html><head/><body><p>Control a forma que ten Memcheck de xestionar as cargas aliñadas de maneira natural de 32, 64, 128 e 256 bits de enderezos para os que se pode acceder por enderezo a algúns bytes e a outros non. Cando o seu valor é <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">si</span>, esas cargas non producen un error de enderezo, senón que os bytes cargados que proveñen de enderezos inaceptábeis se marcan como non inicializados, e os que veñen de enderezos aceptábeis xestiónanse de maneira normal.</p><p>Cando o seu valor é <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">non</span>, as cargas desde enderezos parcialmente incorrectos trátanse igual que as cargas desde enderezos completamente incorrectos: emítese un erro de enderezo inaceptábel, e os bytes correspondentes márcanse como inicializados.</p> <p>Teña en conta que o código que se comporta deste xeito está en violación dos estándares ISO de C e C++, e debería considerarse roto. Calquera código nesta situación debería aquelarse, se é posíbel.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, თუ როგორ მართავს Memcheck 32, 64, 128 და 256 ბიტიან ბუნებრივად გასწორებულ (naturally aligned) ჩატვირთვებს იმ მისამართებიდან, რომელთა ზოგიერთი ბაიტი მისაწვდომია, ხოლო სხვები — არა. როდესაც არჩეულია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, ასეთი ჩატვირთვები არ იწვევს მისამართის შეცდომას. ამის ნაცვლად, არალეგალური მისამართებიდან წამოღებული ბაიტები ინიშნება როგორც არაინიციალიზებული, ხოლო ლეგალური მისამართების შესაბამისი ბაიტები მუშავდება ჩვეულებრივი წესით.</p><p>როდესაც არჩეულია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, ნაწილობრივ არავალიდური მისამართებიდან ჩატვირთვა განიხილება ისევე, როგორც სრულად არავალიდური მისამართებიდან: გაიცემა არალეგალური მისამართის შეცდომა, ხოლო მიღებული ბაიტები ინიშნება როგორც ინიციალიზებული.</p><p>გაითვალისწინეთ, რომ კოდი, რომელიც ასე იქცევა, არღვევს ISO C/C++ სტანდარტებს და უნდა ჩაითვალოს დაზიანებულად. თუ ეს შესაძლებელია, ასეთი კოდი უნდა გამოსწორდეს.</p></body></html>
ko: <html><head/><body><p>Memcheck에서의 일부 바이트는 주소를 지정할 수 있고 일부 바이트는 주소를 지정할 수 없는 주소에서의 32, 64, 128, 256비트 자연 정렬된 로드 처리 방식을 제어합니다. 이 옵션을 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>로 설정하면 해당 로드는 주소 오류를 발생시키지 않습니다. 그 대신 잘못된 주소에서 바이트를 로드하는 것을 초기화되지 않은 것으로 표시하며, 올바른 주소에서 바이트를 로드하는 것은 일반적인 방식으로 처리합니다.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>로 설정하면 부분적으로 잘못된 주소에서 바이트를 로드하는 것을 완전히 잘못된 주소에서 바이트를 로드하는 것과 동일하게 취급합니다. 잘못된 주소 오류가 발생하며 해당 바이트는 초기화된 것으로 표시합니다.</p><p>이렇게 작동하는 코드는 ISO C/C++ 표준을 위반하며 잘못된 것으로 간주해야 합니다. 가능하다면 해당 코드를 수정하십시오.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in hoe Memcheck omgaat met 32-, 64-, 128- en 256-bit naturally aligned loads van adressen waar enkele bytes adresseerbaar zijn en andere dat niet zijn. Bij <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, produceren zulke loads geen adres-fout. In plaats daarvan worden geladen bytes die van illegale adressen komen als uninitialised gemarkeerd, en die van legale adressen komen, normaal behandelt.</p><p>Bij <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, worden loads van gedeeltelijk illegale adressen hetzelfde behandelt als loads van compleet illegale adressen: u krijgt een foutmelding over een illegale-adres, en de resulterende bytes worden als initialised gemarkeerd.</p><p>Merk op dat code dat zich zo gedraagt, zich niet volgens de ISO C/C++ standaarden gedraagt, en als niet goed functionerend beschouwd moet worden . Als het mogelijk is, dan zou dergelijke code verbeterd moeten worden.</p></body></html>
pl: <html><head/><body><p>Określa sposób w jaki Memcheck obsługuje 32-, 64-, 128- and 256-bitowe naturalnie wyrównane wczytywania z adresów, dla których część bajtów jest adresowalna, a część nie. Gdy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, to takie wczytywania nie dają błędu pamięci. Zamiast tego, wczytane bajty z nielegalnych adresów są oznaczane jako niezainicjowane a te z legalnych adresów są obsługiwane zwyczajnie.</p><p>Gdy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, wczytywanie z częściowo nieprawidłowych adresów jest traktowane tak samo jak wczytywanie z całkowicie nieprawidłowych adresów: wyświetlany jest błąd nieprawidłowego adresu, a bajty wynikowe są oznaczone jako niezainicjowane.</p><p>Zauważ, że kod, który zachowauje się w ten sposób jest przeciwko standardom ISO C/C++ i należy go uznać za popsuty. Jeśli jest to możliwe, to kd taki należy naprawić.</p></body></html>
pt: <html><head/><body><p>Controla como é que o Memcheck lida com os carregamentos alinhados naturalmente a 32-, 64-, 128- e 256-bits, onde alguns 'bytes' podem ser endereçados e outros não. Quando for igual a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, esses carregamentos não irão provocar um erro de endereçamento. Em vez disso, os 'bytes' carregados com origem em endereços inválidos são marcados como não-inicializados, enquanto os correspondentes a endereços válidos são tratados da forma normal.</p><p>Quando for <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, os carregamentos dos endereços parcialmente inválidos são tratados da mesma forma que os carregamentos totalmente inválidos: é emitido um erro de endereço inválido, e os 'bytes' resultantes são marcados como inicializados.</p><p>Lembre-se que o código que se comporta desta forma está em violação das regras ISO do C/C++, pelo que deverá ser considerado defeituoso. Se for de todo possível, esse código deverá ser corrigido.</p></body></html>
pt_br: <html><head/><body><p>Controla como o Memcheck lida com cargas naturalmente alinhadas de 32, 64, 128 e 256 bits de endereços para os quais alguns bytes são endereçáveis ​​e outros não. Quando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">sim</span>, tais cargas não produzem um erro de endereço. Em vez disso, bytes carregados originários de endereços ilegais são marcados como não inicializados, e aqueles correspondentes a endereços legais são tratados da maneira normal.</p><p>Quando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">não</span>, cargas de endereços parcialmente inválidos são tratadas da mesma forma que cargas de endereços completamente inválidos: um erro de endereço ilegal é emitido e os bytes resultantes são marcados como inicializados.</p><p>Observe que o código que se comporta dessa maneira viola os padrões ISO C/C++ e deve ser considerado corrompido. Se possível, esse código deve ser corrigido.</p></body></html>
sv: <html><head/><body><p>Styr hur Memcheck hanterar 32-, 64-, 128-, och 256-bitars naturligt justerade läsningar från adresser där vissa byte är adresserbara och andra inte. Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span> ger inte sådana läsningar något adressfel. Istället markeras inlästa byte från illegala adresser som oinitierade, och de som motsvarar legala adresser hanteras på normalt sätt.</p><p>Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> behandlas läsningar från delvis ogiltiga adresser på samma sätt som läsningar från fullständigt ogiltiga adresser: ett illegalt adressfel genereras, och byte i resultatet markeras som initierade.</p><p>Observera att kod som beter sig på detta sätt överträder ISO C/C++ standarden, och ska anses felaktig. Om det överhuvudtaget är möjligt ska sådan kod rättas.</p></body></html>
tr: <html><head/><body><p>Memcheck'in bazı baytların adreslenebilir olduğu ve diğerlerinin adreslenemediği adreslerden gelen 32-, 64-, 128- ve 256-bit doğal olarak hizalanmış yükleri nasıl idare ettiğini kontrol eder. <span style=" font-family:'Monospace'; font-weight:600; fontstyle:italic;">yes</span> olduğunda, bu tür yükler bir adres hatası oluşturmaz. Bunun yerine, geçersiz adreslerden kaynaklanan yüklenen baytlar başlatılmamış olarak işaretlenir ve yasal adreslere karşılık gelenler normal şekilde işlenir.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> olduğunda, kısmen geçersiz adreslerden gelen yüklemeler, tamamen geçersiz adreslerden gelen yüklemelerle aynı şekilde değerlendirilir: Geçersiz bir adres hatası verilir ve elde edilen baytlar başlatıldı olarak işaretlenir.</p ><p>Bu şekilde davranan kodun ISO C/C++ standartlarını ihlal ettiğini ve bozuk olarak kabul edilmesi gerektiğini unutmayın. Olanaklıysa bu kodun düzeltilmesi gerekir.</p></body></html>
uk: <html><head/><body><p>Керує тим, як Memcheck обробляє 32-, 64-, 128- іd 256-бітові природно вирівняні завантаження з адрес, для яких частина байтів є адресованою, а частина — ні. Якщо встановлено значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, такі завантаження не призводитимуть до повідомлення про помилки адресування. Замість цього, завантажені байти, які походять з некоректних адрес, позначатимуться як неініціалізовані, а ті, які походять з коректних адрес, оброблятимуться у звичайний спосіб.</p><p>Якщо встановлено значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, завантаження з частково некоректних адрес оброблятимуться так, як і завантаження із повністю некоректних адрес: буде видано повідомлення щодо помилки адресування, а байти-результати буде позначено як неініціалізовані.</p><p>Зауважте, що код, який поводиться таким чином, порушує стандарти ISO C/C++ і має вважатися помилковим. Якщо це можливо, слід виправляти такий програмний код.</p></body></html>
zh_cn: <html><head/><body><p>控制 Memcheck 在处理 32-, 64-, 128- 和 256-位自然对齐的读取时，如果有些字节可寻址而有些不行的情况下的行为。如果设置为 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>，那么这些读取不会触发一个地址错误。相反，从非法地址读取的字节会被标记为未初始化的，而那些从合法地址读取的会被正常处理。</p><p>如果设置为<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>，那么从部分非法地址的读取会被当作完全非法地址的读取：这会触发一个非法地址错误，同时读取的字节会被标记为已初始化的。</p><p>注意，有这种行为的代码违反了 ISO C/C++ 标准，应被视为有问题的代码。如果可能的话，这些代码应该被修正。</p></body></html>

source: Allow partial loads
ar: اسمح بالتحميلات الجزئية
ca: Permet càrregues parcials
eo: Permesi partajn ŝarĝojn
es: Permitir cargas parciales
fr: Autoriser des chargements partiels
gl: Permitir cargas parciais.
it: Permetti caricamenti parziali
ka: ნაწილობრივი ჩატვირთვების ჩვენება
ko: 부분 로드 허용
nl: Gedeeltelijk laden toestaan
pl: Zezwalaj na częściowe wczytania
pt: Permitir os carregamentos parciais
pt_br: Permitir cargas parciais
sv: Tillåt partiella inläsningar
tr: Parçalı yüklemelere izin ver
uk: Дозволити часткові завантаження
zh_cn: 允许部分载入
