Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Perform segment merging only after the specified number of new segments have been created. This is an advanced configuration option that allows to choose whether to minimize DRD's memory usage by choosing a low value or to let DRD run faster by choosing a slightly higher value. The optimal value for this parameter depends on the program being analyzed. The default value works well for most programs.</p></body></html>
ar: <html><head/><body><p>نفّذ دمج الأجزاء فقط بعد إنشاء العدد المحدد من الأجزاء الجديدة. هذا خيار ضبط متقدم يسمح باختيار تقليل استخدام DRD للذاكرة باختيار قيمة منخفضة أو جعل DRD يعمل بشكل أسرع باختيار قيمة أعلى قليلاً. القيمة المثلى لهذا المعامل تعتمد على البرنامج الذي يحلّل. القيمة المبدئية تعمل جيداً لمعظم البرامج.</p></body></html>
ca: <html><head/><body><p>Porta a terme la fusió de segments només quan s'hagi creat el nombre especificat de segments nous. Aquesta és una opció de configuració avançada que permet triar entre minimitzar l'ús de la DRD de la memòria seleccionant un valor baix o permetre que el DRD sigui més ràpid seleccionat un valor més alt. El valor òptim per a aquest paràmetre dependrà del programa que s'analitza. El valor predeterminat funciona bé per a la majoria de programes.</p></body></html>
eo: <html><head/><body><p>Fandu segmentojn nur post kiam la specifita nombro da novaj segmentoj estas kreita. Ĉi tio estas altnivela agorda opcio, kiu permesas elekti ĉu minimumigi la memoruzon de DRD elektante malaltan valoron aŭ lasi DRD funkcii pli rapide elektante iomete pli altan valoron. La optimuma valoro por ĉi tiu parametro dependas de la programo analizita. La defaŭlta valoro funkcias bone por plej multaj programoj.</p></body></html>
es: <html><head/><body><p>Realizar la fusión de segmentos solo cuando se haya creado el número de segmentos indicado. Se trata de una opción de configuración avanzada que permite decidir si se debe minimizar el uso de memoria de DRD escogiendo un valor bajo o dejar que DRD se ejecute más rápidamente eligiendo un valor más alto. El valor óptimo para este parámetro depende del programa que se está analizando. El valor predeterminado funciona bien con la mayoría de los programas.</p></body></html>
fr: <html><head/><body><p>Réaliser la fusion de segments uniquement après que le nombre spécifié de nouveaux segments aient été créés. Ceci est une option avancée permettant de choisir soit de minimiser l'utilisation mémoire de « DRD » par choix d'une valeur basse ou de laisser le « DRD » à s'exécuter plus rapidement en choix d'une valeur plutôt haute. La valeur optimale pour ce paramètre dépend du programme en cours d'analyse. La valeur par défaut fonctionne bien pour la plupart des programmes.</p></body></html>
gl: <html><head/><body><p>Realizar mestura de segmentos só tras crearse o número indicado de novos segmentos. Esta é unha opción de configuración avanzada que permite escoller se minimizar o uso de memoria de DRD mediante a escolla dun valor baixo ou se deixar que DRD se execute máis rápido mediante a escolla dun valor lixeiramente superior. O valor óptimo para este parámetro depende do programa que se está a analizar. O valor predeterminado é axeitado para a meirande parte dos programas.</p></body></html>
ka: <html><head/><body><p>სეგმენტების გაერთიანება მხოლოდ მას შემდეგ შესრულდება, რაც შეიქმნება ახალი სეგმენტების მითითებული რაოდენობა. ეს არის გაფართოებული კონფიგურაციის პარამეტრი, რომელიც საშუალებას გაძლევთ, აირჩიოთ DRD-ის მეხსიერების გამოყენების მინიმიზაცია დაბალი მნიშვნელობის არჩევით, ან DRD-ის უფრო სწრაფი მუშაობა ოდნავ მაღალი მნიშვნელობის არჩევით. ამ პარამეტრის ოპტიმალური მნიშვნელობა დამოკიდებულია გასაანალიზებელ პროგრამაზე. ნაგულისხმევი მნიშვნელობა კარგად მუშაობს პროგრამების უმეტესობისთვის.</p></body></html>
ko: <html><head/><body><p>지정한 개수의 세그먼트가 생성되었을 때에만 세그먼트 합치기를 실행합니다. 이 값을 작게 설정하면 DRD의 메모리 사용량을 최소화할 수 있으며, 크게 설정하면 DRD 실행 속도를 빠르게 할 수 있습니다. 이 옵션의 최적 값은 분석하는 프로그램마다 다릅니다. 기본값은 대부분 프로그램에서 잘 작동합니다.</p></body></html>
nl: <html><head/><body><p>Samenvoegen van segmenten alleen uitvoeren nadat het gespecificeerde aantal nieuwe segmenten is aangemaakt. Dit is een geavanceerde configuratie-optie die in staat stelt om te kiezen of geheugengebruik van DRD's wordt geminimaliseerd door een lage waarde te kiezen of door DRD sneller te maken door een iets hogere waarde te kiezen. De optimale waarde voor deze parameter hangt af van het programma dat wordt geanalyseerd. De standaard waarde werkt goed voor de meeste programma's.</p></body></html>
pl: <html><head/><body><p>Wykonaj scalanie segmentu tylko po utworzeniu danej liczby nowych segmentów. Jest to zaawansowana opcja, która umożliwia minimalizację wykorzystania pamięci przez DRD po wybraniu niskiej wartości lub przyspieszenie dziaania DRD po wybraniu nieznacznie wyższej wartości. Optymalna wartość tego parametru zależy od analizowanego programu. Wartość domyślna działa dobrze dla większości programów.</p></body></html>
pt: <html><head/><body><p>Efectua a reunião dos segmentos só depois de ter sido criado o número de segmentos aqui indicado. Esta é uma opção de configuração avançada que permite escolher se se pretende minimizar a utilização da memória do DRD, escolhendo um valor baixo, ou deixar o DRD executar-se mais depressa, escolhendo para tal um valor ligeiramente superior. O valor óptimo para este parâmetro depende do programa em análise. O valor por omissão funciona bem para a maioria dos programas.</p></body></html>
pt_br: <html><head/><body><p>Executa a fusão de segmentos somente após a criação do número especificado de novos segmentos. Esta é uma opção de configuração avançada que permite escolher entre minimizar o uso de memória do DRD escolhendo um valor baixo ou deixar o DRD rodar mais rápido escolhendo um valor um pouco maior. O valor ideal para este parâmetro depende do programa que está sendo analisado. O valor padrão funciona bem para a maioria dos programas.</p></body></html>
sv: <html><head/><body><p>Utför bara sammanfogning av segment efter angivet antal nya segment har skapats. Det är ett avancerat inställningsalternativ som gör det möjligt att välja om DRD:s minnesanvändning ska minimeras genom att välja ett lågt värde eller om DRD ska köra fortare genom att välja ett något större värde. Parameterns optimala värde beror på programmet som analyseras. Det förvalda värdet fungerar bra för de flesta program.</p></body></html>
tr: <html><head/><body><p>Bölütü birleştirmeyi, yalnızca belirtilen sayıda yeni kesim oluşturulduktan sonra gerçekleştirin. Bu, düşük bir değer seçerek DRD'nin bellek kullanımını en aza indirgemeyi mi yoksa DRD'nin daha yüksek bir değer seçerek daha hızlı çalışmasına izin verip vermeyeceğini seçmenize izin veren gelişmiş bir yapılandırma seçeneğidir. Bu parametrenin en uygun değeri, çözümlenen programa bağlıdır. Öntanımlı değer, çoğu program için iyi çalışır.</p></body></html>
uk: <html><head/><body><p>Виконати об’єднання сегментів лише після створення вказаної кількості нових сегментів. Це параметр розширеного налаштовування, за допомогою якого можна зробити вибір між мінімізацією споживання пам’яті DRD (малі значення параметра) і пришвидшенням роботи DRD (трохи більші за типове значення). Оптимальне значення цього параметра залежить від програми, яку ви аналізуєте. Для більшості програм достатньо скористатися типовим значенням.</p></body></html>
zh_cn: <html><head/><body><p>仅在创建指定数量的新段后进行段合并。这是一个高级配置选项，可用于选择是否要通过使用一个较低的值来最小化 DRD 的内存使用，还是要选择一个稍高的值来让 DRD 运行得更快速。该选项的最优值依赖于正在分析的程序。默认值对大多数程序工作良好。</p></body></html>

source: Common options
ar: خيارات شائعة
ca: Opcions comunes
eo: Oftaj opcioj
es: Opciones comunes
fr: Options communes
gl: Opcións comúns
it: Opzioni comuni
ka: საერთო პარამეტრები
ko: 공통 옵션
nl: Gezamenlijke opties
pl: Opcje wspólne
pt: Opções comuns
pt_br: Opções comuns
sv: Vanliga alternativ
tr: Genel Seçenekler
uk: Загальні параметри
zh_cn: 常用选项

source: <html><head/><body><p>Controls whether DRD detects data races on stack variables. Verifying stack variables is disabled by default because most programs do not share stack variables over threads.</p></body></html>
ar: <html><head/><body><p>يتحكّم فيما إذا كان DRD يكتشف تزاحمات البيانات على متغيرات المكدّس. تعطيل التحقق من متغيرات المكدّس بشكل مبدئي لأن معظم البرامج لا تتشارك متغيرات المكدّس عبر السلاسل.</p></body></html>
ca: <html><head/><body><p>Controla si el DRD detecta situacions de competició de les dades a les variables de la pila. La verificació de les variables de la pila està desactivada de manera predeterminada perquè la majoria dels programes no comparteixen les variables de la pila entre els fils.</p></body></html>
eo: <html><head/><body><p>Regas ĉu DRD detektas datumkurojn sur stakaj variabloj. Kontroli stakvariablojn estas malebligita defaŭlte ĉar plej multaj programoj ne dividas stakvariablojn super fadenoj.</p></body></html>
es: <html><head/><body><p>Controla si DRD detecta carreras de datos en las variables de la pila de llamadas. La comprobación de las variables de la pila de llamadas está desactivada por omisión porque la mayor parte de los programas no comparten las variables de la pila de llamadas entre hilos.</p></body></html>
fr: <html><head/><body><p>Contrôle si le DRD détecte des accès concurrents aux données sur les variables locales. La vérification des variables de pile est désactivée par défaut car la plupart des programmes ne partagent pas leurs variables locales entre process.</p></body></html>
gl: <html><head/><body><p>Controla se DRD detecta carreiras de datos en variábeis do montón (stack). A verificación de variábeis do montón está desactivada de maneira predeterminada porque a maioría dos programas non comparten as variábeis do montón entre fíos.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, აღმოაჩენს თუ არა DRD მონაცემთა დავას სტეკის ცვლადებზე. სტეკის ცვლადების შემოწმება ნაგულისხმევად გამორთულია, რადგან პროგრამების უმეტესობა არ იყენებს სტეკის ცვლადებს სხვადასხვა ნაკადში გაზიარებულად.</p></body></html>
ko: <html><head/><body><p>DRD에서 스택 변수 경쟁을 감지할지 설정합니다. 대부분 프로그램에서는 스택 변수를 스레드끼리 공유하지 않기 때문에 기본값으로 꺼져 있습니다.</p></body></html>
nl: <html><head/><body><p>Bestuurt of DRD gegevens-races detecteert op variabelen op de stack. Verifiëren van variabelen op de stack is standaard uitgeschakeld omdat de meeste programma's geen variabelen op de stack delen tussen threads.</p></body></html>
pl: <html><head/><body><p>Określa czy DRD wykrywa gonitwy danych na zmiennych stosu. Sprawdzane zmiennych stosu jest domyślnie wyłączone, bo większość programów nie współdzieli zmiennych stosu pomiędzy wątkami.</p></body></html>
pt: <html><head/><body><p>Controla se o DRD detecta concorrências inválidas do DRD nas variáveis da pilha. A verificação das variáveis da pilha está desactivada por omissão, porque a maioria dos programas não partilha variáveis da pilha entre tarefas.</p></body></html>
pt_br: <html><head/><body><p>Controla se o DRD detecta disputas de dados em variáveis ​​de pilha. A verificação de variáveis ​​de pilha é desabilitada por padrão porque a maioria dos programas não compartilha variáveis ​​de pilha entre threads.</p></body></html>
sv: <html><head/><body><p>Bestämmer om DRD detekterar datakapplöpningar för stackvariabler. Att verifiera stackvariabler är normalt inaktiverat, eftersom de flesta program inte delar stackvariabler mellan trådar.</p></body></html>
tr: <html><head/><body><p>DRD'nin yığın değişkenleri üzerinde veri yarışları tespit edip etmediğini denetler. Yığın değişkenlerini doğrulamak varsayılan olarak devre dışı bırakılmıştır çünkü programların iş parçacıkları üzeirndeki yığın değişkenlerini paylaşmamaktadır.</p></body></html>
uk: <html><head/><body><p>Керує тим, чи буде DRD виявляти конкуренцію за дані для стекових змінних. Типово, перевірку стекових змінних вимкнено, оскільки у більшості програм стекові змінні не надаються у спільне користування різним потокам виконання.</p></body></html>
zh_cn: <html><head/><body><p>控制 DRD 是否检测堆栈变量的数据竞争性访问。默认情况下，对堆栈变量的验证被禁用，因为大多数程序不在线程间共享堆栈变量。</p></body></html>

source: Detect data races on stack variables
ar: اكشف تزاحمات البيانات على متغيرات المكدّس
ca: Detecta situacions de competició de dades a les variables de la pila
eo: Detekti datumvetkurojn sur stakaj variabloj
es: Detectar carreras de datos en las variables de la pila de llamadas
fr: Détecter les accès concurrents sur les variables locales
gl: Detectar carreiras de datos en variábeis do montón (stack).
it: Rileva corse critiche sui dati per le variabili nello stack
ka: მონაცემთა დავის დადგენა სტეკის ცვლადებზე
ko: 스택 변수의 데이터 경쟁 감지
nl: Gegevens-races detecteren op variabelen op de stack
pl: Wykryj gonitwę danych na zmiennych stosu
pt: Detectar concorrências de dados nas variáveis da pilha
pt_br: Detectar corridas de dados em variáveis ​​de pilha
sv: Detektera datakapplöpning för stackvariabler
tr: Yığın değişkenleri üzerinde veri yarışları tespit et
uk: Виявляти конкуренцію за дані для змінних зі стека
zh_cn: 检测堆栈变量的数据竞争性访问

source: <html><head/><body><p>Whether to report only the first data race that has been detected on a memory location or all data races that have been detected on a memory location.</p></body></html>
ar: <html><head/><body><p>إذا كان يبلّغ عن تزاحم البيانات الأول فقط الذي اكتشف على موقع ذاكرة أو كل تزاحمات البيانات التي اكتشفت على موقع ذاكرة.</p></body></html>
ca: <html><head/><body><p>Si s'informa de només la primera competició de dades que es detecti a una ubicació de memòria, o bé de totes les competicions de dades que es detectin en una ubicació de memòria.</p></body></html>
eo: <html><head/><body><p>Ĉu raporti nur la unuan datumvetkuron kiu estis detektita sur memorloko aŭ ĉiujn datumvetkurojn kiuj estis detektitaj sur memorloko.</p></body> </html>
es: <html><head/><body><p>Indica si solo se debe informar de la primera carrera de datos que se haya detectado en una posición de memoria o de todas las que se encuentren.</p></body></html>
fr: <html><head/><body><p>Soit ne signaler que le premier accès concurrent détecté sur les données ou tous les accès concurrents sur un emplacement mémoire.</p></body></html>
gl: <html><head/><body><p>Se informar só da primeira carreira de datos que se detecte nun lugar da memoria ou de todas as carreiras de datos que se detectasen nun mesmo lugar de memoria.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს, მოხდეს მხოლოდ პირველი აღმოჩენილი მონაცემთა დავის მოხსენება მეხსიერების მისამართზე, თუ მეხსიერების ამ მისამართზე აღმოჩენილი ყველა მონაცემთა დავისა.</p></body></html>
ko: <html><head/><body><p>메모리 위치에서 발생한 첫 번째 데이터 경쟁만을 보고할지, 메모리 위치에서 발생한 모든 데이터 경쟁을 보고할지 설정합니다.</p></body></html>
nl: <html><head/><body><p>Of alleen de eerste gegevens-race, die is gedetecteerd op een geheugenlocatie, wordt gerapporteerd of alle gegevens-races die zijn gedetecteerd op een geheugenlocatie.</p></body></html>
pl: <html><head/><body><p>Określa czy zgłosić tylko pierwszą gonitwę danych, która została wykryta w pamięci lub wszystkie gonitwy danych, które zostały wykryte w pamięci.</p></body></html>
pt: <html><head/><body><p>Se deve comunicar apenas a primeira concorrência de dados detectada numa dada localização de memória ou todas as concorrências detectadas nas mesmas circunstâncias.</p></body></html>
pt_br: <html><head/><body><p>Se deve ser relatado apenas a primeira corrida de dados que foi detectada em um local de memória ou todas as corridas de dados que foram detectadas em um local de memória.</p></body></html>
sv: <html><head/><body><p>Om bara den första datakapplöpningen som detekteras för en minnesposition ska rapporteras, eller alla datakapplöpningar som har detekteras för en minnesposition.</p></body></html>
tr: <html><head/><body><p>Bir bellek konumu üzerinde yalnızca tespit edilen ilk veri yarışının mı yoksa tespit edilen tüm veri yarışlarının mı rapor edilip edilmeyeceği.</p></body></html>
uk: <html><head/><body><p>Визначає, слід звітувати лише про першу конкуренцію за дані, яку було виявлено для місця у пам’яті, чи про усі конкуренції за дані, які було виявлено для місця у пам’яті.</p></body></html>
zh_cn: <html><head/><body><p>是否要仅报告在某个内存位置检测到的第一个数据竞争性访问，还是要报告所有在此位置检测到的数据竞争性访问。</p></body></html>

source: Report only the first data race
ar: بلّغ عن أول تزاحم بيانات فقط
ca: Informa només de la primera competició de dades
eo: Raporti nur la unuan datuman vetkuron
es: Informar solo de la primera carrera de datos
fr: Ne signaler que le premier accès concurrent de données
gl: Informar só da primeira carreira de datos.
it: Segnala solo la prima corsa critica sui dati
ka: მხოლოდ პირველი მონაცემის დავის შეტყობინება
ko: 첫 데이터 경쟁만 보고
nl: Alleen de eerste gegevens-race rapporteren
pl: Zgłaszaj tylko pierwszą gonitwę danych
pt: Comunicar apenas a primeira concorrência de dados
pt_br: Relatar apenas a primeira corrida de dados
sv: Rapportera bara första datakapplöpningen
tr: Yalnızca ilk veri yarışını rapor et
uk: Звітувати лише про першу конкуренцію за дані
zh_cn: 仅报告第一次数据竞争性访问
