Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Show conflicting segments in race reports. Since this information can help to find the cause of a data race, this option is enabled by default. Disabling this option makes the output of DRD more compact.</p></body></html>
ar: <html><head/><body><p>اعرض الأجزاء المتضاربة في تقارير التزاحم. بما أن هذه المعلومات قد تساعد في إيجاد سبب تزاحم بيانات، يفعّل هذا الخيار بشكل مبدئي. تعطيل هذا الخيار يجعل مخرجات DRD أكثر إيجازاً.</p></body></html>
ca: <html><head/><body><p>Mostra els segments conflictius en els informes de competició. Com que aquesta informació pot ajudar a trobar la causa d'una situació de competició de dades, aquesta opció està activada de manera predeterminada. La desactivació d'aquesta opció fa més compacta la sortida del DRD.</p></body></html>
eo: <html><head/><body><p>Montri konfliktajn segmentojn en rasraportoj. Ĉar ĉi tiu informo povas helpi trovi la kaŭzon de datumvetkuro, ĉi tiu opcio estas ebligita defaŭlte. Malebligante ĉi tiun opcion, la eligo de DRD estas pli kompakta.</p></body></html>
es: <html><head/><body><p>Mostrar segmentos en conflicto en los informes de carreras. Esta opción está activada por omisión porque dicha información puede ayudar a encontrar la causa de una carrera de datos. Si se desactiva esta opción, la salida de DRD será más compacta.</p></body></html>
fr: <html><head/><body><p>Affiche les segments en conflit dans les rapports d'excursion. Puisque cette information peut aider à trouver la cause d'une excursion de données, cette option est activée par défaut. La désactivation de cette option rend la sortie de « DRD » plus synthétique.</p></body></html>
gl: <html><head/><body><p>Mostrar segmentos conflitivos en informes de carreiras. Dado que esta información pode axudar a atopar a causa dunha carreira de datos, esta opción está activada de maneira predeterminada. Desactivar esta opción fai máis compacta a saída de DRD.</p></body></html>
ka: <html><head/><body><p>დავის ანგარიშებში კონფლიქტური სეგმენტების ჩვენება. ვინაიდან ამ ინფორმაციას შეუძლია დაგეხმაროთ მონაცემთა დავის მიზეზის პოვნაში, ეს პარამეტრი ნაგულისხმევად ჩართულია. ამ პარამეტრის გამორთვა DRD-ის გამონატანს უფრო კომპაქტურს ხდის.</p></body></html>
ko: <html><head/><body><p>경쟁 보고에서 충돌하는 세그먼트를 표시합니다. 이 정보는 데이터 경쟁의 원인을 찾는 데 유용하므로 기본값으로 활성화되어 있습니다. 이 옵션을 사용하지 않으면 DRD 출력이 더 간소화됩니다.</p></body></html>
nl: <html><head/><body><p>Conflicterende segmenten in race-rapporten tonen. Omdat deze informatie kan helpen bij het vinden van de oorzaak van een gegevens-race, deze optie is standaard ingeschakeld. Deze optie uitschakelen maakt de uitvoer van DRD compacter.</p></body></html>
pl: <html><head/><body><p>Pokaż sprzeczne segmenty w dzienniku gonitw. Opcja ta jest włączona domyślnie, bo może pomóc znaleźć przyczynę gonitwy danych. Wyłączenie tej opcji czyni dziennik DRD bardziej zwięzłym.</p></body></html>
pt: <html><head/><body><p>Mostrar os segmentos em conflito nos relatórios de concorrência. Dado que esta informação o pode ajudar a descobrir a causa de um erro de concorrência de dados, esta opção está activada por omissão. A desactivação desta opção torna os resultados do DRD mais compactos.</p></body></html>
pt_br: <html><head/><body><p>Mostrar segmentos conflitantes em relatórios de corrida. Como essas informações podem ajudar a encontrar a causa de uma corrida de dados, esta opção está habilitada por padrão. Desabilitar esta opção torna a saída do DRD mais compacta.</p></body></html>
sv: <html><head/><body><p>Visa segment med konflikter i kapplöpningsrapporter. Eftersom informationen kan hjälpa till att hitta orsaken till en datakapplöpning, är alternativet normalt aktiverat. Att inaktivera alternativet gör utmatningen från DRD kompaktare.</p></body></html>
tr: <html><head/><body><p>Çakışan bölütleri yarış raporlarında göster. Bu bilgi, bir veri yarışının nedenini bulmaya yardım edebildiğinden, bu seçenek öntanımlı olarak etkindir. Bu seçeneğin devre dışı bırakılması, DRD'nin çıktısını daha sıkışık hale getirir.</p></body></html>
uk: <html><head/><body><p>Показувати конфліктні сегменти у звітах щодо конкуренції. Оскільки ці дані можуть допомогти у виявленні причини конкуренції за дані, цей параметр використовується типово. Вимикання цього параметра може зробити дані, які буде виведено DRD, компактнішими.</p></body></html>
zh_cn: <html><head/><body><p>在竞争性访问报告中显示冲突的段。因为此信息可能帮助您找到数据竞争性访问的原因，该选项默认开启。禁止该选项能让 DRD 的输出更紧凑。</p></body></html>

source: Show conflicting segments
ar: اعرض الأجزاء المتضاربة
ca: Mostra els segments conflictius
eo: Montri konfliktajn segmentojn
es: Mostrar los segmentos conflictivos
fr: Afficher les segments en conflit
gl: Mostrar os segmentos conflitivos.
it: Mostra segmenti in conflitto
ka: კონფლიქტური სეგმენტების ჩვენება
ko: 충돌하는 세그먼트 표시
nl: Conflicterende segmenten tonen
pl: Pokaż sprzeczne segmenty
pt: Mostrar os segmentos em conflito
pt_br: Mostrar segmentos conflitantes
sv: Visa segment med konflikter
tr: Çakışan bölütleri göster
uk: Показати конфліктні сегменти
zh_cn: 显示冲突段

source: <html><head/><body><p>Print stack usage at thread exit time. When a program creates a large number of threads it becomes important to limit the amount of virtual memory allocated for thread stacks. This option makes it possible to observe how much stack memory has been used by each thread of the client program.</p><p>Note: the DRD tool itself allocates some temporary data on the client thread stack. The space necessary for this temporary data must be allocated by the client program when it allocates stack memory, but is not included in stack usage reported by DRD.</p></body></html>
ar: <html><head/><body><p>اطبع استخدام المكدّس في وقت خروج السلسلة. عندما ينشئ برنامج عدداً كبيراً من السلاسل يصبح من المهم تحديد كمية الذاكرة الافتراضية المخصصة لمكدّسات السلاسل. يجعل هذا الخيار من الممكن ملاحظة مقدار ذاكرة المكدّس التي استخدمتها كل سلسلة من برنامج العميل.</p><p>ملاحظة: أداة DRD نفسها تخصص بعض البيانات المؤقتة على مكدّس سلسلة العميل. يجب أن يخصّص برنامج العميل المساحة اللازمة لهذه البيانات المؤقتة عندما يخصّص ذاكرة المكدّس، و لكن لا تضمّن في استخدام المكدّس الذي يبلّغ عنه DRD.</p></body></html>
ca: <html><head/><body><p>Imprimeix l'ús de la pila en el moment de sortida del fil. Quan un programa crea un nombre gran de fils, esdevé important limitar la quantitat de memòria virtual assignada a les piles dels fils. Aquesta opció fa possible observar la quantitat de memòria de la pila s'ha usat en cada fil del programa client.</p><p>Nota: La mateixa eina DRD assigna diverses dades temporals a la pila de fils del client. L'espai necessari per a aquestes dades temporals cal que sigui assignada pel programa client quan assigna memòria de la pila, però no s'inclou a l'ús de la pila informat pel DRD.</p></body></html>
eo: <html><head/><body><p>Presi stak-uzon ĉe fadena eliro. Kiam programo kreas grandan nombron da fadenoj iĝas grave limigi la kvanton de virtuala memoro asignita por fadenaj stakoj. Ĉi tiu opcio ebligas observi kiom da stakmemoro estis uzata de ĉiu fadeno de la klienta programo.</p><p>Noto: la DRD-ilo mem asignas iujn provizorajn datumojn sur la klienta fadenstako. La spaco necesa por ĉi tiuj provizoraj datumoj devas esti asignita de la klienta programo kiam ĝi asignas stakan memoron, sed ne estas inkluzivita en stak-uzado raportita de DRD.</p></body></html>
es: <html><head/><body><p>Mostrar el uso de la pila de llamadas cuando se sale de un hilo. Cuando un programa crea un gran número de hilos, es importante limitar la cantidad de memoria virtual asignada para las pilas de llamadas de los hilos. Esta opción hace posible que se pueda observar cuánta cantidad de memoria de pilas de llamadas ha usado cada hilo del programa cliente.</p><p>Nota: la herramienta DRD asigna para sí misma algunos datos temporales en la pila de llamadas del hilo cliente. El espacio necesario para estos datos temporales lo debe asignar el programa cliente cuando asigna memoria de pila de llamadas, aunque no se incluye en la información sobre el uso de pilas de llamadas que devuelve DRD.</p></body></html>
fr: <html><head/><body><p>Affiche l'utilisation de la pile au moment de la fin du processus. Quand un programme créé un nombre important de processus, il est important de réduire la quantité de mémoire virtuelle allouée aux piles de processus. Cette option rend possible l'observation de la quantité de mémoire de pile utilisée par chaque processus du programme principal.</p><p>Remarque : l'outil « DRD » lui même alloue certaines données temporaires dans la pile du processus client. L'espace nécessaire pour ces données temporaires doit être alloué par le programme client lors de l'allocation de l'espace de pile. Mais, il n'est pas inclus dans l'utilisation de piles, retournée par l'outil « DRD ».</p></body></html>
gl: <html><head/><body><p>Imprimir o uso do montón (stack) no momento de saída dun fío. Cando un programa crea un gran número de fíos vólvese importante limitar a cantidade de memoria virtual asignada para as moreas de fíos. Esta opción fai posíbel observar a cantidade de memoria de montón que usou cada fío do programa cliente.</p> <p>Nota: a propia ferramenta DRD asigna algúns datos temporais no montón de fíos do cliente. O espazo necesario para estes datos temporais debe asignalo o programa cliente cando asigna a memoria do montón, pero non está incluído no uso do montón do que informa DRD.</p></body></html>
ka: <html><head/><body><p>ნაკადის მუშაობის დასრულებისას სტეკის გამოყენების შესახებ ინფორმაციის გამოტანა. როდესაც პროგრამა ქმნის ნაკადების დიდ რაოდენობას, მნიშვნელოვანი ხდება ნაკადების სტეკებისთვის გამოყოფილი ვირტუალური მეხსიერების რაოდენობის შეზღუდვა. ეს პარამეტრი შესაძლებელს ხდის იმის დაკვირვებას, თუ რამდენი სტეკის მეხსიერება იქნა გამოყენებული კლიენტი პროგრამის თითოეული ნაკადის მიერ.</p><p>შენიშვნა: DRD ინსტრუმენტი თავად გამოყოფს გარკვეულ დროებით მონაცემებს კლიენტი ნაკადის სტეკზე. ამ დროებითი მონაცემებისთვის საჭირო სივრცე კლიენტმა პროგრამამ უნდა გამოყოს სტეკის მეხსიერების გამოყოფისას, თუმცა იგი არ არის გათვალისწინებული DRD-ის მიერ მოხსენებულ სტეკის გამოყენების მაჩვენებელში.</p></body></html>
ko: <html><head/><body><p>끝낼 때 스레드의 스택 사용량을 표시합니다. 프로그램에서 스레드를 대량으로 생성했다면 스레드 스택에 할당한 가상 메모리를 제한하는 것이 중요해집니다. 이 옵션을 사용하면 클라이언트 프로그램의 각각 스레드에서 얼마만큼의 메모리를 사용했는지를 관찰할 수 있습니다.</p><p>메모: DRD 도구 자체적으로 클라이언트 스레드 스택에 임시 데이터 메모리를 할당합니다. 임시 데이터에 필요한 메모리 공간은 클라이언트 프로그램에서 스택 메모리를 할당할 때 같이 할당해야 하지만, DRD에서 보고한 스택 사용량에는 포함되지 않습니다.</p></body></html>
pl: <html><head/><body><p>Pokaż wykorzystanie stosu w chwili zakończenia wątku. Gdy program tworzy dużą liczbę wątków, to ważnym staje się ograniczenie ilości pamięci wirtualnej przydzielanej na stosy. Opcja ta umożliwia oglądanie ilości pamięci stosu, która jest wykorzystywana przez każdy wątek programu klienckiego.</p><p>Uwaga: narzędzie DRD samo przydziela pewne tymczasowe dane na stosie wątku klienckiego. Przestrzeń wymagana dla tych tymczasowych danych musi być przydzielana przez program kliencki w chwili przydziału pamięci stosu, lecz nie jest ona pokazywana przez DRD w wykorzystaniu stosu.</p></body></html>
pt: <html><head/><body><p>Imprime a utilização da pilha na altura da saída da tarefa. Quando um programa cria um grande conjunto de tarefas, torna-se importante limitar a quantidade de memória virtual reservada para as pilhas das tarefas. Esta opção torna possível ver quanta memória da pilha foi usada por cada tarefa do programa-cliente.</p><p>Nota: a ferramenta DRD em si aloca alguns dados temporários na pilha da tarefa-cliente. O espaço necessário para estes dados temporários precisam de ser alocados pelo programa-cliente onde ele aloca a memória da pilha, mas não está incluído no relatório de utilização da pilha do DRD.</p></body></html>
pt_br: <html><head/><body><p>Imprimir o uso da pilha no momento da saída da thread. Quando um programa cria um grande número de threads, torna-se importante limitar a quantidade de memória virtual alocada para pilhas de threads. Esta opção torna possível observar quanta memória de pilha foi usada por cada thread do programa cliente.</p><p>Observação: a própria ferramenta DRD aloca alguns dados temporários na pilha de threads do cliente. O espaço necessário para esses dados temporários deve ser alocado pelo programa cliente quando ele aloca memória de pilha, mas não é incluído no uso da pilha relatado pelo DRD.</p></body></html>
sv: <html><head/><body><p>Skriv ut stackanvändning när tråden avslutas. När ett program skapar ett stort antal trådar blir det viktigt att begränsa storlek på det virtuella minnet som tilldelas till trådarnas stackar. Alternativet gör det möjligt att observera hur mycket stackminne som har används av varje tråd i klientprogrammet.</p><p>Observera: Verktyget DRD använder själv en del tillfällig data på stacken i klientens trådar. Nödvändigt utrymme för denna tillfälliga data måste tilldelas av klientprogrammet när det tilldelar stackminne, men det ingår inte i stackanvändningen som rapporteras av DRD.</p></body></html>
tr: <html><head/><body><p>İş parçacığının çıkış saatinde yığın kullanımını yazdır. Bir program çok sayıda iş parçacığı oluşturduğunda, iş parçacığı yığınları için ayrılan sanal belleğin miktarını sınırlamak önem kazanır. Bu seçenek, istemci programının her iş parçacığı tarafından ne kadar yığın bellek kullanıldığını gözlemlemeyi mümkün kılar.</p><p>Not: DRD aracının kendisi, istemci iş parçacığı yığını üzerinde bazı geçici veriler ayırır. Bu geçici veri için gerekli alan, yığın belleğini tahsis ettiğinde, ancak DRD tarafından bildirilen yığın kullanımına dahil edilmediğinde, istemci programı tarafından tahsis edilmek zorundadır.</p></body></html>
uk: <html><head/><body><p>Виводити дані щодо використання стека на час виходу із потоку виконання. Якщо програма створює багато потоків, виникає потреба у обмеженні об’єму віртуальної пам’яті, яка отримується для стеків потоків. За допомогою цього параметрам можна спостерігати за тим, скільки пам’яті у стеку було використано кожним потоком виконання клієнтської програми.</p><p>Зауваження: засоби DRD самі розміщують частину тимчасових даних у стеку клієнтського потоку виконання. Ділянку пам’яті, яка потрібна для цих тимчасових даних, буде отримано клієнтською програмою, коли вона розміщує дані у пам’яті стека, але не буде включено до звіту щодо використання стека DRD.</p></body></html>
zh_cn: <html><head/><body><p>在线程退出时显示堆栈用量。如果一个程序创建了大量的线程，那么限制分配给线程堆栈的虚拟内存的量就显得很重要。该选项让您可以观察到客户程序每个线程使用了多少堆栈内存。</p><p>注意：DRD 工具本身会在客户线程堆栈上分配一些临时数据。客户程序分配堆栈内存时必须也给这些临时数据分配空间，但是它们不会被计入 DRD 显示的堆栈使用报告中。</p></body></html>

source: Show stack usage
ar: اعرض استخدام المكدّس
ca: Mostra l'ús de la pila
eo: Montri uzadon de stako
es: Mostrar uso de la pila de llamadas
fr: Afficher l'usage de la pile
gl: Mostrar o uso do montón (stack).
it: Mostra l'uso dello stack
ka: სტეკის გამოყენების ჩვენება
ko: 스택 사용량 표시
nl: Gebruik van stack tonen
pl: Pokaż wykorzystanie stosu
pt: Mostrar a utilização da pilha
pt_br: Mostrar uso da pilha
sv: Visa stackanvändning
tr: Yığın kullanımını göster
uk: Показати використання стека
zh_cn: 显示堆栈使用情况
