Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Enables or disables collection of branch instruction and misprediction counts. By default this is disabled as it slows Cachegrind down by approximately 25%. Note that you cannot specify <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> together, as that would leave Cachegrind with no information to collect.</p></body></html>
ar: <html><head/><body><p>يفعّل أو يعطّل جمع تعليمة التّفرّع وعدد التّوقّعات الخاطئة. بشكل مبدئي يكون هذا معطلاً لأنه يبطّئ Cachegrind بنسبة 25% تقريباً. لاحظ أنه لا يمكنك تحديد <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> معاً، لأن هذا يترك Cachegrind بلا معلومات لجمعها.</p></body></html>
ca: <html><head/><body><p>Activa o desactiva la recol·lecció del comptador d'instruccions de branca i manques de predicció. De manera predeterminada, això està desactivat, ja que alenteix el Cachegrind en un 25% aproximadament. Cal tenir en compte que no podeu especificar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> conjuntament, ja que podria deixar el Cachegrind sense informació a recol·lectar.</p></body></html>
eo: <html><head/><body><p>Ebligas aŭ malŝaltas kolekton de branĉaj instrukcioj kaj misantaŭdirkalkulojn. Defaŭlte ĉi tio estas malŝaltita ĉar ĝi malrapidigas Cachegrind je proksimume 25%. Notu, ke vi ne povas specifi <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=ne</span> kaj <span style= " font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> kune, ĉar tio lasus Cachegrind sen informoj por kolekti.</p></body></html>
es: <html><head/><body><p>Activa o desactiva la recopilación de contadores de instrucciones de salto y de fallos de predicción. Por omisión, está desactivada, ya que ralentiza el rendimiento de Cachegrind un 25%. Tenga en cuenta que no puede usar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> a la vez, ya que esto haría que Cachegrind no tuviera información que recopilar.</p></body></html>
fr: <html><head/><body><p>Active ou désactive le comptage des instructions de branchement et les compteurs d'erreurs de prédiction. Par défaut, celui-ci est désactivé, ce qui ralentit Cachegrind d'environ 25 %. Veuillez noter que vous ne pouvez pas spécifier <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> ensemble, puisque vous ne pouvez pas laisser Cachegrind sans information sur quoi collecter.</p></body></html>
gl: <html><head/><body><p>Activa ou desactiva a recollida de instrucións de ramas e o contador de predicións erradas. Isto está desactivado de maneira predeterminada porque lentifica Cachegrind aproximadamente un 25%. Teña en conta que non pode indicar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> á vez, posto que Cachegrind quedaría sen información que recoller.</p></body></html>
ka: <html><head/><body><p>რთავს ან თიშავს დატოტვის ინსტრუქციებისა და არასწორი პროგნოზების რაოდენობის შეგროვებას. ნაგულისხმევად ეს გამორთულია, რადგან იგი Cachegrind-ს დაახლოებით 25%-ით ანელებს. გაითვალისწინეთ, რომ თქვენ არ შეგიძლიათ მიუთითოთ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> ერთად, რადგან ამ შემთხვევაში Cachegrind-ს შესაგროვებელი ინფორმაცია აღარ დარჩება.</p></body></html>
ko: <html><head/><body><p>분기 명령 개수와 잘못 예측한 분기 횟수 집계를 활성화하거나 비활성화합니다. Cachegrind 성능을 약 25% 감소시키기 때문에 기본값으로 이 설정은 비활성화되어 있습니다. Cachegrind에서 수집할 정보가 없어지기 때문에 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> 옵션과 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> 옵션을 동시에 지정할 수는 없습니다.</p></body></html>
nl: <html><head/><body><p>In- of uitschakelen van verzamelen van branch-instructies en aantallen missen in voorspellingen. Dit is standaard uitgeschakeld omdat het Cachegrind vertraagt met ongeveer 25%. Merk op dat u niet samen kunt specificeren <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span>, omdat dat Cachegrind zou achterlaten zonder te verzamelen informatie.</p></body></html>
pl: <html><head/><body><p>Włącza lub wyłącza zbieranie instrukcji gałęzi i zlicza źle przewidziane gałęzie. Domyślnie jest to wyłączone, gdyż spowalnia Cachegrinda o około 25%. Zauważ, że nie możesz jednocześnie podać <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> oraz <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span>, gdyż to pozostawiłoby Cachegrind bez informacji do zbierania.</p></body></html>
pt: <html><head/><body><p>Activa ou desactiva a recolha de instruções de salto e quantidades de más previsões. Por omissão, esta opção está desactivada, porque atrasa o Cachegrind em cerca de 25%. Lembre-se que não pode indicar as opções <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> em conjunto, dado que isso iria deixar o Cachegrind sem informações para recolher.</p></body></html>
pt_br: <html><head/><body><p>Ativa ou desativa a coleta de instruções de desvio e contagens de erros de previsão. Por padrão, isso está desativado, pois torna o Cachegrind mais lento em aproximadamente 25%. Observe que você não pode especificar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> juntos, pois isso deixaria o Cachegrind sem informações para coletar.</p></body></html>
sv: <html><head/><body><p>Aktiverar eller inaktiverar insamling av hoppinstruktioner och antal felpredikteringar. Normalt är det inaktiverat, eftersom det gör Cachegrind ungefär 25 % långsammare. Observera att det inte går att ange <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> tillsammans, eftersom det inte skulle lämna någon information för Cachegrind att samla in.</p></body></html>
tr: <html><head/><body><p>Alt grup yönergelerinin ve yanlış tahmin sayılarının toplanmasını etkinleştirir veya devre dışı bırakır. CacheGrind ' i yaklaşık olarak % 25 yavaşlattığından dolayı varsayılan olarak devre dışı bırakılmıştır. Unutmayınız ki, CacheGrind ' e toplamak için hiçbir bilgi bırakmayacağından, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span> ' yi birlikte tanımlayamazsınız,</p></body></html>
uk: <html><head/><body><p>Вмикає або вимикає збирання даних щодо кількості розгалуження інструкцій та помилкових передбачено розгалужень. Типово, таке збирання вимкнено, оскільки воно уповільнює роботу Cachegrind приблизно на 25 %. Зауважте, що не можна одночасно використовувати <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> і <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span>, оскільки це залишає Cachegrind без даних.</p></body></html>
zh_cn: <html><head/><body><p>启用或禁用对分支指令和错误预测次数的收集。默认情况下，因为这会使 Cachegrind 速度降低大约25%，这会被禁用。注意您不能同时指定 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--cache-sim=no</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--branch-sim=no</span>，因为这会使得 Cachegrind 没有需要收集的信息。</p></body></html>

source: Branch simulation
ar: محاكاة التّفرّع
ca: Simulació de la branca
eo: Simulado de branĉo
es: Simulación de salto
fr: Simulation de branchement
gl: Simulación da rama
it: Simulazione branch
ka: ბრენჩის სიმულაცია
ko: 분기 시뮬레이션
nl: Branch-simulatie
pl: Symulacja gałęzi
pt: Simulação de ramificação
pt_br: Simulação de ramificação
sv: Hoppsimulering
tr: Dal benzetimi
uk: Імітатор гілки
zh_cn: 分支模拟

source: You cannot disable both cache and branch simulation, as that would leave Cachegrind with no information to collect.
ar: لا يمكنك تعطيل كل من محاكاة الخبيئة والتّفرّع، لأن هذا يترك Cachegrind بلا معلومات لجمعها.
ca: No podeu desactivar tant la simulació al cau com a la branca, ja que això deixaria al Cachegrind sense informació per a recollir.
eo: Vi ne povas malŝalti ambaŭ kaŝmemoron kaj branĉon simuladon, ĉar tio lasus Cachegrind sen informoj por kolekti.
es: No puede desactivar la caché y la simulación de saltos simultáneamente, ya que Cachegrind no tendría información que recopilar.
fr: Vous ne pouvez pas désactiver à la fois, la simulation de cache et de branchement, ce qui laisserait Cachegrind dans information sur quoi collecter.
gl: Non pode desactivar tanto a simulación da caché como a simulación das ramas, posto que iso deixaría Cachegrind sen información que recoller.
ka: ორივეს, კეშს და შტოს სიმულაციას ვერ გამორთავთ, რადგან ეს Cachegrind-ს მოსაგროვებელი ინფორმაციის გარეშე დატოვებს.
ko: Cachegrind에서 수집할 정보가 없어지기 때문에 캐시와 분기 시뮬레이션을 동시에 비활성화할 수는 없습니다.
nl: U kunt niet zowel cache- als branchsimulatie uitschakelen, omdat dat Cachegrind zonder informatie om te verzamelen achterlaat.
pl: Nie możesz jednocześnie odznaczyć pamięci podręcznej i symulacji gałęzi, gdyż to pozostawiłoby Cachegrind bez informacji do zbierania.
pt: Não pode desactivar em conjunto as simulações de 'cache' e ramificações, dado que iria deixar o Cachegrind sem informações para recolher.
pt_br: Você não pode desabilitar o cache e a simulação de ramificação, pois isso deixaria o Cachegrind sem informações para coletar.
sv: Det går inte att inaktivera både cache- och hoppsimulering, eftersom det skulle inte lämna någon information för Cachegrind att samla in.
tr: CacheGrind ' e toplamak için hiçbir bilgi bırakmayacağından, aynı anda hem alt grup simulasyonunu hem de ön belleği devre dışı bırakamazsınız.
uk: Не можна одночасно вимикати імітацію кешу та розгалуження, оскільки це не дасть Cachegrind зібрати потрібні дані.
zh_cn: 您不能同时禁用缓存和分支模拟，因为这将使得 Cachegrind 没有需要收集的信息。

source: Extra parameters:
ar: المعاملات الإضافيّة:
ca: Paràmetres addicionals:
eo: Kromaj parametroj:
es: Parámetros adicionales:
fr: Paramètres supplémentaires :
gl: Parámetros adicionais:
it: Parametri aggiuntivi:
ka: დამატებითი პარამეტრები:
ko: 추가 인자:
pl: Dodatkowe parametry:
pt: Parâmetros extra:
pt_br: Parâmetros extras:
sv: Extra väljare:
tr: Ek Parametreler:
uk: Додаткові параметри:
zh_cn: 额外参数:

source: cg_annotate parameters:
ar: معاملات cg_annotate:
ca: Paràmetres de «cg_annotate»:
eo: cg_annotate parametroj:
es: Parámetros de cg_annotate:
fr: Paramètres de « cg_annotate » :
gl: Parámetros para cg_annotate:
it: Parametri di cg_annotate:
ka: cg_annotate-ის პარამეტრები:
ko: cg_annotate 인자:
pl: paramtery cg_annotate:
pt: Parâmetros do 'cg_annotate':
pt_br: Parâmetros do cg_annotate:
sv: Väljare för cg_annotate:
tr: cg_annotate parametreleri:
uk: Параметри cg_annotate:
zh_cn: cg_annotate 参数：

source: Function
ar: الدالة
ca: Funció
eo: Funkcio
es: Función
fr: Fonction
gl: Función
it: Funzione
ka: ფუნქცია
ko: 함수
nl: Functie
pl: Funkcja
pt: Função
pt_br: Função
sv: Funktion
tr: Fonksiyon
uk: Функція
zh_cn: 函数

source: Cachegrind (Cache and Branch-Prediction Profiler)
ar: Cachegrind (محلّل أداء الخبيئة وتوقع التّفرّع)
ca: Cachegrind (Analitzador de rendiment de la memòria cau i de predicció de branques)
eo: Cachegrind (Kaŝmemoro kaj Branch-Prediction Profiler)
es: Cachegrind (analizador de rendimiento de la caché y predicción de saltos)
fr: Cachegrind (Profilage du cache et de prédiction de branchement)
gl: Cachegrind (analizador de rendemento da caché e de predición de ramas)
it: Cachegrind (profiler della cache e della predizione delle diramazioni)
ka: Cachegrind (კეშისა და შტოს ამოცნობის პროფაილერი)
ko: Cachegrind(캐시와 분기 예측 프로파일러)
nl: Cachegrind: (profiler voor cache en branch-voorspelling)
pl: Cachegrind (Profiler pamięci podręcznej i przewidywania gałęzi)
pt: Cachegrind (Analisador de 'Cache' e Previsão de Saltos)
pt_br: Cachegrind (Cache e Perfil de previsão de ramificação)
sv: Cachegrind (profileringsverktyg för cache- och hopprediktering)
tr: Cachegrind (Önbellek ve Alt Grup-Tahmin Profilleyici)
uk: Cachegrind (засіб профілювання кешу і передбачення розгалужень)
zh_cn: Cachegrind (缓存和分支预测分析器)

source: Search...
ar: ابحث...
ca: Cerca...
eo: Serĉi...
es: Buscar...
fr: Chercher…
gl: Buscar…
it: Cerca...
ka: ძებნა...
ko: 검색...
nl: Zoeken...
pl: Szukaj...
pt: Procurar...
pt_br: Pesquisar...
sv: Sök...
tr: Ara...
uk: Шукати…
zh_cn: 搜索...

source: Percentage values
ar: قيم نسب مئوية
ca: Valors de percentatge
eo: Procentaj valoroj
es: Valores de porcentajes
fr: Valeurs en pourcentage
gl: Valores de porcentaxes
it: Valori percentuali
ka: პროცენტული მნიშვნელობები
ko: 백분율 값
nl: Waarden in percentages
pl: Wartości procentowe
pt: Valores percentuais
pt_br: Valores percentuais
sv: Procentvärden
tr: Pay değerleri
uk: Значення у відсотках
zh_cn: 百分比

source: <html><head/><body><p>Specify if you want to do full cache simulation. By default, only instruction read accesses will be counted (&quot;Ir&quot;). With cache simulation, further event counters are enabled: </p><p>Cache misses on instruction reads (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>data read accesses (&quot;Dr&quot;) and related cache misses (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>data write accesses (&quot;Dw&quot;) and related cache misses (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
ar: <html><head/><body><p>اضبط إذا أردت محاكاة خبيئة كاملة. بشكل مبدئي، تحسب فقط عمليات وصول قراءة التعليمات (”Ir“). مع محاكاة الخبيئة، تفعل عدّادات أحداث إضافية:</p><p>أخطاء الخبيئة في قراءات التعليمات (”I1mr“/”ILmr“)،</p><p>وصول قراءة البيانات (”Dr“) وأخطاء الخبيئة ذات الصلة (”D1mr“/”DLmr“)،</p><p>وصول كتابة البيانات (”Dw“) وأخطاء الخبيئة ذات الصلة (”D1mw“/”DLmw“).</p></body></html>
ca: <html><head/><body><p>Especifica si es vol fer una simulació completa de la memòria cau. De manera predeterminada, només es comptaran les instruccions d'accés de lectura («Ir»). Amb la simulació de la memòria cau, s'activen altres comptadors d'esdeveniments: </p><p>manques de memòria cau en instruccions de lectura («I1mr»/«ILmr»), </p><p>accessos de lectura de dades («Dr») i manques de memòria cau relacionades («D1mr»/«DLmr»), </p><p>accessos d'escriptura de dades («Dw») i manques de memòria cau relacionades («D1mw»/«DLmw»).</p></body></html>
eo: <html><head/><body><p>Specifu ĉu vi volas fari plenan kaŝmemoran simuladon. Defaŭlte, nur instrukciaj legaj aliroj estos kalkulitaj ("Ir"). Kun kaŝmemorsimulado, pliaj okazaĵaj nombriloj estas ebligitaj: </p><p>Kaŝmemoro maltrafas en instrukcioj ("I1mr"/"ILmr"), </p><p>datumaj legaj aliroj ("Dr") kaj rilata kaŝmemoro miss ("D1mr"/"DLmr"), </p><p>datumskribaj aliroj ("Dw") kaj rilataj kaŝmemoro miss ("D1mw"/"DLmw").</p></body></html>
es: <html><head/><body><p>Indica si desea realizar una simulación de caché completa. Por omisión, solo se cuentan los accesos de lectura de instrucciones («Ir»). Con la simulación de caché se activan más contadores de eventos:</p><p>Fallos de caché al leer instrucciones («I1mr»/«ILmr»), </p><p>accesos de lectura de datos («Dr») y fallos de caché relacionados («D1mr»/|DLmr»), </p><p>accesos de escritura de datos («Dw») y fallos de caché relacionados («D1mw»/«DLmw»).</p></body></html>
fr: <html><head/><body><p>Spécifier si vous voulez réaliser une simulation complète de cache. Par défaut, seules les accès des instructions en lecture seront comptés (&quot;)Ir&quot;). Avec la simulation de cache, d'autres compteurs d'évènements sont activés : </p><p>Défauts de cache pour des instruction de lecture (&quot;I1mr&quot; / &quot;ILmr&quot;), </p><p>Accès aux données en lecture (&quot;Dr&quot;) et les défauts correspondants de cache (&quot;D1mr&quot; / &quot;DLmr&quot;), </p><p>Accès aux données en écriture (&quot;Dw&quot;) et les défauts correspondants de cache (&quot;D1mw&quot; / &quot;DLmw&quot;.</p></body></html>
gl: <html><head/><body><p>Indique se quere realizar unha simulación completa da caché. De maneira predeterminada só se contarán os accesos de lectura de instrucións («Ir»). Coa simulación da caché actívanse contadores de eventos adicionais:</p> <p>Accesos á caché errados para lecturas de instrucións («I1mr»/«ILmr»), </p> <p>accesos de lectura de datos («Dr») e accesos errados relacionados («D1mr»/«DLmr»), </p> <p>accesos de escritura de datos («Dw») e accesos errados relacionados («D1mw»/«DLmw»).</p></body></html>
ka: <html><head/><body><p>მიუთითეთ, გსურთ თუ არა ქეშის სრული სიმულაციის ჩატარება. ნაგულისხმევად, მხოლოდ ინსტრუქციების წაკითხვის წვდომები დაითვლება (&quot;Ir&quot;). ქეშის სიმულაციის შემთხვევაში, ჩაირთვება დამატებითი მოვლენების მრიცხველები: </p><p>ქეშის გამოტოვებები (Cache misses) ინსტრუქციების წაკითხვისას (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>მონაცემთა წაკითხვის წვდომები (&quot;Dr&quot;) და მასთან დაკავშირებული ქეშის გამოტოვებები (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>მონაცემთა ჩაწერის წვდომები (&quot;Dw&quot;) და მასთან დაკავშირებული ქეშის გამოტოვებები (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면 전체 캐시 시뮬레이션을 진행합니다. 기본값으로는 명령 읽기 접근 횟수만 집계합니다(&quot;Ir&quot;). 캐시 시뮬레이션을 사용하면 다음 추가 이벤트 카운터를 활성화합니다: </p><p>명령 읽기 시 캐시 누락(&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>데이터 읽기 접근(&quot;Dr&quot;)과 연관된 캐시 누락(&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>데이터 쓰기 접근(&quot;Dw&quot;)과 연관된 캐시 누락(&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
nl: <html><head/><body><p>Specificeer als u een volledige cache-simulatie wilt doen. Standaard zal alleen instructieleestoegang worden geteld (&quot;Ir&quot;). Met cachesimulatie worden verdere tellers voor gebeurtenissen ingeschakeld: </p><p>Een mis in de cache bij lezen van instructies (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>leestoegang van gegevens (&quot;Dr&quot;) en gerelateerde missen in de cache (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>schrijftoegang van gegevens (&quot;Dw&quot;) en gerelateerde missen in de cache (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
pl: <html><head/><body><p>Określ czy chcesz pełnej symulacji pamięci podręcznej. Domyślnie, zliczane będą tylko instrukcje odczytu (&quot;Ir&quot;). Wraz z symulacją pamięci podręcznej, włączane są dalsze liczniki zdarzeń: </p><p>Nieudane odczyty pamięci podręcznej instrukcji (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>odczyty danych (&quot;Dr&quot;) i związane z tym nieudane odczyty pamięci podręcznej (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>zapisy danych (&quot;Dw&quot;) i związane z tym nieudane zapisy pamięci podręcznej (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
pt: <html><head/><body><p>Define se deseja fazer uma simulação completa da 'cache'. Por omissão, só os acessos de leitura das instruções serão tidos em conta (&quot;Ir&quot;). Com a simulação da 'cache', os outros contadores de eventos ficam activos: </p><p>As falhas de 'cache' nas leituras de instruções (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>os acessos de leitura de dados (&quot;Dr&quot;) e as falhas de 'cache' relacionadas (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>os acessos de escrita de dados (&quot;Dw&quot;) e as falhas de 'cache' relacionadas (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
pt_br: <html><head/><body><p>Especifique se deseja realizar a simulação completa do cache. Por padrão, apenas os acessos de leitura de instruções serão contados (&quot;Ir&quot;). Com a simulação de cache, outros contadores de eventos são habilitados: </p><p>Falha de cache em leituras de instruções (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>Acesso de leitura de dados (&quot;Dr&quot;) e falha de cache relacionada (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>Acesso de gravação de dados (&quot;Dw&quot;) e falha de cache relacionada (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
sv: <html><head/><body><p>Ange om du vill utföra fullständig cachesimulering. Normalt räknas bara instruktionsläsaccesser (&quot;ir&quot;). Med cachesimulering, aktiveras ytterligare händelseräknare: </p><p>Cache-missar vid instruktionsläsningar (&quot;I1mr&quot;/&quot;ILmr&quot;), </p><p>dataläsaccesser (&quot;Dr&quot;) och relaterade cachemissar (&quot;D1mr&quot;/&quot;DLmr&quot;), </p><p>dataskrivaccesser (&quot;Dw&quot;) och relaterade cachemissar (&quot;D1mw&quot;/&quot;DLmw&quot;).</p></body></html>
tr: <html><head/><body><p>Tam önbellek benzetimi yapmak isteyip istemediğinizi belirtiniz. Varsayılan olarak, yalnızca yönerge okuma erişimleri ("lr") sayılacaktır. Önbellek benzetimiyle, ayrıca olay sayaçları etkinleştirilmiştir: </p><p>Yönerge okumalar üzerindeki önbellek ıskaları ("I1mr"/"ILmr"), </p><p>veri okuma erişimleri ("Dr") ve ilgili ön bellek ıskaları("D1mr"/"DLmr"), </p><p> veri yazma erişimleri ("Dw" ve ilgili önbellek ıskaları ("D1mw"/"DLmw") ' dir.</p><body></html>
uk: <html><head/><body><p>Визначає, чи потрібна вам повна імітація кешу. Типово, до уваги братимуться лише доступи для читання інструкцій («Ir»). Якщо кеш імітуватиметься, можна буде використовувати інші лічильники подій: </p><p>Промахи у кеші при читанні інструкцій («I1mr»/«ILmr»), </p><p>доступи до читання даних («Dr») та пов’язані із ними промахи у кеші («D1mr»/«DLmr»), </p><p>доступи до запису даних («Dw») та пов’язані із ними промахи у кеші («D1mw»/«DLmw»).</p></body></html>
zh_cn: <html><head/><body><p>指定是否要进行完整的缓存模拟。默认情况下，只有指令读取访问会被计数（&quot;Ir&quot;）。如果进行缓存模拟，那么会启用其他的时间计数器：</p><p>指令读取时缓存未命中（&quot;I1mr&quot;/&quot;&quot;ILmr&quot;），</p><p>数据读取访问（&quot;Dr&quot;）与相关的缓存未命中（&quot;D1mr&quot;/&quot;DLmr&quot;），</p><p>数据写访问（&quot;Dw&quot;）与相关的缓存未命中（&quot;D1mw&quot;/&quot;DLmw&quot;）。</p></body></html>
