Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Frequency of detailed snapshots. With <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, every snapshot is detailed.</p></body></html>
ar: <html><head/><body><p>تكرار اللقطات المفصّلة. مع <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>، كل لقطة تفصّل.</p></body></html>
ca: <html><head/><body><p>Freqüència de les captures detallades. Amb <span style="font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, es detalla cada captura.</p></body></html>
eo: <html><head/><body><p>Ofteco de detalaj momentfotoj. Kun <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, ĉiu momentfoto estas detala.</p></body></html>
es: <html><head/><body><p>Frecuencia de las instantáneas detalladas. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, todas las instantáneas son detalladas.</p></body></html>
fr: <html><head/><body><p>Fréquence des copies détaillées. Avec <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, chacune des copies sera détaillée.</p></body></html>
gl: <html><head/><body><p>Frecuencia das capturas detalladas. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, todas as capturas son detalladas.</p></body></html>
it: <html><head/><body><p>Frequenza delle istantanee dettagliate. Con <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, ogni istantanea è dettagliata.</p></body></html>
ka: <html><head/><body><p>დეტალური სწრაფი ასლების სიხშირე. პარამეტრით <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, ყველა სწრაფი ასლი დეტალურია.</p></body></html>
ko: <html><head/><body><p>자세한 스냅샷을 찍을 빈도입니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>로 지정하면 모든 스냅샷을 자세한 스냅샷으로 찍습니다.</p></body></html>
nl: <html><head/><body><p>Frequentie gedetailleerde snapshots. Met <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span> wordt elke snapshot gedetailleerd.</p></body></html>
pl: <html><head/><body><p>Częstotliwość szczegółowych migawek. Przy <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, każda migawka jest opisywana szczegółowo.</p></body></html>
pt: <html><head/><body><p>A frequência das imagens detalhadas. Com a opção <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, é detalhada cada uma da imagens.</p></body></html>
pt_br: <html><head/><body><p>Frequência de snapshots detalhados. Com <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, cada snapshot é detalhado.</p></body></html>
sv: <html><head/><body><p>Frekvens av detaljerade ögonblicksbilder. Med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span> är alla ögonblicksbilder detaljerade.</p></body></html>
tr: <html><head/><body><p>Detaylı anlık görüntülerin frekansı. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span> ile her anlık görüntü detaylıdır.</p></body></html>
uk: <html><head/><body><p>Частота створення докладних знімків. Якщо вказано <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>, усі знімки будуть докладними.</p></body></html>
zh_cn: <html><head/><body><p>详细快照的频率。如果设置 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--detailed-freq=1</span>，那么每个快照都是详细的。</p></body></html>

source: E&xtra parameters:
ar: المعاملات الإضافيّة:
ca: Paràmetres a&ddicionals:
eo: E&kstra parametroj:
es: Pa&rámetros adicionales:
fr: Paramètr&es supplémentaires :
gl: &Parámetros adicionais:
it: Parametri a&ggiuntivi:
ka: &დამატებითი პარამეტრები:
ko: 추가 인자(&X):
pl: Dodatkowe param&etry:
pt: Parâmetros e&xtra:
pt_br: Parâmetros e&xtras:
sv: E&xtra väljare:
tr: Ek& parametreler:
uk: Додаткові &параметри:
zh_cn: 额外参数(&X)：

source: <html><head/><body><p>The significance threshold for heap allocations, as a percentage of total memory size. Allocation tree entries that account for less than this will be aggregated. Note that this should be specified in tandem with ms_print's option of the same name.</p></body></html>
ar: <html><head/><body><p>عتبة الأهمية لتخصيصات الكومة، كنسبة مئوية من حجم الذاكرة الكلي. إدخالات شجرة التّخصيص التي تقل حصّتها عن هذا يجمّع. لاحظ أن هذا يجب أن يحدّد بالتزامن مع خيار ms_print بالاسم نفسه.</p></body></html>
ca: <html><head/><body><p>El llindar significatiu per a l'assignació de la memòria en monticles, com a percentatge de la mida total de la memòria. S'agregaran les assignacions de les entrades de l'arbre que comptin menys que aquest valor. Cal tenir en compte que això s'ha d'especificar en tàndem amb l'opció del «ms_print» del mateix nom.</p></body></html>
eo: <html><head/><body><p>La signifsojlo por amasasignoj, kiel procento de totala memorgrando. Asignaj arbo-enskriboj kiuj respondecas pri malpli ol tio estos kunigitaj. Notu, ke ĉi tio estu specifita kune kun la samnoma opcio de ms_print.</p></body></html>
es: <html><head/><body><p>El umbral significativo para las asignaciones en el montículo, indicado como porcentaje del tamaño total de la memoria. Se añadirán las entradas del árbol de asignaciones que tengan un contador inferior a este valor. Tenga en cuenta que este valor se debe indicar de forma conjunta con la opción de «ms_print» del mismo nombre.</p></body></html>
fr: <html><head/><body><p>le seuil d'importance pour les allocations dans le tas, comme pourcentage de la taille mémoire totale. Les entrées de l'arbre d'allocations qui concourent pour moins que cela seront agrégées. Veuillez noter que ceci devrait être spécifié en conjonction avec l'option « ms_print » du même nom.</p></body></html>
gl: <html><head/><body><p>O límite de importancia para asignacións do monte, como porcentaxe do tamaño de memoria total. As entradas de árbore de asignación que representan menos disto agruparanse. Teña en conta que isto debería indicarse xunto coa opción de ms_print do mesmo nome.</p></body></html>
ka: <html><head/><body><p>დინამიკური მეხსიერების გამოყოფის მნიშვნელოვნების ზღვარი, მთლიანი მეხსიერების ზომის პროცენტული მაჩვენებლით. გამოყოფის ხის ის ჩანაწერები, რომლებიც ამ ზღვარზე ნაკლებს შეადგენენ, დაჯგუფდება. გაითვალისწინეთ, რომ ეს პარამეტრი უნდა მიეთითოს ms_print-ის იმავე სახელწოდების პარამეტრთან ერთად.</p></body></html>
ko: <html><head/><body><p>총 메모리 크기의 백분율로 지정하는 대형 힙 할당 임곗값입니다. 이 항목보다 작은 할당 트리 항목은 합쳐집니다. ms_print의 이름이 같은 옵션과 동시에 설정해야 합니다.</p></body></html>
nl: <html><head/><body><p>De belangrijkste drempel voor heap allocaties, als een percentage van de totale geheugen grootte. Allocatieboomstructuren die onder deze drempel blijven, worden opgeteld. Merk op dat u dit tezamen met de instelling voor ms_print's van dezelfde naam moet instellen.</p></body></html>
pl: <html><head/><body><p>Próg znaczenie dla przydziałów na stercie jako procent całkowitego rozmiaru pamięci. Wpisy drzewa przydziałów, które są mniejsze niż ta wartość będą grupowane. Miej na uwadze, że pownno się to określać w tandemie z opcją ms_print o tej samej nazwie.</p></body></html>
pt: <html><head/><body><p>O limiar de significância para as alocações da memória de dados, como uma percentagem do tamanho total da memória. Os elementos da árvore de alocações que sejam inferiores a este valor serão agregados. Lembre-se que isto deverá ser definido em conjunto com a opção 'ms_print' com o mesmo nome.</p></body></html>
pt_br: <html><head/><body><p>O limite de significância para alocações de heap, como uma porcentagem do tamanho total da memória. As entradas da árvore de alocação que representarem menos que isso serão agregadas. Observe que isso deve ser especificado em conjunto com a opção ms_print de mesmo nome.</p></body></html>
sv: <html><head/><body><p>Signifikanströskeln för heap-tilldelningar, som procent av den totala minnesstorleken. Poster i tilldelningsträdet som gäller mindre än den slås ihop. Observera att det bör anges parallellt med alternativet i ms_print med samma namn.</p></body></html>
tr: <html><head/><body><p>Küme ayırmaları için önemli eşik, toplam bellek boyutunun bir yüzdesi olarak. Bundan daha az olan ayırma ağacı girdileri toplanacaktır. Bunun aynı adlı ms_print seçeneği ile ardarda belirtilmesi gerektiğini unutmayınız.</p></body></html>
uk: <html><head/><body><p>Порогова значимість для розміщень у «купі» у відсотках щодо загального об’єму пам’яті. Записи ієрархії розміщення даних, які матимуть менше значення, будуть об’єднуватися. Зауважте, що цей параметр слід поєднуватися із параметром ms_print із тією ж назвою.</p></body></html>
zh_cn: <html><head/><body><p>堆分配的显著性阈值，以总内存大小的百分比计。分配树中所占大小小于这个阈值的项目会被聚合。注意这个选项应该被和 ms_print 的同名选项一同指定。</p></body></html>

source: <html><head/><body><p>Massif does not necessarily record the actual global memory allocation peak; by default it records a peak only when the global memory allocation size exceeds the previous peak by at least 1.0%. This is because there can be many local allocation peaks along the way, and doing a detailed snapshot for every one would be expensive and wasteful, as all but one of them will be later discarded. This inaccuracy can be changed (even to 0.0%) via this option, but Massif will run drastically slower as the number approaches zero.</p></body></html>
ar: <html><head/><body><p>لا يسجّل Massif بالضّرورة ذروة تخصيص الذاكرة الكلية الفعليّة؛ بشكل مبدئي يسجّل ذروة فقط عندما يتجاوز حجم تخصيص الذاكرة الكلي الذروة السابقة بما لا يقل عن 1.0%. هذا لأن قد يكون هناك العديد من ذروات التّخصيص المحليّة على طول الطريق، و إجراء لقطة مفصّلة لكل واحدة يكون مكلّفاً و مبذّراً، حيث أن كلها ما عدا واحدة منها تهمل لاحقاً. يمكن تغيير عدم الدقة هذا (حتى ل 0.0%) عبر هذا الخيار، و لكن يعمل Massif ببطء أكثر بكثير كلما اقترب العدد من الصفر.</p></body></html>
ca: <html><head/><body><p>El Massif no necessàriament enregistra el pic d'assignació de memòria global real; de manera predeterminada, enregistra un pic quan la mida d'assignació de la memòria global excedeix el pic previ en un 1,0% com a mínim. Això és perquè poden haver-hi molts pics d'assignació locals durant el camí, i fer una captura detallada de cada un podria ser costós i superflu, ja que cal descartar-los tots excepte un. Aquesta imprecisió es pot canviar (inclús al 0,0%) via aquesta opció, però el Massif s'executarà molt lentament quan el nombre s'aproximi a zero.</p></body></html>
eo: <html><head/><body><p>Masivo ne nepre registras la realan tutmondan memor-atribuan pinton; defaŭlte ĝi registras pinton nur kiam la tutmonda memor-asigna grandeco superas la antaŭan pinton je almenaŭ 1.0%. Ĉi tio estas ĉar povas esti multaj lokaj asignopintoj laŭ la vojo, kaj fari detalan momentfoton por ĉiu estus multekosta kaj malŝparema, ĉar ĉiuj krom unu el ili estos poste forĵetitaj. Ĉi tiu malprecizeco povas esti ŝanĝita (eĉ al 0,0%) per ĉi tiu opcio, sed Massif funkcios draste pli malrapide kiam la nombro alproksimiĝas al nulo.</p></body></html>
es: <html><head/><body><p>Massif no guarda necesariamente el pico de asignación de memoria global real; por omisión, guarda un pico solo cuando el tamaño de asignación de memoria global excede el del pico anterior al menos un 1,0%. Se hace de este modo porque pueden existir muchos picos de asignación locales sobre la marcha, y la obtención de una instantánea detallada para cada uno de ellos sería muy costosa y derrochadora, ya que todos excepto uno de ellos se descartarán posteriormente. Esta falta de precisión se puede cambiar (incluso al 0,0%) usando esta opción, aunque Massif se ejecutará drásticamente más lento a medida que este número se aproxima a cero.</p></body></html>
fr: <html><head/><body><p>Massif n'enregistre pas nécessairement le pic d'allocation de mémoire globale. Par défaut, il n'enregistre un pic que lorsque la taille d'allocation de mémoire globale dépasse le dernier pic par au moins 1 pourcent. Ceci est justifié parce qu'il peut y avoir de nombreux pics d'allocation locale au cours du temps et que faire un rapport détaillé pour tous serait très coûteux et sans intérêt, puisque que l'un d'entre eux pourrait être effacé plus tard. Ce manque de précision peut être amélioré (même jusqu'à 0,0 %) grâce à cette option. Mais, Massif s'exécutera dramatiquement lentement, dès que la valeur s'approche de zéro.</p></body></html>
gl: <html><head/><body><p>Massif non grava necesariamente o pico real de asignación de memoria global; de maneira predeterminada, só grava un pico cando o tamaño de asignación de memoria global supera o pico anterior polo menos un 1,0%. Isto é así porque poden producirse moitos picos de asignacións locais polo camiño, e facer unha captura detallada de cada un sería custoso e un desperdicio, dado que ao final se descartarán todos menos un. Esta falta de exactitude pode cambiarse (incluso poñerse a 0,0%) mediante esta opción, pero Massif funcionará drasticamente máis lento a medida que o número se achegue a cero.</p></body></html>
ka: <html><head/><body><p>Massif ყოველთვის არ აფიქსირებს გლობალური მეხსიერების გამოყოფის რეალურ პიკს; ნაგულისხმევად, იგი აფიქსირებს პიკს მხოლოდ მაშინ, როცა მეხსიერების გამოყოფის გლობალური ზომა წინა პიკს სულ მცირე 1.0%-ით აჭარბებს. ეს იმიტომ ხდება, რომ პროცესში შეიძლება ბევრი ლოკალური პიკი დაფიქსირდეს, ხოლო თითოეულისთვის დეტალური სწრაფი ასლის გაკეთება რესურსების მხრივ ძვირი და არაეფექტური იქნებოდა, რადგან ერთის გარდა ყველა მათგანი მოგვიანებით მაინც წაიშლება. ამ უზუსტობის შეცვლა (თუნდაც 0.0%-მდე) შესაძლებელია ამ პარამეტრით, თუმცა მნიშვნელობის ნულთან მიახლოებისას Massif მკვეთრად შენელდება.</p></body></html>
ko: <html><head/><body><p>Massif에서는 실제 전역 메모리 할당을 항상 기록하지는 않습니다. 기본값으로 전역 메모리 할당 크기가 이전 극값의 최소 1.0%를 초과할 때만 기록합니다. 로컬 할당 극값이 계속 발생할 수 있으며, 매 극값마다 자세한 스냅샷을 찍기에는 자원이 많이 소모될 수도 있습니다. 또한 해당 스냅샷은 나중에 하나만 남겨 두고 사용되지 않기 때문입니다. 이 옵션을 사용하여 비율을 변경할 수 있으나(0.0%로도 설정 가능) 값이 0에 가까워질수록 Massif 실행이 더 느려집니다.</p></body></html>
nl: <html><head/><body><p>Massif registreert niet noodzakelijkerwijs de actuele totale piek in geheugenallocaties; standaard registreert het een piek alleen als de totale grootte van geheugenallocaties de voorgaande piek met tenminste 1.0% overtreft. Dit is omdat er vele tijdelijke lokale allocatie-pieken zijn, en voor elke piek een gedetailleerde snapshot maken is duur en zinloos, omdat ze allemaal behalve eentje later weer worden weggegooid. Deze tolerantie is hier instelbaar (zelfs naar 0.0%), maar Massif zal drastisch langzamer lopen als het getal naar nul gaat.</p></body></html>
pl: <html><head/><body><p>Massif niekoniecznie zapisje bieżący globalny szczyt przedzielenia pamięci; domyślnie zapisuje szczyt tylko wtedy, gdy globalny rozmiar przydzielenia pamięci przekroczy poprzedni szczyt o co najmniej 1.0%. Dzieje się tak dlatego, ponieważ może być wiele szczytów przydzieleń po drodze i tworzenie sczegółowego zrzutu dla każdego z nich byłoby kosztowne i marnotrwane, gdyż wszystkie oprócz jednego byłyby później usunięte. Niedokładność można zmienić (nawet na 0.0%) poprzez tę opcję, lecz Massif będzie działał znacznie wolniej przy zbliżaniu się tej wartości do zera.</p></body></html>
pt: <html><head/><body><p>O Massif não regista necessariamente o pico actual global de alocação de memória; por omissão, ele regista um pico apenas quando o tamanho da alocação global de memória exceder o pico anterior em pelo menos 1,0%. Isto acontece porque podem existir muitos picos locais de alocações pelo caminho, e criar uma imagem detalhada para cada um deles seria dispendioso e dispensável, já que todas essas imagens excepto uma seriam descartadas no fim. Esta incorrecção poderá ser alterada (mesmo para 0,0%) com esta opção, mas o Massif irá correr de forma drasticamente mais lenta à medida que o número se aproxima de zero.</p></body></html>
pt_br: <html><head/><body><p>O Massif não registra necessariamente o pico real de alocação de memória global; por padrão, ele registra um pico apenas quando o tamanho da alocação de memória global excede o pico anterior em pelo menos 1,0%. Isso ocorre porque pode haver muitos picos de alocação locais ao longo do caminho, e criar um snapshot detalhado de cada um deles seria caro e um desperdício, pois todos, exceto um, seriam descartados posteriormente. Essa imprecisão pode ser alterada (até mesmo para 0,0%) por meio desta opção, mas o Massif ficará drasticamente mais lento à medida que o número se aproxima de zero.</p></body></html>
sv: <html><head/><body><p>Massif lagrar inte nödvändigtvis den verkliga toppen för globalt tilldelat minne. Normalt lagrar det bara en topp när den globala minnestilldelningen överskrider den föregående toppen med minst 1,0 %. Det görs därför att det kan finnas många lokala tilldelningstoppar längs vägen, och att ta en detaljerad ögonblicksbild av var och en skulle vara dyrt och slösaktigt, eftersom alla utom en senare kommer att kasseras. Onoggrannheten kan ändras (också till 0,0 %) via det här alternativet, men Massif kör avsevärt långsammare när värdet närmar sig noll.</p></body></html>
tr: <html><head/><body><p>Massif, gerçek global bellek tahsisi tepe değerini ille de kaydetmez; varsayılan olarak yalnızca global bellek tahsis boyutu bir önce tepe değerini en az % 1.0 aştığında kaydeder. Bunun nedeni yol boyunca birçok yerel tahsis tepelerinin olabileceği ve her biri için detaylı bir anlık görüntü yapmanın pahalı ve israflı olacağıdır, biri hariç diğerleri daha sonra göz ardı edileceği için. Bu yanlışlık (hatta % 0.0 ' a ) bu seçenekle değiştirilebilir, ancak sayı sıfıra yaklaştıkça Massif çok daha yavaş çalışır.</p></body></html>
uk: <html><head/><body><p>Massif не обов’язково записує справжнє пікове значення отримання пам’яті. Типово, програма записує пік, лише якщо загалом об’єм отриманої пам’яті перевищує попереднє пікове значення принаймні на 1 %. Так зроблено, оскільки під час роботи може бути багато локальних пікових значень, а створення докладного знімка для кожного з таких значень є справою витратною і марною, оскільки усі ці дані буде потім відкинуто. За допомогою цього параметра ви можете змінити цей крок зміни пікового значення (навіть визначити його рівним 0 %), але при цьому Massif працюватиме усе повільніше із наближенням цього значення до нуля.</p></body></html>
zh_cn: <html><head/><body><p>Massif 未必会报告实际上的全局内存使用峰值；默认情况下它只会在全局内存分配大小至少超过之前峰值的1.0%时才会记录一个新的峰值。这是因为在此过程中可能会有很多本地分配导致的峰值。如果对每一个都进行详细的快照，可能会过于昂贵且浪费，因为最后除了其中一个以外，其它都会被丢弃。这个不精确性可以通过此选项被改变（甚至降低到0.0%），但是随着这个值接近零，Massif 的运行速度会大幅减缓。</p></body></html>

source: <html><head/><body><p>Specifies whether heap profiling should be done.</p></body></html>
ar: <html><head/><body><p>يحدّد ما إذا كان يجب إجراء تحليل أداء الكومة.</p></body></html>
ca: <html><head/><body><p>Especifica si s'ha de fer l'anàlisi de rendiment de la memòria en monticles.</p></body></html>
eo: <html><head/><body><p>Specifas ĉu amasprofilado devus esti farita.</p></body></html>
es: <html><head/><body><p>Indica si se debe realizar un análisis de rendimiento del montículo.</p></body></html>
fr: <html><head/><body><p>Spécifie si le profilage du tas local doit être fait.</p></body></html>
gl: <html><head/><body><p>Indica se debe facerse unha análise de rendemento do monte.</p></body></html>
it: <html><head/><body><p>Indica se debba essere eseguito il profiling dello heap.</p></body></html>
ka: <html><head/><body><p>მიუთითებს, მოხდება თუ არა მეხსიერების გროვის პროფილრება.</p></body></html>
ko: <html><head/><body><p>힙 프로파일링 실행 여부를 결정합니다.</p></body></html>
nl: <html><head/><body><p>Specificeert of heapprofilering gedaan moet worden.</p></body></html>
pl: <html><head/><body><p>Określa czy wykonać profilowanie sterty.</p></body></html>
pt: <html><head/><body><p>Define se deve ser feita uma análise de performance da memória de dados.</p></body></html>
pt_br: <html><head/><body><p>Especifica se a criação de perfil de heap deve ser feita.</p></body></html>
sv: <html><head/><body><p>Anger om heap-profilering ska göras.</p></body></html>
tr: <html><head/><body><p>Küme profillemenin yapılması gerekip gerekmediğini belirtir.</p></body></html>
uk: <html><head/><body><p>Визначає, чи слід виконувати профілювання «купи».</p></body></html>
zh_cn: <html><head/><body><p>指定是否要进行堆分析。</p></body></html>

source: Profile heap
ar: تحليل أداء الكومة
ca: Anàlisi de rendiment de la memòria en monticles
eo: Profila amaso
es: Analizar el montículo
fr: Profiler le tas local (« heap »)
gl: Analizar o montículo
it: Esegui profiling dell'heap
ka: დინამიკური მეხსიერების პროფილირება
ko: 힙 프로필
nl: Profiel-heap
pl: Przeprowadź profilowanie sterty
pt: Analisar a memória dinâmica
pt_br: Analisar a memória dinâmica
sv: Profilera heap
tr: Profil kümesi
uk: Профілювати динамічну пам’ять
zh_cn: 分析堆
