Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>When enabled (the default), Helgrind performs lock order consistency checking. For some buggy programs, the large number of lock order errors reported can become annoying, particularly if you're only interested in race errors. You may therefore find it helpful to disable lock order checking.</p></body></html>
ar: <html><head/><body><p>عند التّفعيل (بشكل مبدئي)، ينفّذ Helgrind فحص تناسق ترتيب القفل. بالنسبة لبعض البرامج المليئة بالعلل، قد يصبح العدد الكبير من أخطاء ترتيب القفل المبلّغ عنها مزعجاً، خصوصاً إذا كنت مهتماً بأخطاء التزاحم فقط. قد تجد أنه من المفيد تعطيل فحص ترتيب القفل.</p></body></html>
ca: <html><head/><body><p>Quan està activat (predeterminat), el Helgrind porta a terme la comprovació de la coherència de l'ordre dels bloqueigs. En diversos programes erronis, el gran nombre d'errors d'ordre de bloqueig informats pot esdevenir molestos, particularment si només esteu interessat en errors de competició. Per tant, podria ser d'ajuda desactivar la comprovació de l'ordre de bloqueigs.</p></body></html>
eo: <html><head/><body><p>Kiam ĝi estas ebligita (la defaŭlta), Helgrind faras kontrolon de konsekvenca ordo. Por iuj bugprogramoj, la granda nombro da seruraj eraroj raportitaj povas fariĝi ĝena, precipe se vi nur interesiĝas pri raseraroj. Vi do eble trovos utila malŝalti kontrolon de ŝlosordo.</p></body></html>
es: <html><head/><body><p>Cuando se activa (que es el valor predeterminado), Helgrind realiza comprobaciones de consistencia del orden de bloqueos. En algunos programas defectuosos, el gran número de errores en el orden de los bloqueos que se muestra puede resultar molesto, especialmente si solo tiene interés en los errores de carreras. En este caso puede serle de ayuda la desactivación de la comprobación del orden de los bloqueos.</p></body></html>
fr: <html><head/><body><p>Quand cette option est activée (option par défaut), Helgrind réaliser des vérifications sur la cohérence des demandes de verrouillage. Pour certains programmes défaillants, un grand nombre d'erreurs signalées pour les demandes de verrouillage peuvent devenir très problématiques, en particulier, si vous n'êtes intéressé que par les accès concurrents. Vous devriez alors trouver cela plus intéressant de désactiver les vérifications de demandes de verrouillage.</p></body></html>
gl: <html><head/><body><p>Cando está activada (predeterminado), Helgrind realiza comprobacións de consistencia da orde dos bloqueos. Para algúns programas con erros, o gran número de erros de orde de bloqueo dos que se informa pode resultar molesto, especialmente se só lle interesan os erros de carreira. Polo tanto pode que lle resulte útil desactivar a comprobación da orde dos bloqueos.</p></body></html>
ka: <html><head/><body><p>როდესაც ეს ფუნქცია ჩართულია (რაც ნაგულისხმევია), Helgrind ასრულებს დაბლოკვის თანმიმდევრობის შესაბამისობის შემოწმებას. ზოგიერთი ხარვეზიანი პროგრამისთვის, დაბლოკვის თანმიმდევრობის შეცდომების დიდი რაოდენობა შესაძლოა დამღლელი აღმოჩნდეს, განსაკუთრებით მაშინ, თუ თქვენ მხოლოდ დავის შეცდომები გაინტერესებთ. ასეთ შემთხვევაში, შესაძლოა სასარგებლო იყოს დაბლოკვის თანმიმდევრობის შემოწმების გამორთვა.</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면(기본값) Helgrind에서 잠금 순서 일관성 검사를 실행합니다. 일부 버그가 있는 프로그램에서는 잠금 순서 오류가 자주 발생할 수 있기 때문에, 경쟁 조건 오류만 검사할 예정이라면 잠금 순서 검사를 비활성화할 수도 있습니다.</p></body></html>
nl: <html><head/><body><p>Indien ingeschakeld (de standaard), zal Helgrind volgorde consistentie controle doen. Voor sommige buggy programma's, zal het grote aantal gerapporteerde fouten in volgorde van vergrendeling vervelend worden, speciaal als u alleen geïnteresseerd bent in race-fouten. U zou het daarom nuttig vinden om controle op volgorde van vergrendeling uit te schakelen.</p></body></html>
pl: <html><head/><body><p>Gdy włączone (domyślnie), to Helgrind wykonuje sprawdzenie zgodności kolejności blokad. Dla programów pełnych błędów, duża liczba błędów kolejności blokady może stać się irytująca, szczególnie gdy jesteś zainteresowany tylko błędami wynikającymi z gonitw. W takim przypadku przydatne może okazać się wyłączenie sprawdzania kolejności blokad.</p></body></html>
pt: <html><head/><body><p>Quando estiver activo (por omissão), o Helgrind efectua uma verificação da consistência da ordem dos bloqueios. Para alguns programas com problemas, o número elevado de erros na ordem dos bloqueios poder-se-á tornar incómodo, principalmente se só estiver interessado em erros de concorrência. Poderá então achar útil desactivar a verificação da ordem dos bloqueios.</p></body></html>
pt_br: <html><head/><body><p>Quando habilitado (o padrão), o Helgrind realiza a verificação de consistência da ordem de bloqueio. Para alguns programas com bugs, o grande número de erros de ordem de bloqueio relatados pode ser irritante , principalmente se você estiver interessado apenas em erros de corrida. Portanto, pode ser útil desabilitar a verificação da ordem de bloqueio.</p></body></html>
sv: <html><head/><body><p>När aktiverat (normalvärdet), utför Helgrind konsekvenskontroll av låsordning. För vissa felaktiga program kan det stora antalet låsordningsfel som rapporteras vara irriterande, särskilt om du bara är intresserad av kapplöpningsfel. Därför kan det vara till hjälp att inaktivera kontroll av låsordning.</p></body></html>
tr: <html><head/><body><p>Etkinleştirildiğinde (varsayılan), Helgrind kilit sırası tutarlılık denetimi gerçekleştirir. Bazı hatalı programlar için, raporlanan kilit sırası hatalarının büyük bir kısmı sinir bozucu olabilir, özellikle eğer yalnızca yarış hataları ile ilgileniyorsanız. Bu yüzden kilit sırası denetimini devre dışı bırakmayı yararlı bulabilirsiniz.</p></body></html>
uk: <html><head/><body><p>Якщо позначено (типова поведінка), Helgrind виконуватиме перевірку послідовності порядку блокування. У деяких програмах із вадами велика кількість помилок порядку блокування у звіті може бути доволі набридливою, зокрема, якщо ви цікавитеся лише конфліктами доступу. Тому, може виникнути потреба у вимиканні перевірки порядку блокування.</p></body></html>
zh_cn: <html><head/><body><p>如果启用（默认），Helgrind 会进行锁顺序一致性检查。对一些有问题的程序，报告出来的大量锁顺序错误可能会令人烦躁，特别是如果您只关心竞争性访问错误。这种情况下，禁止锁顺序检查可能会对您有所帮助。</p></body></html>

source: Track lock orders
ar: تتبّع ترتيب الأقفال
ca: Traça les ordres de bloqueig
eo: Spuri serurmendojn
es: Registrar las órdenes de bloqueo
fr: Suivre les ordres de verrouillage
gl: Seguir as ordes de bloqueo.
it: Segui ordine dei blocchi
ka: დაბლოკვის შეკვეთების ტრეკინგი
ko: 잠금 순서 추적
nl: Opdrachten voor vergrendeling volgen
pl: Kolejność śledzenia blokad
pt: Registar a ordem dos bloqueios
pt_br: Rastrear pedidos de bloqueio
sv: Spåra låsningsordning
tr: Kilit sıralarını izle
uk: Стежити за порядком блокування
zh_cn: 追踪锁次序

source: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">By default Helgrind checks all data memory accesses made by your program. This flag enables you to skip checking for accesses to thread stacks (local variables). This can improve performance, but comes at the cost of missing races on stack-allocated data.</p></body></html>
ar: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">بشكل مبدئي يفحص Helgrind كل وصولات ذاكرة البيانات التي ينفّذها برنامجك. يسمح لك هذا العلم بتجاوُز فحص الوصولات لمكدّسات السلاسل (المتغيرات المحلية). يمكن لهذا أن يحسّن الأداء، و لكن يأتي بكلفة تفويت تزاحمات على البيانات المخصصة في المكدّس.</p></body></html>
ca: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Per omissió, el Helgrind comprova tots els accessos a la memòria de dades fetes pel vostre programa. Aquest indicador permet ometre la comprovació dels accessos a les piles de processos (variables locals). Això pot millorar el rendiment, però a costa d'alguns errors de competència en les dades assignades a la pila.</p></body></html>
eo: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html> <head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Defaŭlte Helgrind kontrolas ĉiujn memorajn alirojn faritajn de via programo. Ĉi tiu flago ebligas al vi preterpasi kontrolon pri aliroj al fadenaj stakoj (lokaj variabloj). Ĉi tio povas plibonigi rendimenton, sed kostas mankantajn vetkurojn sur stak-asignitaj datumoj.</p></body></html>
es: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">De forma predeterminada, Helgrind comprueba todos los accesos a la memoria de datos que realice su programa. Este indicador le permite omitir la comprobación de los accesos a las pilas de los hilos (variables locales). Esto puede mejorar el rendimiento, aunque a costa de no detectar carreras en los datos asignados en la pila.</p></body></html>
fr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Par défaut, Helgrind vérifie tous les accès mémoire effectués par votre programme. Cette option vous autorise à sauter la vérification des accès aux piles des processus (variables locales). Ceci peut améliorer la performance mais se fait au prix de traces manquantes sur les données allouées dans la pile.</p></body></html>
gl: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">De maneira predeterminada, Helgrind comproba todos os accesos de memoria de datos que realiza o programa. Esta marca permítelle saltarse a comprobación para accesos a rimas de fíos (variábeis locais). Isto pode mellorar o rendemento, pero a cambio non detecta carreiras nos datos asignados á rima.</p></body></html>
ka: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">ნაგულისხმევად Helgrind ამოწმებს თქვენი პროგრამის მიერ მონაცემთა მეხსიერებაზე ყველა წვდომას. ეს ალამი საშუალებას გაძლევთ, გამოტოვოთ ნაკადების სტეკებზე (ლოკალურ ცვლადებზე) წვდომის შემოწმება. ამან შეიძლება გააუმჯობესოს წარმადობა, თუმცა სტეკზე განთავსებულ მონაცემებზე დავების გამოტოვების ფასად.</p></body></html>
ko: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">기본값으로 Helgrind에서는 프로그램의 모든 데이터 메모리 접근을 확인합니다. 이 플래그를 지정하면 스레드 스택(지역 변수) 접근 검사를 건너뜁니다. 성능을 향상시킬 수 있지만 스택에 할당된 데이터의 경쟁을 확인할 수 없습니다.</p></body></html>
nl: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Standaard controleert Helgrind alle toegang tot gegevens gemaakt door uw programma. Deze vlag maakt het u mogelijk om controle op toegang tot threadstacks (locale variabelen) uit te schakelen. Dit kan prestaties verbeteren, maar ten koste van het missen van races op in de stack toegekende gegevens.</p></body></html>
pl: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Domyślnie Helgrind sprawdza wszystkie dostępy do pamięci wykonywane przez twój program. Flaga ta umożliwia ci pominięcie sprawdzania dostępu do stosów wątków (zmienne lokalne). Może to poprawić wydajnośc, lecz kosztem brakujących gonitw na danych przydzielonych na stosie.</p></body></html>
pt: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Por omissão, o Helgrind verifica todos os acessos à memória de dados feitos pelo seu programa. Esta opção permite-lhe saltar a verificação de acessos às pilhas das tarefas (variáveis locais). Isto poderá aumentar a performance, mas terá o custo de alguns erros de concorrência nos dados alocados na pilha.</p></body></html>
pt_br: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Por padrão, o Helgrind verifica todos os acessos à memória de dados feitos pelo seu programa. Esta flag permite que você ignore a verificação de acessos a pilhas de threads (variáveis ​​locais). Isso pode melhorar o desempenho, mas tem o custo de corridas perdidas em dados alocados na pilha.</p></body></html>
sv: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Normalt kontrollerar Helgrind alla dataminnesaccesser som görs av programmet. Den här flaggan gör det möjligt att hoppa över kontroll av accesser till trådstackar (lokala variabler). Det kan förbättra prestanda, men till bekostnad av möjlighet att missa kapplöpning för data tilldelat på stacken.</p></body></html>
tr: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Varsayılan olarak Helgrind program tarafından yapılmış tüm veri önbellek erişimlerini denetler. Bu bayrak iş parçacığı yığınlarına (yerel değişkenler) erişimler için denetlemeyi göz ardı etmenize olanak sağlar. Bu performansı artırabilir ama yığın-tahsis edilen veri yarışlarının kaybolması pahasına gelir.</p></body></html>
uk: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">Типово Helgrind перевіряє усі спроби доступу до пам’яті, які виконуються програмою. За допомогою цього прапорця ви можете пропустити перевірку доступів до стеків потоків (локальних змінних). Це може поліпшити швидкодію, але при цьому буде пропущено конфлікти у розміщенні даних у стеку.</p></body></html>
zh_cn: <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN" "http://www.w3.org/TR/REC-html40/strict.dtd"> <html><head><meta name="qrichtext" content="1" /><style type="text/css"> p, li { white-space: pre-wrap; } </style></head><body style=" font-family:'Sans Serif'; font-size:14pt; font-weight:400; font-style:normal;"> <p style=" margin-top:0px; margin-bottom:0px; margin-left:0px; margin-right:0px; -qt-block-indent:0; text-indent:0px;">默认情况下 Helgrind 检查您的程序进行的所有的内存访问。该选项允许您跳过对线程堆栈（本地变量）的访问。 这可以提高性能，但是代价是您可能会错过对堆栈上分配的数据的竞争性访问。</p></body></html>

source: Check stack refs
ar: افحص مراجع المكدّس
ca: Comprova les referències de la pila
eo: Kontroli stakref-ojn
es: Comprobar referencias de la pila de llamadas
fr: Vérifier les références à la pile
gl: Comprobar as referencias da rima.
it: Verifica riferimenti allo stack
ka: სტეკის მიმართვების შემოწმება
ko: 스택 참조 확인
nl: Referenties naar stack controleren
pl: Sprawdź odniesienia na stosie
pt: Verificar as referências da pilha
pt_br: Verificar as referências da pilha
sv: Kontrollera stackreferenser
tr: Yığın referanslarını denetle
uk: Перевіряти посилання у стеку
zh_cn: 检查堆栈引用
