Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Controls whether Memcheck tracks the origin of uninitialised values. By default, it does not, which means that although it can tell you that an uninitialised value is being used in a dangerous way, it cannot tell you where the uninitialised value came from. This often makes it difficult to track down the root problem.</p><p>When set to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, Memcheck keeps track of the origins of all uninitialised values. Then, when an uninitialised value error is reported, Memcheck will try to show the origin of the value. An origin can be one of the following four places: a heap block, a stack allocation, a client request, or miscellaneous other sources (eg, a call to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>For uninitialised values originating from a heap block, Memcheck shows where the block was allocated. For uninitialised values originating from a stack allocation, Memcheck can tell you which function allocated the value, but no more than that -- typically it shows you the source location of the opening brace of the function. So you should carefully check that all of the function's local variables are initialised properly. </p><p>Performance overhead: origin tracking is expensive. It halves Memcheck's speed and increases memory use by a minimum of 100MB, and possibly more. Nevertheless it can drastically reduce the effort required to identify the root cause of uninitialised value errors, and so is often a programmer productivity win, despite running more slowly. </p><p>Accuracy: Memcheck tracks origins quite accurately. To avoid very large space and time overheads, some approximations are made. It is possible, although unlikely, that Memcheck will report an incorrect origin, or not be able to identify any origin. </p><p>Note that the combination <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> is nonsensical. Memcheck checks for and rejects this combination at startup.</p></body></html>
ar: <html><head/><body><p>يتحكّم في ما إذا راقب Memcheck أصل القيم غير المهيأة. لا يراقب مبدئيًا، مما يعني أنّه على الرغم من أنّه يستطيع إخبارك بأن قيمة غير مهيأة تستخدم بطريقة خطرة، لا يمكنه إخبارك بمكان نشأة القيمة غير المهيأة. يجعل هذا غالبًا من الصعب تتبّع المشكلة الجذرية.</p><p>عند الضبط على <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>، يحتفظ Memcheck بسجل لأصول جميع القيم غير المهيأة. بعد ذلك، عند الإبلاغ عن خطأ قيمة غير مهيأة، سيحاول Memcheck إظهار أصل القيمة. يمكن أن يكون الأصل أحد الأماكن الأربعة التالية: كتلة كومة، تخصيص مكدّس، طلب عميل، أو مصادر أخرى متنوّعة (مثل، استدعاء لـ <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>للقيم غير المهيأة الناشئة من كتلة كومة، يعرض Memcheck مكان تخصيص الكتلة. للقيم غير المهيأة الناشئة من تخصيص مكدّس، يمكن لـ Memcheck أن يخبرك بالدالة التي خصّصت القيمة، ولكن ليس أكثر من ذلك - يعرض عادةً موقع المصدر للقوس الافتتاحي للدالة. لذا يجب أن تتحقّق بعناية من تهيئة جميع المتغيّرات المحلية للدالة بشكل صحيح.</p><p>الحِمل الإضافي للأداء: مراقبة الأصل مكلفة. يخفّض سرعة Memcheck إلى النصف ويزيد من استخدام الذاكرة بما لا يقلّ عن 100 ميغابايت، وربما أكثر. ومع ذلك، يمكن أن يقلّل بشكل كبير من الجهد المطلوب لتحديد السبب الجذري لأخطاء القيمة غير المهيأة، وبالتالي غالبًا ما يكون مكسبًا لإنتاجية المبرمج، على الرغم من تشغيله بشكل أبطأ.</p><p>الدقة: يتّبع Memcheck الأصول بدقة كبيرة. لتجنّب النفقات العامة الكبيرة جدًا للمساحة والوقت، تجرى بعض التقريبات. من الممكن، على الرغم من أنّه غير مرجّح، أن يبلّغ Memcheck عن أصل غير صحيح، أو لا يكون قادرًا على تحديد أي أصل.</p><p>لاحظ أن مجموعة <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> و<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> غير منطقية. يتحقّق Memcheck من هذا المزيج ويرفضه عند بدء التشغيل.</p></body></html>
ca: <html><head/><body><p>Controla si el Memcheck traça l'origen dels valors no inicialitzats. No ho fa de manera predeterminada, i encara que pugui informar que s'està usant un valor no inicialitzat de manera perillosa, no pot informar d'on ve el valor no inicialitzat. Amb freqüència això dificulta rastrejar el problema arrel.</p><p>Quan s'estableix a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, el Memcheck manté la traça dels orígens de tots els valors no inicialitzats. Llavors, quan s'informa d'un valor no inicialitzat, el Memcheck intentarà mostrar l'origen del valor. Un origen pot ser un dels quatre llocs següents: un bloc de la memòria en monticles, una assignació de la pila, una sol·licitud del client, o altres fonts diverses (p. ex., una crida a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Per als valors no inicialitzats originats en un bloc de la memòria en monticles, el Memcheck mostra a on s'ha assignat el bloc. Per als valors no inicialitzats originats des d'una assignació de la pila, el Memcheck pot informar la funció que ha assignat el valor, però no més que això -- normalment mostra la ubicació del codi font de la clau d'obertura de la funció. Així que cal comprovar curosament que totes les variables locals de la funció estan inicialitzades adequadament. </p><p>Sobrecàrrega del rendiment: la traça de l'origen és costosa. Redueix a la meitat la velocitat del Memcheck i incrementa l'ús de la memòria amb un mínim de 100 MB, i potser més. Tanmateix, pot reduir força l'esforç requerit per a identificar la causa arrel dels errors de valors no inicialitzats, i per tant, és un guany per a la productivitat del programador, encara que s'executi més lentament. </p><p>Precisió: el Memcheck traça els orígens amb força precisió. Per a evitar sobrecàrregues molt grans d'espai i temps, es fan diverses aproximacions. Encara que poc probable, el Memcheck podria informar un origen incorrecte, o que no sigui capaç d'identificar un origen.</p><p>Cal tenir en compte que la combinació de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> i <span style=" font-family:'Monospace';font-weight:600; font-style:italic;">--undef-value-errors=no</span> no té sentit. El Memcheck comprova i rebutja aquesta combinació a l'inici.</p></body></html>
eo: <html><head/><body><p>Regas ĉu Memcheck spuras la originon de nekomencigitaj valoroj. Defaŭlte, ĝi ne faras, kio signifas ke kvankam ĝi povas diri al vi ke nekomencigita valoro estas uzata en danĝera maniero, ĝi ne povas diri al vi de kie venis la nekomencigita valoro. Ĉi tio ofte malfaciligas spuri la radikan problemon.</p><p>Kiam estas agordita al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">jes</span>, Memcheck konservas la originojn de ĉiuj nekomencigitaj valoroj. Tiam, kiam nekomencigita valoreraro estas raportita, Memcheck provos montri la originon de la valoro. Origino povas esti unu el la sekvaj kvar lokoj: amasbloko, stak-atribuo, klientpeto aŭ diversaj aliaj fontoj (ekz., voko al <span style=" font-family:'Monospace'; font-weight :600; font-style:italic;">brk</span>).</p><p>Por nekomencigitaj valoroj devenantaj de amasbloko, Memcheck montras kie la bloko estis asignita. Por neinicialigitaj valoroj devenantaj de staka atribuo, Memcheck povas diri al vi kiu funkcio asignis la valoron, sed ne pli ol tio -- kutime ĝi montras al vi la fontlokon de la malferma krampo de la funkcio. Do vi zorge kontrolu, ke ĉiuj lokaj variabloj de la funkcio estas pravigitaj ĝuste. </p><p>Efikeco superkoste: originspurado estas multekosta. Ĝi duonigas la rapidecon de Memcheck kaj pliigas memoruzon je minimume 100MB, kaj eble pli. Tamen ĝi povas draste redukti la fortostreĉon postulatan por identigi la radikan kaŭzon de neinicialigitaj valoreraroj, kaj tiel ofte estas gajno de programisto produktiveco, malgraŭ kurado pli malrapide. </p><p>Precizeco: Memcheck spuras originojn sufiĉe precize. Por eviti tre grandajn spac- kaj tempajn superkostojn, kelkaj proksimumadoj estas faritaj. Eblas, kvankam neverŝajne, ke Memcheck raportos malĝustan originon, aŭ ne povos identigi ajnan originon. </p><p>Rimarku, ke la kombinaĵo <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> kaj <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> estas sensenca. Memcheck kontrolas kaj malakceptas ĉi tiun kombinaĵon ĉe ekfunkciigo.</p></body></html>
es: <html><head/><body><p>Controla si Memcheck rastrea el origen de los valores sin inicializar. De forma predeterminada no se hace, lo que significa que aunque le diga que un valor sin inicializar se está usando de forma peligrosa, no podrá indicarle de dónde viene dicho valor sin inicializar. Esto hace que a menudo sea difícil de rastrear la raíz del problema.</p><p>Cuando se usa <span style="font-family:'Monospace'; font-weight:600; font-style:italic;">sí</span>, Memcheck sigue el rastro del origen de los valores sin inicializar. En este caso, cuando se informa de un error de valor sin inicializar, Memcheck tratará de mostrar el origen de dicho valor. El origen puede ser cualquiera de los siguientes cuatro lugares: un bloque del montículo, una asignación en la pila, una petición cliente u otros orígenes diversos (por ejemplo, una llamada a <span style="font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Para los valores sin inicializar que tienen su origen en un bloque del montículo, Memcheck muestra dónde se ha asignado el bloque. Para los valores sin inicializar que tienen su origen en una asignación de la pila, Memcheck puede decirle qué función ha asignado el valor, pero no mucho más (por lo general se muestra la ubicación en el código fuente de la llave de apertura de la función). Por ello, debería comprobar cuidadosamente que todas las variables locales de la función se inicializan de forma correcta.</p><p>Merma del rendimiento: el rastreo del origen es costoso. Divide por dos la velocidad de Memcheck e incrementa el uso de memoria un mínimo de 100 MB, aunque posiblemente sea más. Sin embargo, puede reducir drásticamente el esfuerzo necesario para identificar la raíz del problema de los valores sin inicializar, por lo que suele ser una ventaja para la productividad de los programadores, a pesar de su escasa velocidad.</p><p>Precisión: Memcheck rastrea el origen con bastante precisión. Para evitar grandes sobrecargas de espacio y de tiempo, se realizan algunas aproximaciones. Es posible, aunque poco probable, que Memcheck informe de un origen incorrecto, o que no sea capaz de identificar algún origen.</p><p>Tenga en cuenta que la combinación de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span>no tiene sentido. Memcheck comprueba y rechaza esta combinación cuando se ejecuta.</p></body></html>
fr: <html><head/><body><p>Contrôle si Memcheck doit ou non pister l'origine des variables non initialisées. Par défaut, il ne le fait pas, ce qui signifie que même s'il peut vous indiquer qu'une variable non initialisée est utilisée d'une façon dangereuse, il ne peut vous dire d'où cette variable non initialisée provient. Ceci rend souvent difficile la recherche de la cause racine.</p> <p>Quand l'option est positionnée à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, Memcheck conserve la trace des provenance de toutes les variables non initialisées. Alors, quand une erreur de valeur non initialisée est signalée, Memcheck essayera d'afficher l'origine de la variable. L'origine peut être une des quatre emplacements suivants : un bloc du tas local, une allocation dans la pile, une requête client ou diverses autres sources (i.e. un appel à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p> Pour les origines des variables non initialisées concernant le bloc de tas local, Memcheck affiche où le bloc a été alloué. Pour les origines des variables non initialisées concernant une allocation dans la pile, Memcheck peut vous indiquer quelle fonction a alloué la valeur mais rien de plus que cela -- classiquement, il vous indique l'emplacement source de la parenthèse ouvrante de la fonction. Ainsi, vous pouvez vérifier avec soin, que toutes les variables locales sont correctement initialisées. </p><p>Impact sur les performances : la recherche de l'origine est coûteux. cela réduit de moitié l'exécution de Memcheck et accroît l'utilisation mémoire de 100 Mo voir plus. Cependant, il peut réduire drastiquement l'effort nécessaire pour identifier la cause racine pour les erreurs de variables non initialisées. Ainsi, cela reste un gain de productivité pour le développeur même si l'exécution est très ralentie. </p><p>Précision : Memcheck piste les origines de façon assez précise. Pour éviter la perte de temps et de beaucoup d'espace mémoire, certaines approximations sont faites. Il est possible, bien que peu probable, que Memcheck indiquera une origine incorrecte ou ne sera pas capable d'identifier l'origine. </p><p>Veuillez noter que les options <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> et <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> sont sans intérêt. Memcheck les vérifie et rejette cette association au démarrage.</p></body></html>
gl: <html><head/><body><p>Controla se Memcheck fai un seguimento da orixe dos valores sen inicializar. De maneira predeterminada non o fai, o que significa que aínda que pode informar de que se usa un valor sen inicializar dunha maneira perigosa, non pode informar de onde saíu o valor sen inicializar. Isto adoita dificultar a tarefa de atopar a raíz do problema.</p> <p>Cando o seu valor é <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">si</span>, Memcheck fai seguimento da orixe de todos os valores sen inicializar. Entón, cando se informa dun erro de valor sen inicializar, Memcheck intentará mostrar a orixe do valor. A orixe pode ser un dos seguintes catro valores: un bloque do monte (heap), unha asignación da rima (stack), unha solicitude do cliente ou outras fontes (por exemplo unha chamada a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Para os valores sen inicializar que se orixinen nun bloque do monte Memcheck mostra onde se asignou o bloque. Para valores sen inicializar que se orixinen nunha asignación da rima, Memcheck indícalle que función asignou o valor, pero nada máis; normalmente mostra o lugar do código onde está a chave inicial da función, así que debería comprobar coidadosamente que todas as variábeis locais da función se inicializan correctamente.</p><p>Sobre o efecto no rendemento, facer un seguimento da orixe é caro. Reduce a velocidade de Memcheck á metade e aumenta o uso de memoria polo menos en 100MB, e posibelmente máis. Porén, pode reducir de maneira drástica o esforzo necesario para identificar a raíz de erros de valores sen inicializar, polo que adoita pagar a pena no que respecta á produtividade do programados, a pesar de executarse máis lentamente.</p> <p>Sobre a súa precisión, Memcheck fai seguimento da orixe de maneira bastante precisa. Para evitar un custo adicional moi grande de espazo e tempo, fanse algunhas aproximacións. É posíbel, aínda que pouco probábel, que Memcheck informe dunha orixe incorrecta, ou que non sexa capaz de identificar a orixe.</p> <p>Teña en conta que a combinación de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> non ten sentido. Memcheck comproba que non se use esta combinación ao iniciarse.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, უნდა ადევნოს თუ არა თვალი Memcheck-მა არაინიციალიზებული მნიშვნელობების წარმოშობას. ნაგულისხმევად, ის ამას არ აკეთებს, რაც ნიშნავს, რომ მიუხედავად იმისა, რომ მას შეუძლია გითხრათ, რომ არაინიციალიზებული მნიშვნელობა გამოიყენება სახიფათო გზით, მას არ შეუძლია გითხრათ, საიდან გაჩნდა ეს მნიშვნელობა. ეს ხშირად ართულებს პრობლემის ძირეული მიზეზის პოვნას.</p><p>როდესაც არჩეულია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, Memcheck აღრიცხავს ყველა არაინიციალიზებული მნიშვნელობის წარმოშობას. ამ შემთხვევაში, როდესაც არაინიციალიზებული მნიშვნელობის შეცდომა დაფიქსირდება, Memcheck შეეცდება აჩვენოს მისი სათავე. წარმოშობის ადგილი შეიძლება იყოს ოთხიდან ერთ-ერთი: დინამიური მეხსიერების (heap) ბლოკი, სტეკზე გამოყოფა, კლიენტის მოთხოვნა ან სხვა სხვადასხვა წყარო (მაგალითად, ფუნქცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>-ის გამოძახება).</p><p>დინამიური მეხსიერების ბლოკიდან წარმოშობილი მნიშვნელობებისთვის Memcheck აჩვენებს, თუ სად მოხდა ბლოკის გამოყოფა. სტეკიდან წარმოშობილი მნიშვნელობებისთვის Memcheck გეტყვით, თუ რომელმა ფუნქციამ გამოყო ეს მნიშვნელობა, მაგრამ მეტს ვერაფერს — როგორც წესი, ის აჩვენებს ფუნქციის გამხსნელი ფრჩხილის ადგილმდებარეობას კოდში. ამიტომ, ყურადღებით უნდა შეამოწმოთ, რომ ფუნქციის ყველა ლოკალური ცვლადი სწორად არის ინიციალიზებული.</p><p>წარმადობა: წარმოშობის მიკვლევა რესურსების მხრივ ძვირია. ის ანახევრებს Memcheck-ის სიჩქარეს და ზრდის მეხსიერების მოხმარებას მინიმუმ 100MB-ით, შესაძლოა მეტითაც. მიუხედავად ამისა, მას შეუძლია მკვეთრად შეამციროს არაინიციალიზებული მნიშვნელობის შეცდომების ძირეული მიზეზის დასადგენად საჭირო ძალისხმევა, რაც ხშირად პროგრამისტის პროდუქტიულობის ზრდას ნიშნავს, შენელებული მუშაობის მიუხედავად.</p><p>სიზუსტე: Memcheck საკმაოდ ზუსტად ადევნებს თვალს წარმოშობას. მეხსიერების და დროის ძალიან დიდი დანახარჯების თავიდან ასაცილებლად, ზოგიერთი მიახლოება მაინც გამოიყენება. შესაძლებელია, თუმცა ნაკლებად სავარაუდო, რომ Memcheck-მა არასწორი წარმოშობა აჩვენოს ან საერთოდ ვერ დაადგინოს იგი.</p><p>გაითვალისწინეთ, რომ კომბინაცია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> აზრს მოკლებულია. Memcheck ამოწმებს და ბლოკავს ამ კომბინაციას გაშვებისას.</p></body></html>
ko: <html><head/><body><p>Memcheck에서 초기화되지 않은 값의 추적을 제어합니다. 기본값으로는 추적하지 않으며, 초기화되지 않은 값을 잘못 사용하고 있음을 안내할 수는 있으나 해당 값이 어디에서 오는지는 안내할 수 없습니다. 문제의 근원을 추적하기 어려워질 수도 있습니다.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>로 설정하면 Memcheck에서 초기화되지 않은 모든 값의 근원을 추적합니다. 초기화되지 않은 값 오류가 보고되었을 때 Memcheck에서는 값의 근원을 표시합니다. 다음 중 하나일 수 있습니다: 힙 블록, 스택 할당, 클라이언트 요청, 기타 다른 곳(예: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span> 호출).</p><p>초기화되지 않은 값이 힙 블록에서 왔다면 Memcheck에서는 블록이 할당된 곳을 표시합니다. 초기화되지 않은 값이 스택 할당에서 왔다면 Memcheck에서는 값을 할당한 함수만을 표시합니다. 대개의 경우 함수의 열린 괄호의 위치를 표시합니다. 해당 함수의 모든 지역 변수가 올바르게 할당되었는지 확인하십시오. </p><p>성능 오버헤드: 근원 추적은 자원이 많이 필요합니다. Memcheck의 속도를 절반 가까이 줄이고 최소한 100 MB 이상의 메모리를 더 사용합니다. 반면 초기화되지 않은 값 오류의 근원을 더 잘 추적할 수 있으며, 프로그래머의 생산성을 증가시킬 수 있습니다. </p><p>정확도: Memcheck의 근원 추적은 대개 정확합니다. 공간과 시간 오버헤드를 피하기 위해서 일부 가정을 적용합니다. 일부 경우 Memcheck에서 잘못된 근원을 표시하거나 근원을 표시하지 못할 수도 있습니다. </p><p>메모: <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span>와 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span>를 같이 지정하는 것은 무의미합니다. Memcheck가 실행될 때 이러한 조합을 거절합니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in of Memcheck de oorsprong van ongeïnitialiseerde waarden moet uitzoeken. Standaard doet het dat niet, wat inhoud dat ofschoon het u wel kan vertellen dat een ongeïnitialiseerd waarde op een gevaarlijke manier wordt gebruikt, het u niet kan vertellen wat oorsprong van de ongeïnitialiseerd waarde is. Dit maakt het vaak moeilijk om de oorsprong van het probleem te vinden.</p><p>Bij <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, houd Memcheck de oorsprong van alle ongeïnitialiseerde waarden bij. Zodat bij een foutmelding over een ongeïnitialiseerde waarde, Memcheck zal proberen om de oorsprong van de waarde te tonen. De oorsprong kan een van de volgende vier plaatsten zijn: een heap blok, een stack allocatie, een client request, of verschillende andere bronnen (b.v., een aanroep naar <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Bij ongeïnitialiseerde waarden vanuit een heap blok, toont Memcheck waar het blok was gealloceerd. Bij ongeïnitialiseerde waarden vanuit een stack allocatie, kan Memcheck u vertellen welke functie de waarde alloceerde, maar meer ook niet -- standaard toont het u de locatie van de opening-accolade ('{' ) van de functie. U moet dan zelf nauwkeurig controleren of alle lokale variabelen van de functie goed worden geïnitialiseerd. </p><p>Performance overhead: de oorsprong opzoeken is duur. Het halveert de snelheid van Memcheck's en vergroot het geheugengebruik met minimaal 100MB, en misschien nog meer. Maar het kan drastisch de voor het vinden van de oorsprong van de ongeïnitialiseerde waarde benodigde inspanning reduceren, en verbeterd vaak de productiviteit van de programmeur, ondanks dat het langzamer werkt. </p><p>Accuraatheid: Memcheck vindt de oorsprong redelijk accuraat. Om beslag op grote hoeveelheden opslagruimte en tijd te vermijden, worden enkele benaderingen gemaakt. Het is daardoor mogelijk, maar onwaarschijnlijk, dat Memcheck een incorrecte oorsprong rapporteert, of geen oorsprong kan aanwijzen. </p><p>Merk op dat de combinatie <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> onzinnig is. Bij opstarten Memcheck controleert op deze combinatie en verwerpt deze vervolgens.</p></body></html>
pl: <html><head/><body><p>Określa czy Memcheck śledzi początek niezainicjowanych wartości. Domyślnie tego nie robi, co oznacza, że może ci powiedzieć o tym, że niezainicjowana wartość jest używana w niebezpieczny sposób, lecz nie może ci powiedzieć skąd ona pochodzi. Często utrudnia to dotarcie do źródła problemu.</p><p>Gdy ustawione na <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">tak</span>, Memcheck dociera do źródła niezainicjowanych wartości. W przypadku, w którym zostanie złoszony błąd niezainicjowanej wartości, , Memcheck spróbuje pokazać źródło wartości. Źródłem może być jedno z czerech miejc: blok na stercie, przydział na stosie, żądanie klienta lub inne źródła (np., wywołanie <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Dla niezainicjowanych wartości z bloku sterty, Memcheck pokazuje miejsce przydziału bloku. Dla niezainicjowanych wartości przydzielonych na stosie, Memcheck może powiedzić która funkcja przydzieliła wartość, lecz nic ponadto-- zazwyczaj pokazywane jest miejsce źródłowe otwierającego nawiasu klamrowego fukcji. Tak więc powinieneś ostrożnie sprawdzić, czy wszystkie lokalne wartości funkcji zostały poprawnie zainicjowane. </p><p>Narzut wydajnościowy: śledzenie źródła jest kosztowe. Dzieli szybkość Memchecka na pół i zwiększa wykorzystanie pamięci o minimum 100MB, a zazwyczaj więcej. Jednakże może znacznie zmniejszyć wysiłek potrzebny na namierzenie głównej przyczyny błędów z niezainicjowaną wartością, a przez to jest często korzyścią dla programisty, mimo wolniejszego działania . </p><p>Dokładność: Memcheck śledzi źródło całkiem dokładnie. Aby uniknąć bardzo dużego narzutu pamięci i czasu, robione są różne przybliżenie. Możliwym jest, lecz mało prawdopodobny,, że Memcheck zgłosi niepoprawne źródło, lub nie będzie w stanie namierzyć źródła. </p><p>Zauważ, że kombinacja <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> wraz z <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> nie ma sensu. Memcheck sprawdza istnienie tej kombinacji i odrzuca ją już na samym początku.</p></body></html>
pt: <html><head/><body><p>Controla se o Memcheck regista a origem dos valores não-inicializados. Por omissão não o faz, o que significa que, ainda que lhe possa dizer que um valor não-inicializado está a ser usado de forma perigosa, não lhe consegue dizer de onde vem esse valor não-inicializado. Isto dificulta muitas vezes a localização do problema de base.</p><p>Se for igual a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, o Memcheck mantém um registo das origens de todos os valores não-inicializados. Depois, quando for relatado um erro de valores não-inicializados, o Memcheck irá tentar mostrar a origem do valor. Uma origem poderá ser um dos seguintes quatro locais: um bloco da memória de dados, uma alocação na pilha, um pedido do cliente ou de outras fontes diversas (p.ex., uma chamada ao <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Para os valores não-inicializados que provêm de um bloco da memória de dados, o Memcheck mostra onde o bloco foi alocado. Para os valores não-inicializados provenientes de uma alocação da pilha, o Memcheck poder-lhe-á dizer qual a função que alocou o valor, mas não mais que isso -- tipicamente mostra-lhe o local no código da chaveta de abertura da função. Como tal, deverá verificar se todas as variáveis locais da função são inicializadas de forma adequada.</p><p>Sobrecarga de performance: o registo da origem é dispendioso. Reduz a velocidade do Memcheck a metade e aumenta o uso de memória em aproximadamente 100MB, ou possivelmente mais. Contudo, poderá reduzir de forma drástica o esforço necessário para identificar a causa de base dos erros de valores não-inicializados, sendo normalmente um ganho de produtividade para o programador, apesar da sua execução mais lenta. </p><p>Precisão: o Memcheck regista as origens de forma bastante precisa. Para evitar grandes sobrecargas de espaço e tempo, são feitas algumas aproximações. É possível, ainda que improvável, que o Memcheck comunique uma origem incorrecta ou não seja capaz de identificar nenhuma origem de todo.</p><p>Lembre-se que a combinação <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> não faz sentido. O Memcheck valida e rejeita esta combinação no arranque.</p></body></html>
pt_br: <html><head/><body><p>Controla se o Memcheck rastreia a origem de valores não inicializados. Por padrão, não o faz, o que significa que, embora possa informar que um valor não inicializado está sendo usado de forma perigosa, não pode informar de onde veio o valor não inicializado. Isso geralmente dificulta a localização da raiz do problema.</p><p>Quando definido como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, o Memcheck rastreia as origens de todos os valores não inicializados. Então, quando um erro de valor não inicializado for relatado, o Memcheck tentará mostrar a origem do valor. Uma origem pode ser um dos quatro seguintes locais: um bloco de heap, uma alocação de pilha, uma solicitação de cliente ou diversas outras fontes (por exemplo, uma chamada para <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Para valores não inicializados originados de um bloco de heap, o Memcheck mostra onde o bloco foi alocado. Para valores não inicializados originados de uma alocação de pilha, o Memcheck pode informar qual função alocou o valor, mas não mais do que isso — normalmente, ele mostra o local de origem da chave de abertura da função. Portanto, você deve verificar cuidadosamente se todas as variáveis ​​locais da função foram inicializadas corretamente.</p><p>Sobrecarga de desempenho: o rastreamento de origem é caro. Ele reduz pela metade a velocidade do Memcheck e aumenta o uso de memória em no mínimo 100 MB, e possivelmente mais. No entanto, pode reduzir drasticamente o esforço necessário para identificar a causa raiz de erros de valores não inicializados e, portanto, costuma ser um ganho de produtividade para o programador, apesar de ser executado mais lentamente. </p><p>Precisão: O Memcheck rastreia as origens com bastante precisão. Para evitar grandes sobrecargas de espaço e tempo, algumas aproximações são feitas. É possível, embora improvável, que o Memcheck relate uma origem incorreta ou não consiga identificar nenhuma origem. </p><p>Observe que a combinação <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> é sem sentido. O Memcheck verifica e rejeita essa combinação na inicialização.</p></body></html>
sv: <html><head/><body><p>Bestämmer om Memcheck spårar ursprunget till oinitierade värden. Normalt görs det inte, vilket betyder att även om det går att tala om att ett oinitierat värde används på ett farligt sätt, går det inte att tala om var det oinitierade värdet kom från. Det gör det ofta svårt att spåra problemets grundorsak.</p><p>När det är inställt till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span> håller Memcheck reda på ursprunget till alla oinitierade värden. Därefter, när ett oinitierat värdefel rapporteras, försöker Memcheck visa värdets ursprung. Ursprunget kan vara någon av följande fyra platser: ett heap-block, en stacktilldelning, en klientbegäran eller diverse andra källor (t.ex. ett anrop till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>För oinitierade värden som har sitt ursprung i ett heap-block, visar Memcheck var blocket tilldelades. För oinitierade värden som har sitt ursprung i en stacktilldelning, kan Memcheck tala om för dig vilken funktion som tilldelade värdet, men inte mer än så: oftast visar det platsen i källkoden för funktionens inledande klammerparentes. Då bör du noga kontrollera att alla funktionens lokala variabler initieras riktigt.</p><p>Prestandakostnad: ursprungsspårning är dyr. Den halverar Memchecks hastighet och ökar minnesanvändningen med minst 100 MB, möjligen ännu mer. Trots det kan den drastiskt reducera ansträngningen som krävs för att identifiera grundorsaken till oinitierade värdefel, och är ofta en vinst i programmeringsproduktivitet, trots den långsammare körningen.</p><p>Noggrannhet: Memcheck spårar ursprung riktigt noga. För att undvika mycket stora kostnader i utrymme och tid, görs vissa approximationer. Det är möjligt, även om det inte är troligt, att Memcheck rapportera ett felaktigt ursprung eller inte kan identifiera något ursprung alls.</p><p>Observera att kombinationen <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> är meningslös. Memcheck kontrollerar och förkastar kombinationen vid start.</p></body></html>
tr: <html><head/><body><p>Memcheck'in başlatılmamış değerlerin kaynağını izleyip izlemediğini kontrol eder. Varsayılan olarak yapmaz, bu da size başlatılmamış bir değerin tehlikeli bir şekilde kullanıldığını söyleyebilse de, başlatılmamış değerin nereden geldiğini söyleyemeyeceği anlamına gelir. Bu genellikle temel sorunun izini sürmeyi zorlaştırır.</p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes olarak ayarlandığında </span>, Memcheck başlatılmamış tüm değerlerin kökenlerini takip eder. Ardından, başlatılmamış bir değer hatası bildirildiğinde, Memcheck değerin kaynağını göstermeye çalışır. Bir kaynak şu dört yerden biri olabilir: Bir yığın bloku, bir yığın tahsisi, bir istemci isteği veya çeşitli diğer kaynaklar (örneğin, bir <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span> çağrısı).</p><p>Bir yığın bloğundan kaynaklanan başlatılmamış değerler için Memcheck, bloğun nereye tahsis edildiğini gösterir. Yığın tahsisinden kaynaklanan başlatılmamış değerler için, Memcheck size değeri hangi işlevin tahsis ettiğini söyleyebilir, ancak bundan fazlasını değil - tipik olarak size işlevin açılış ayracının kaynak konumunu gösterir. Bu nedenle, işlevin tüm yerel değişkenlerinin doğru şekilde başlatıldığını dikkatlice denetlemelisiniz. </p><p>Başarım yükü: Kaynak takibi pahalıdır. Memcheck'in hızını yarıya indirir ve bellek kullanımını minimum 100MB ve muhtemelen daha fazla artırır. Bununla birlikte, başlatılmamış değer hatalarının temel nedenini belirlemek için gereken çabayı büyük ölçüde azaltabilir ve bu nedenle, daha yavaş çalışmasına rağmen genellikle bir programcı üretkenliği kazanır. </p><p>Doğruluk: Memcheck, kökenleri oldukça doğru bir şekilde takip eder. Kaçınmak çok büyük uzay ve zaman giderleri, bazı yaklaşımlar yapılmıştır. Muhtemel olmasa da Memcheck'in yanlış bir menşe bildirmesi veya herhangi bir menşe belirleyememesi mümkündür. </p><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> anlamsızdır. Memcheck, başlangıçta bu kombinasyonu denetler ve reddeder.</p></body></html>
uk: <html><head/><body><p>Керує тим, чи стежитиме Memcheck за походженням неініціалізованих значень. Типово, програма цього не робить, що означає, що хоча програма може повідомити вам, що у небезпечний спосіб використано неініціалізоване значення, вона не зможе повідомити вам, звідки прийшло це неініціалізоване значення. Це часто ускладнює визначення джерела проблеми.</p><p>Якщо встановити значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>, Memcheck стежитиме за походженням усіх неініціалізованих значень. Таким чином, коли до звіту потраплятиме повідомлення щодо помилки, пов’язаної із неініціалізованим значенням, Memcheck намагатиметься показати дані щодо походження значення. Походженням може бути одне з чотирьох місць: блок «купи», область розміщення даних зі стека, клієнтський запит або різні інші джерела (наприклад виклик <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span>).</p><p>Для неініціалізованих значень зі блоку «купи» Memcheck показує дані щодо того, де було отримано для розміщення цей блок. Для неініціалізованих значень, що походять з області розміщення даних зі стека, Memcheck може повідомити вам назву функції, яка розмістила значення, але не більше — типово, програма показує вам розташування у коді початкової фігурної дужки цієї функції. Отже, вам доведеться ретельно перевірити, чи усі локальні змінні функції ініціалізовано належним чином.</p><p>Вплив на швидкодію: визначення походження є доволі витратною операцією. Воно вдвічі уповільнює роботу Memcheck і збільшує споживання пам’яті мінімум на 100 МБ, а може й більше. Втім, воно надзвичайно зменшує зусилля, які потрібні на визначення причини появи помилок щодо неініціалізованого значення, а отже, часто зростає продуктивність програміста, хоча обробка даних триває довше.</p><p>Точність: Memcheck визначає походження доволі точно. Для уникнення надмірного впливу на спожитий об’єм пам’яті та навантаження процесора використовуються певні наближення. Може так статися, хоча і з дуже низькою ймовірністю, що Memcheck повідомить неправильні дані щодо походження або взагалі не зможе визначити походження.</p><p>Зауважте, що поєднання <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> і <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> позбавлене сенсу. Memcheck виявляє такі поєднання параметрів під час запуску і відмовляється їх використовувати.</p></body></html>
zh_cn: <html><head/><body><p>控制 Memcheck 是否应追踪未初始化值的来源。默认情况下不追踪，也就是说虽然它能告诉你有未初始化值以危险的方式被使用了，它无法告诉你这个未初始化值的来源。这常常使得追寻根本问题的过程变得困难。</p><p>如果设置为<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">yes</span>，那么 Memcheck 会跟踪所有未初始化值的来源。这样，如果有个未初始化值错误被报告了，那么 Memcheck 会尝试显示这个值的来源。它可能来自以下四个地方之一：一个堆块，一个栈上的分配，一个客户请求，或者其它来源（例如，一个对 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">brk</span> 的调用）。</p><p>对来自堆块的未初始化值，Memcheck 会显示那个块的位置。对来自栈分配的未初始化值，Memcheck 会告诉你哪个函数分配了那个值，但仅止于此 —— 一般来说它会显示该函数的起始括号的源代码位置。这种情况下，您需要仔细检查该函数的所有本地变量是否都被正确初始化了。</p><p>性能开销：来源追踪比较昂贵。它会使得 Memcheck 的速度减半，并且至少增加 100MB 的内存使用量，可能更多。尽管如此，它可以大幅减少寻找未定义变量错误源头的努力，从而提升程序员的工作效率，即使它跑得更慢。</p><p>精度：Memcheck 能相当精确地追踪来源。要避免过大的空间和时间开销，我们进行了一些近似。Memcheck 依旧有可能报告一个错误的来源，或者无法找到任何来源，虽然这比较少见。</p><p>注意同时指定 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--track-origins=yes</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--undef-value-errors=no</span> 并没有意义。Memcheck 在启动时会检查并拒绝这种组合。</p></body></html>
