Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Specifies the set of leak check heuristics to be used during leak searches. The heuristics control which interior pointers to a block cause it to be considered as reachable.</p></body></html>
ar: <html><head/><body><p>يحدد مجموعة استدلالات فحص التسرّب التي يجب استخدامها أثناء عمليات بحث التسرّب. تتحكّم الاستدلالات في مؤشرات الكتلة الداخلية التي تتسبّب في اعتبارها قابلة للوصول.</p></body></html>
ca: <html><head/><body><p>Especifica el conjunt d'heurística de comprovació de fuites a usar durant les cerques de fuites. L'heurística controla quins apuntadors interiors d'un bloc es poden considerar com a accessibles.</p></body></html>
eo: <html><head/><body><p>Specifas la aron de heŭristiko de likkontrolo por esti uzata dum likserĉoj. La heŭristiko kontrolas kiuj internaj montriloj al bloko igas ĝin konsiderata kiel atingebla.</p></body></html>
es: <html><head/><body><p>Indica el conjunto de comprobaciones de fugas heurísticas a usar en las búsquedas de fugas. La heurística controla qué punteros interiores a un bloque hacen que se considere accesible.</p></body></html>
fr: <html><head/><body><p>Spécifie l'ensemble des heuristiques de vérification des fuites à utiliser durant la recherche de fuites. Les heuristiques contrôlent quels pointeurs internes vers un bloc le conduisent à être atteignable.</p></body></html>
gl: <html><head/><body><p>Indica o grupo de heurísticas de comprobación de perdas para usar durante as buscas de perdas. As heurísticas controlan que punteiros interiores a un bloque fan que se considere alcanzábel.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს გაჟონვის შემოწმების ევრისტიკების ნაკრებს, რომლებიც გამოყენებული იქნება გაჟონვების ძიებისას. ევრისტიკები აკონტროლებენ, თუ ბლოკის რომელი შიდა მიმთითებლები განაპირობებენ მის მიჩნევას მიღწევადად.</p></body></html>
ko: <html><head/><body><p>누수를 검사할 때 사용할 누수 검사 휴리스틱을 지정합니다. 휴리스틱은 어떤 블록을 향한 내부 포인터를 접근 가능한 것으로 간주할지 제어합니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in welke set van leak check heuristics worden gebruikt bij het zoeken naar leaks. De heuristics regelen welke interior pointers naar een blok als reachable worden beschouwd.</p></body></html>
pl: <html><head/><body><p>Określa zestaw heurustycznych sprawdzeń wycieków wykorzystywanych przy wyszukiwaniu wycieków. Heurustyka określa, które z wewnętrznych wskaźników do bloku sprawiają, że jest on postrzegany jako dostępny.</p></body></html>
pt: <html><head/><body><p>Define o conjunto de heurísticas de verificação de fugas a usar nas pesquisas. As heurísticas controlam quais os ponteiros interiores de um dado bloco a ter em consideração na acessibilidade.</p></body></html>
pt_br: <html><head/><body><p>Especifica o conjunto de heurísticas de verificação de vazamento a serem usadas durante as buscas por vazamento. As heurísticas controlam quais ponteiros internos para um bloco fazem com que ele seja considerado acessível.</p></body></html>
sv: <html><head/><body><p>Anger heuristikuppsättning för kontroll av läckor som ska användas under läcksökning. Heuristiken bestämmer vilka inre pekare till ett block som gör att det anses möjligt att nå.</p></body></html>
tr: <html><head/><body><p>Sızma aramaları sırasında kullanılacak sızma denetleme sezgiselleri dizisini belirtir. Sezgisel denetim </p></body></html>Bir bloğa iç işaretçilerin sezgisel denetimi onun ulaşılabilir olarak düşünülmesine sebep olur.</p></body></html>
uk: <html><head/><body><p>Вказує набір евристики для пошуку витоків. Евристика керує тим, які внутрішні вказівники на блоки вважатимуться досяжними.</p></body></html>
zh_cn: <html><head/><body><p>指定要用于泄漏搜索过程的泄漏检查策略集。这些策略控制了哪些指向一个块的内部指针会导致这个块被视为可达。</p></body></html>

source: Stacktraces keeping:
ar: استبقاء تسلسل مكدّس:
ca: Manteniment de traces de pila:
eo: Konservado de stakspuroj:
es: Conservación de trazas de la pila:
fr: Conservation des traces de piles :
gl: Mantemento de trazas de rima:
ka: სტეკის ტრეისების შენარჩუნება:
ko: 스택 추적 유지:
nl: Stacktraces bewaren:
pl: Zachowanie śladów stosu:
pt: Registos da pilha a manter:
pt_br: Manutenção de rastreamentos de pilha:
sv: Behåll stackspårningar:
tr: Yığın izleri korumak:
uk: Зберігання трасувань стека:
zh_cn: 保留的堆栈跟踪：
