Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Controls whether all activities during thread creation should be ignored. By default enabled only on Solaris. Solaris provides higher throughput, parallelism and scalability than other operating systems, at the cost of more fine-grained locking activity. This means for example that when a thread is created under glibc, just one big lock is used for all thread setup. Solaris libc uses several fine-grained locks and the creator thread resumes its activities as soon as possible, leaving for example stack and TLS setup sequence to the created thread. This situation confuses DRD as it assumes there is some false ordering in place between creator and created thread; and therefore many types of race conditions in the application would not be reported. To prevent such false ordering, this command line option is set to <span style=" font-family:'Monospace';">yes</span> by default on Solaris. All activity (loads, stores, client requests) is therefore ignored during:</p><p>* pthread_create() call in the creator thread </p><p>* thread creation phase (stack and TLS setup) in the created thread</p></body></html>
ar: <html><head/><body><p>يتحكّم فيما إذا كان يجب تجاهل كل الأنشطة أثناء إنشاء السلسلة. بشكل مبدئي يفعّل على Solaris فقط. يوفّر Solaris إنتاجية أعلى، توازي، و قابلية توسّع أكبر من أنظمة تشغيل أخرى، بكلفة نشاط قفل أدق. يعني هذا مثلاً أنه عندما تنشأ سلسلة تحت glibc، يستخدم قفل كبير واحد فقط لكل إعدادات السلسلة. تستخدم مكتبة Solaris libc عدة أقفال دقيقة و تستأنف سلسلة المنشئ أنشطتها في أقرب وقت ممكن، تارِكةً مثلاً المكدّس و تسلسل إعداد TLS للسلسلة المنشأة. يربك هذا الموقف DRD لأنه يفترض وجود بعض التّرتيب الخاطئ بين سلسلة المنشئ و السلسلة المنشأة؛ و لذلك لا يبلّغ عن أنواع كثيرة من ظروف التزاحم في التطبيق. لمنع مثل هذا التّرتيب الخاطئ، يضبط خيار سطر الأوامر هذا على <span style=" font-family:'Monospace';">yes</span> بشكل مبدئي على Solaris. بالتالي تجاهل كل الأنشطة (التحميلات، التخزين، طلبات العميل) أثناء:</p><p>* نداء ()pthread_create في سلسلة المنشئ </p><p>* مرحلة إنشاء السلسلة (إعداد المكدّس و TLS) في السلسلة المنشأة</p></body></html>
ca: <html><head/><body><p>Controla si cal ignorar totes les activitats durant la creació dels fils. De manera predeterminada, només està activat en el Solaris. El Solaris proporciona una velocitat de transferència de dades, un paral·lelisme i una escalabilitat més altes que altres sistemes operatius, amb un cost més gran d'activitat de bloqueig més granular. Això vol dir, per exemple, que quan es crea un fil amb la «glibc», només s'usa un bloqueig gran per a tota la configuració del fil. La «libc» del Solaris usa diversos bloqueigs granulars i el fil creador reprèn les seves activitats tan aviat com sigui possible, deixant, per exemple, la configuració de la pila i del TLS al fil creat. Aquesta situació és confusa pel DRD, ja que assumeix que hi ha una ordenació falsa entre el fil creador i el creat; i per tant, moltes condicions de situació de competició de l'aplicació no s'informen. Per a evitar aquesta ordenació falsa, aquesta opció de la línia d'ordres es defineix a <span style=" font-family:'Monospace';">sí</span> de manera predeterminada en el Solaris. Tota l'activitat (càrregues, emmagatzematges, peticions del client) s'ignora durant:</p><p>* la crida «pthread_create()» en el fil creador </p><p>* la fase de creació del fil (configuració de la pila i el TLS) al fil creat</p></body></html>
eo: <html><head/><body><p>Regas ĉu ĉiuj agadoj dum kreado de fadenoj estu ignoritaj. Defaŭlte ebligita nur ĉe Solaris. Solaris disponigas pli altan trairon, paralelecon kaj skaleblon ol aliaj operaciumoj, koste de pli fajngrajna ŝlosa agado. Ĉi tio signifas ekzemple ke kiam fadeno estas kreita sub glibc, nur unu granda seruro estas uzata por ĉiuj fadenaj aranĝoj. Solaris libc uzas plurajn fajnajn serurojn kaj la kreinto-fadeno rekomencas siajn agadojn kiel eble plej baldaŭ, lasante ekzemple stakon kaj TLS-agordan sekvencon al la kreita fadeno. Ĉi tiu situacio konfuzas DRD ĉar ĝi supozas ke ekzistas iu malvera ordigo modloko inter kreinto kaj kreita fadeno; kaj tial multaj specoj de raskondiĉoj en la aplikaĵo ne estus raportitaj. Por malhelpi tian falsan mendon, ĉi tiu komandlinia opcio estas agordita al <span style=" font-family:'Monospace';">jes</span> defaŭlte ĉe Solaris. Ĉia agado (ŝarĝoj, butikoj, klientpetoj) estas do ignorita dum:</p><p>* pthread_create() voko en la kreinta fadeno </p><p>* fadeno de kreado (stako kaj TLS-agordo) en la kreita fadeno</p></body></html>
es: <html><head/><body><p>Controla si se deben ignorar todas las actividades durante la creación de hilos. Por omisión, solo está activada en Solaris. Solaris proporciona un alto rendimiento, paralelismo y escalabilidad superiores a los de otros sistemas operativos, a costa de una actividad de bloqueo más detallada. Esto significa, por ejemplo, que cuando «glibc» crea un hilo, solo se usa un gran bloqueo para toda la configuración del hilo. La biblioteca «libc» de Solaris usa varios bloqueos más detallados y el hilo creador continúa sus actividades tan pronto como sea posible, dejando la secuencia de configuración de la pila y de TLS a los hilos que ha creado. Esta situación confunde a DRD, ya que asume que existe cierto orden falso entre el hilo creador y los hilos creados; de ahí que muchos tipos de condiciones de carrera de la aplicación no se lleguen a notificar. Para impedir este falso orden, esta opción de la línea de órdenes se define como <span style=" font-family:'Monospace';">yes</span> de forma predeterminada en Solaris. Por ello, toda actividad (cargas, almacenamientos, peticiones de clientes) se ignora durante:</p><p>* la llamada a «pthread_create()» en el hilo creador</p><p>* la fase de creación de hilos (configuración de la pila y de TLS) en los hilos creados</p></body></html>
fr: <html><head/><body><p>Contrôle si toutes les activités durant la création du process doivent être ignorées. Par défaut, cette option n'est activée que pour « Solaris ». Solaris met à disposition plus de capacités, de parallélisme et d'extensibilité que d'autres systèmes d'exploitation, au coût d'une activité de verrouillage plus finement adaptée. Ceci signifie par exemple que lorsqu'un processus est créé sous « glibc », un seul verrouillage de grande taille est utilisé pour le paramétrages de tous les processus. La bibliothèque « libc » de « Solaris » utilise plusieurs verrous très précis et le processus de création reprend ses activités dès que possible, en quittant par exemple, la séquence de paramétrage de la pile et du module « TLS ». Cette situation perturbe « DRD », qui considère qu'il y a un ordonnancement incorrect en cours, entre le créateur de processus et le processus créé. Ainsi, les types d'accès concurrents de l'application ne seront pas signalés. Pour prévenir ces ordonnancements incorrects, l'option en ligne de commandes est <span style=" font-family:'Monospace';">yes</span> par défaut pour Solaris. Toutes les activités (chargements, enregistrements, requêtes vers client) sont ainsi ignorés durant :</p><p>* l'appel à « pthread_create() » dans le processus créateur</p><p>* la phase de création du processus (paramétrage de la pile et de « TLS ») dans le processus créé.</p></body></html>
gl: <html><head/><body><p>Controla se deben ignorarse todas as actividades durante a creación de fíos. Só está activado de maneira predeterminada en Solaris. Solaris fornece un maior rendemento, paralelismo e escalabilidade que outros sistemas operativos, a cambio dunha actividade de bloqueo máis granular. Isto significa por exemplo que cando se crea un fío baixo glibc, úsase un único, gran bloqueo para a preparación de todos os fíos. A libc de Solaris usa varios bloqueos granulares e o fío creador continúa a súa actividade o antes posíbel, deixando a secuencia de preparación do montón e de TLS ao fío creado. Esta situación confunde a DRD, que asume que hai unha orde falsa entre o fío creador e o creado; e polo tanto non se informa de moitos dos tipos de condicións de carreira da aplicación. Para evitar esa orde falsa, estabelécese esta opción da liña de ordes a <span style=" font-family:'Monospace';">yes</span> (si) de maneira predeterminada en Solaris. Polo tanto toda a actividade (cargas, almacenamentos, solicitudes do cliente) ignórase durante:</p> <p>* a chamada a pthread_create() no fío creador, e</p> <p>* a fase de creación (preparación do montón e de TLS) no fío creado.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, უნდა იქნას თუ არა უგულებელყოფილი ყველა აქტივობა ნაკადის შექმნისას. ნაგულისხმევად ჩართულია მხოლოდ Solaris-ზე. Solaris სხვა ოპერაციულ სისტემებთან შედარებით უზრუნველყოფს უფრო მაღალ გამტარუნარიანობას, პარალელიზმს და მასშტაბირებადობას, რაც მიიღწევა დაბლოკვის უფრო დეტალური მექანიზმებით. ეს ნიშნავს, რომ მაგალითად, როდესაც ნაკადი იქმნება glibc-ით, ნაკადის გამართვისთვის გამოიყენება მხოლოდ ერთი დიდი ბლოკი. Solaris-ის libc იყენებს რამდენიმე დეტალურ ბლოკს და შემქმნელი ნაკადი აგრძელებს თავის საქმიანობას რაც შეიძლება მალე, ხოლო სტეკის და TLS-ის გამართვას უტოვებს შექმნილ ნაკადს. ეს ვითარება აბნევს DRD-ს, რადგან იგი ვარაუდობს, რომ არსებობს გარკვეული მცდარი თანმიმდევრობა შემქმნელ და შექმნილ ნაკადებს შორის; ამის გამო, აპლიკაციაში არსებული მრავალი სახის დავის პირობა შესაძლოა არ იქნას მოხსენებული. ასეთი მცდარი თანმიმდევრობის თავიდან ასაცილებლად, ეს ბრძანების პარამეტრი Solaris-ზე ნაგულისხმევად დაყენებულია მნიშვნელობაზე <span style=" font-family:'Monospace';">yes</span>. შესაბამისად, ყველა აქტივობა (ჩატვირთვა, შენახვა, კლიენტის მოთხოვნები) უგულებელყოფილია შემდეგი პროცესებისას:</p><p>* pthread_create() გამოძახება შემქმნელ ნაკადში </p><p>* ნაკადის შექმნის ფაზა (სტეკის და TLS-ის გამართვა) შექმნილ ნაკადში</p></body></html>
ko: <html><head/><body><p>스레드 생성 시 모든 활동을 무시할지 여부를 설정합니다. 기본값으로는 Solaris에서만 활성화되어 있습니다. Solaris는 잠금 활동을 더 미세하게 조정할 수 있는 대신 다른 운영 체제에 비해서 높은 대역폭, 병렬성, 확장성을 제공합니다. 이는 glibc에서 스레드를 생성할 때 모든 스레드 설정에 거대한 잠금 하나만을 사용함을 의미합니다. Solaris libc에서는 미세한 잠금 여러 개를 사용하고, 생성자 스레드는 최대한 빠르게 작업을 다시 시작하며, 생성된 스레드에서 스택과 TLS 설정 등을 진행합니다. DRD에서는 생성자와 생성된 스레드 사이에서 작업 순서가 잘못 진행되고 있다는 것으로 착각할 수 있으며, 앱의 경쟁 조건이 보고되지 않을 수도 있습니다. 잘못된 순서를 방지하기 위해서 이 명령행 옵션은 Solaris에서는 기본값으로 <span style=" font-family:'Monospace';">yes</span>로 설정됩니다. 이에 따라서 다음 작업 중 모든 활동(불러오기, 저장, 클라이언트 요청)을 무시합니다:</p><p>* 생성자 스레드에서의 pthread_create() 호출 </p><p>* 생성된 스레드에서의 스레드 생성 과정(스택과 TLS 설정)</p></body></html>
nl: <html><head/><body><p>Hiermee stelt u in of tijdens de creatie van een thread alle activiteit wordt genegeerd. Standaard alleen bij Solaris ingeschakeld. Solaris heeft hogere throughput, parallelliteit en schaalbaarheid dan andere besturingssystemen, ten koste van een fijnere instelling voor het locken. Dit houdt in dat als bijvoorbeeld onder glibc een thread wordt aangemaakt, er een grote lock is voor alle thread instellingen. Solaris libc gebruikt verschillende nauwkeurig ingestelde locks en de creator thread vervolgt zo snel mogelijk zijn activiteiten, waarbij bijvoorbeeld de aanmaak procedure voor de stack en de TLS wordt overgelaten aan de gecreëerde thread. Deze situatie verwart DRD omdat het aanneemt dat er een foute volgorde is tussen de aanmakende en gecreëerde thread; zodat er veel verschillende types race condities in het programma niet worden gemeld. Om deze foute volgorden te voorkomen, is bij Solaris deze commandoregel-optie standaard op <span style=" font-family:'Monospace';">yes</span> gezet. Daarom worden alle activiteiten (loads, stores, client requests) genegeerd tijdens:</p><p>* pthread_create() call in de creator thread </p><p>* thread creatie fase (stack en TLS aanmaak) in de gecreëerde thread</p></body></html>
pl: <html><head/><body><p>Określa czy wszystkie aktywności podczas tworzenie wątków mają być pomijane. Domyślnie jest to włączone na Solarisie. Solaris zapewnia lepszy przepływ danych, równobieżność oraz skalowalność niż inne systemy operacyjne kosztem dokładnej aktywności blokowania. Oznacza to, że jeśli wątek jest tworzony pod glibc, to używana jest jedna wielka blokada dla wszystkich ustawień wątku. Solaris libc używa kilku dokładnych blokad, a wątek tworzący wznawia wszystkie aktywności tak szybko jak to możliwe pozostawiając na przykład stos i sekwencję ustawień TLS utworzonemu wątkowi. Zdarzenie to myli DRD ponieważ przyjmuje, że istnieje zły porządek pomiędzy wątkiem tworzącym i tworzonym; stąd wiele rodzajów warunków gonitwy w aplikacji nie byłoby rejestrowanych. Aby uniknąć tego błednego porządkowania, ta opcja wiersza poleceń jest domyślnie ustawiona na <span style=" font-family:'Monospace';">tak</span> na Solarisie. Cała aktywność (wczytywania, zapisywanie, żądania klienta) są przez to pomijana:</p><p>*wywołanie pthread_create() w wątku tworzącym</p><p>*faza tworzenia wątku (stos i ustawienia TLS) w tworzonym wątku</p></body></html>
pt: <html><head/><body><p>Controla se todas as actividades durante a criação das tarefas devem ser ignoradas. Por omissão, só está activo no Solaris. O Solaris oferece mais débito, paralelismo e escalabilidade que os outros sistemas operativos, às custas de uma actividade de bloqueio mais controladas. Isto significa, por exemplo, que quando é criada uma nova tarefa na 'glibc', é usado apenas um grande bloqueio para toda a configuração da tarefa. A 'libc' do Solaris usa diversos bloqueios mais finos e a tarefa criadora retoma as suas actividades o mais rapidamente possível, deixando por exemplo a pilha e a sequência de configuração do TLS para a tarefa criada. Esta situação confunde o Helgrind, dado que assume que existe alguma ordenação falsa a tomar lugar entre a tarefa criadora e a tarefa criada; como tal, muitos tipos de condições erradas de concorrência na aplicação não seriam comunicadas. Para evitar essa ordenação falsa, esta opção da linha de comandos é configurada como activa por omissão no Solaris. Todas as actividades (leituras, gravações, pedidos de clientes) é ignorada por esse facto durante:</p><p>* a chamada 'pthread_create()' na tarefa criadora</p><p>* a fase de criação da tarefa (configuração da pilha e do TLS) na tarefa criada</p></body></html>
pt_br: <html><head/><body><p>Controla se todas as atividades durante a criação da thread devem ser ignoradas. Por padrão, habilitado apenas no Solaris. O Solaris oferece maior taxa de transferência, paralelismo e escalabilidade do que outros sistemas operacionais, ao custo de uma atividade de bloqueio mais refinada. Isso significa, por exemplo, que quando uma thread é criada sob a glibc, apenas um bloqueio grande é usado para toda a configuração da thread. A libc do Solaris usa vários bloqueios refinados e a thread criadora retoma suas atividades o mais rápido possível, deixando, por exemplo, a pilha e a sequência de configuração do TLS para a thread criada. Essa situação confunde o DRD, pois ele pressupõe que haja alguma ordem falsa entre a thread criadora e a criada; e, portanto, muitos tipos de condições de corrida no aplicativo não seriam relatados. Para evitar essa ordem falsa, esta opção de linha de comando é definida como <span style=" font-family:'Monospace';">yes</span> por padrão no Solaris. Toda a atividade (carregamentos, armazenamentos, solicitações de clientes) é, portanto, ignorada durante:</p><p>* chamada pthread_create() na thread criadora</p><p>* fase de criação da thread (configuração de pilha e TLS) na thread criada</p></body></html>
sv: <html><head/><body><p>Bestämmer om alla aktiviteter när trådar skapas ska ignoreras. Normalt bara aktiverad på Solaris. Solaris erbjuder högre genomströmning, parallellism och skalbarhet än andra operativsystem, till bekostnad av mer finkornig låsningsaktivitet. Det betyder exempelvis att när en tråd skapas i glibc, används bara ett stort lås för hela trådens initiering. Solaris libc använder flera finkorniga lås och trådens skapare återupptar sina aktiviteter så snart som möjligt, och lämnar exempelvis stack- och TLS-inställningssekvensen till den skapade tråden. Situationen förvirrar DRD, eftersom det antar att det finns någon falsk ordningsföljd på plats mellan skapare och skapad tråd, och att därför skulle många typer av kapplöpningar i programmet inte rapporteras. För att förhindra en sådan falsk ordningsföljd, ändras kommandoradsväljaren till <span style=" font-family:'Monospace';">yes</span> på Solaris. All aktivitet (läs, skriv klientbegäran) ignoreras därför vid:</p><p>* Anrop till pthread_create() i den skapande tråden </p><p>* Fasen då tråden skapas (stack- och TLS-inställning) i den skapade tråden</p></body></html>
tr: <html><head/><body><p>İş parçacığı oluşturma sırasında tüm etkinliklerin yok sayılması gerekip gerekmediğini denetler.Varsayılan olarak yalnızca Solaris'te etkinleşir. Solaris, daha ince işlemeli kilitleme etkinliği pahasına diğer işletim sistemlerine göre daha yüksek verim, paralellik ve ölçeklenebilirlik sağlar. Bu, örneğin, bir iş parçacığı glibc altında oluşturulduğunda, tüm iş parçacığı ayarı için yalnızca bir büyük kilit kullanılır demektir. Solaris libc çok sayıda ince taneli<span style=" font-family:'Monospace';"> kilitler kullanır ve yaratıcı iş parçacığı etkinliklerini mümkün olduğunca çabucak sürdürür ve örneğin yığın ve TLS kurulum sırasını oluşturulan iş parçacığına bırakır. Bu durum, DRD'yi, yaratıcı ve yaratılan iş parçacığı arasında bazı yanlış sıralama bulunduğu varsayıldığında karıştırmaktadır; Ve bu nedenle başvurudaki pek çok yarış durumu bildirilmeyecektir. Bu yanlış sıralamayı önlemek için, bu komut satırı seçeneği <span style=" font-family:'Monospace';">evet</span> Solaris'te varsayılandır. Bu nedenle, tüm etkinlikler (yükler, depolar, istemci istekleri) süreçte dikkate alınmaz:</p><p>* pthread_create() içerik oluşturucudaki çağrı </p><p>* oluşmuş iş parçacığında iş parçacığı oluşturma aşaması (yığın ve TLS kurulumu)</p></body></html>
uk: <html><head/><body><p>Керує тим, чи слід ігнорувати усі дії під час створення потоку виконання. Типово увімкнено лише у Solaris. У Solaris вищий за інші системи рівень пропускної здатності, паралельності та масштабованості. Це реалізовано за рахунок додаткових варіантів дій з блокування. Це, наприклад, означає, що під час створення потоку у системі з glibc, для налаштувань усіх потоків використовується одне велике блокування. У Solaris з libc використовується декілька точніше регульованих блокувань, а потік виконання, у якому відбувалося створення, відновлює свою роботу якнайшвидше, лишаючи, наприклад, послідовність налаштовування стека і TLS створеному потоку. Такі принципи роботи заважають DRD отримувати належні дані, оскільки програма припускає, що між потоком створення і створеним потоком виникло помилкове упорядковування; отже, програма не зможе повідомити про багато типів помилок із конкуренцією у програмі. Щоб запобігти такому помилковому упорядковуванню, типово у Solaris для цього параметра встановлено значення <span style=" font-family:'Monospace';">yes</span>. У такому режимі усі дії (завантаження, зберігання, запити клієнтів) ігноруються під час таких подій:</p><p>* виклику pthread_create() у потоці створення</p><p>* фази створення потоку (налаштування стека та TLS) у створеному потоці</p></body></html>
zh_cn: <html><head/><body><p>控制是否应忽略线程创建过程中的所有活动。默认仅在 Solaris 上启用。比起其他操作系统，Solaris 提供更高的吞吐率、并行化率和可扩展性，但是代价是更精细化的加锁操作。例如当线程在 glibc 下创建时，整个线程设置过程被一个大锁保护，而 Solaris libc 使用多个精细的锁。这使得创建线程能尽快恢复其原有活动，而将包括堆栈和 TLS 设置过程留给新创建的线程完成。这种情况会使 DRD 陷入混乱，因为它会认为创建者和被创建的线程之间有某种虚假的次序。作为结果，许多种应用程序中的竞争条件不会被报告。为了避免这种对虚假次序的认知，该命令行参数默认在 Solaris 上被设置为<span style=" font-family:'Monospace';">yes</span>。所有活动（读取，写入，客户请求）都会在以下过程中被忽略：</p><p>* 创建者线程的 pthread_create() 调用中 </p><p>* 被创建线程的线程创建阶段（堆栈和 TLS 设置）</p></body></html>

source: Ignore thread creation
ar: تجاهل إنشاء السلسلة
ca: Ignora la creació dels fils
eo: Ignori fadenkreadon
es: Ignorar la creación de hilos
fr: Ignorer la création de process
gl: Ignorar a creación de fíos.
it: Ignora la creazione dei thread
ka: ნაკადის შექმნის გამოტოვება
ko: 스레드 생성 무시
nl: Aanmaken van thread negeren
pl: Pomijaj tworzenie wątków
pt: Ignorar a criação de tarefas
pt_br: Ignorar criação de thread
sv: Ignorera trådskapelse
tr: Yığın oluşturmayı yok say
uk: Ігнорувати створення потоків
zh_cn: 忽略线程创建

source: Show stack frame instruction pointer value
ar: اعرض قيمة مؤشر تعليمة إطار المكدّس
ca: Mostra el valor de l'apuntador de les instruccions del marc de la pila
eo: Montri valoron de la montromontrilo de staka kadro
es: Mostrar el valor del puntero de instrucciones de los marcos de pila
fr: Afficher la valeur du pointeur de pile pour un bloc d'instructions
gl: Mostrar o valor do punteiro da instrución do marco do montón.
ka: სტეკის კადრის ინსტრუქციის მაჩვენებლის მნიშვნელობის ჩვენება
ko: 스택 프레임 명령 포인터 값 표시
nl: Waarde van instructie-aanwijzer in stackframe tonen
pl: Pokaż wartość wskaźnika instrukcji ramki stosu
pt: Mostrar o valor do ponteiro de instruções na pilha
pt_br: Mostrar valor do ponteiro de instrução do quadro de pilha
sv: Visa värde på pekaren till stackens aktiveringspost
tr: Yığın çerçevesi yönerge işaretçisi değerini göster
uk: Показувати вказівник інструкцій стека кадрів
zh_cn: 显示堆栈帧指令指针的值

source: Trace options
ar: خيارات التّتبّع
ca: Opcions de la traça
eo: Spuraj opcioj
es: Opciones de seguimiento
fr: Options de trace
gl: Opcións de traza
it: Opzioni di tracciamento
ka: ტრეისის მორგება
ko: 추적 옵션
nl: Volgopties
pl: Opcje śladu
pt: Opções de registo
pt_br: Opções de rastreamento
sv: Spårningsalternativ
tr: İzleme seçenekleri
uk: Параметри трасування
zh_cn: 追踪选项

source: <html><head/><body><p>Trace all memory allocations and deallocations. May produce a huge amount of output.</p></body></html>
ar: <html><head/><body><p>تتبّع كل تخصيصات الذاكرة و إزالات التّخصيص. قد ينتج كمية هائلة من المخرجات.</p></body></html>
ca: <html><head/><body><p>Traça totes les assignacions i desassignacions de memòria. Pot produir una quantitat enorme de sortida.</p></body></html>
eo: <html><head/><body><p>Spuri ĉiujn memorajn asignojn kaj malasignojn. Povas produkti grandegan kvanton da eligo.</p></body></html>
es: <html><head/><body><p>Seguir todas las asignaciones y liberaciones de memoria. Puede producir una gran cantidad de datos de salida.</p></body></html>
fr: <html><head/><body><p>Tracer toutes les allocations et libérations de mémoire. Cela peut produire un volume important en sortie. </p></body></html>
gl: <html><head/><body><p>Trazar todas as asignacións e liberacións de memoria. Pode producir unha saída enorme.</p></body></html>
it: <html><head/><body><p>Segui tutte le allocazioni e le dellocazioni della memoria. Può generare una grande quantità di output.</p></body></html>
ka: <html><head/><body><p>მეხსიერების ყველა გამოყოფისა და გათავისუფლების ტრეისი. შეუძლია უზარმაზარი რაოდენობის ინფორმაციის გამოტანა.</p></body></html>
ko: <html><head/><body><p>모든 메모리 할당과 해제를 추적합니다. 출력이 매우 길어질 수 있습니다.</p></body></html>
nl: <html><head/><body><p>Alle geheugenallocaties en vrijgaven volgen. Kan een zeer grote hoeveelheid uitvoer opleveren.</p></body></html>
pl: <html><head/><body><p>Śledź wszystkie przydzielenia i zwolnienia pamięci. Może zwrócić duże ilości danych.</p></body></html>
pt: <html><head/><body><p>Regista todas as alocações e libertações de memória. Poderá produzir uma grande quantidade de resultados.</p></body></html>
pt_br: <html><head/><body><p>Rastreia todas as alocações e desalocações de memória. Pode produzir uma quantidade enorme de saída.</p></body></html>
sv: <html><head/><body><p>Spåra all tilldelning och frigörelse av minne. Kan producera enormt mycket utdata.</p></body></html>
tr: <html><head/><body><p>Tüm bellek tahsislerini ve boşaltmalarını izle. Çok büyük miktarda bir çıktı üretebilir.</p></body></html>
uk: <html><head/><body><p>Трасувати усі розміщення у пам’яті і вивільнення пам’яті. Може значно збільшити об’єм створених даних.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有内存分配和释放。可能会产生大量的输出。</p></body></html>
