Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Trace memory allocations/deallocations
ar: تتبّع تخصيصات/إزالات تخصيص الذاكرة
ca: Traça les assignacions/desassignacions de memòria
eo: Spuri memorajn atribuojn/malasignojn
es: Seguir asignaciones/liberaciones de memoria
fr: Tracer les allocations / libérations
gl: Trazar as asignacións e liberacións de memoria.
it: Segui le allocazioni e le dellocazioni della memoria
ka: მეხსიერების გამოყოფების/გამოყოფის გაუქმებების ტრეისი
ko: 메모리 할당/해제 추적
nl: Geheugenallocaties en vrijgaven volgen
pl: Śledź przydzielenia/zwolnienia pamięci
pt: Registar as alocações/libertações da memória
pt_br: Rastrear alocações/desalocações de memória
sv: Spåra tilldelning och frigörelse av minne
tr: Bellek tahsislerini/boşaltmalarını izle
uk: Трасувати отримання та вивільнення пам’яті
zh_cn: 追踪内存分配/释放

source: <html><head/><body><p>Trace all barrier activity.</p></body></html>
ar: <html><head/><body><p>تتبّع كل نشاط الحواجز.</p></body></html>
ca: <html><head/><body><p>Traça totes les activitats de barrera.</p></body></html>
eo: <html><head/><body><p>Spuri ĉian baran agadon.</p></body></html>
es: <html><head/><body><p>Seguir la actividad de todas las barreras.</p></body></html>
fr: <html><head/><body><p>Tracer toutes les activités limites. </p></body></html>
gl: <html><head/><body><p>Trazar toda a actividade de barreira.</p></body></html>
it: <html><head/><body><p>Segui tutta l'attività delle barriere.</p></body></html>
ka: <html><head/><body><p>ყველა ბარიერის აქტივობის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 배리어 활동을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle barrier-activiteit volgen.</p></body></html>
pl: <html><head/><body><p>Śledź całą aktywność barier.</p></body></html>
pt: <html><head/><body><p>Regista toda a actividade das barreiras.</p></body></html>
pt_br: <html><head/><body><p>Rastreia toda a atividade da barreira.</p></body></html>
sv: <html><head/><body><p>Spåra all barriäraktivitet.</p></body></html>
tr: <html><head/><body><p>Tüm bariyer etkinliğini izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі дії з бар’єрами.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有同步屏障活动。</p></body></html>

source: Trace barrier activity
ar: تتبّع نشاط الحواجز
ca: Traça les activitats de barrera
eo: Spurbara aktiveco
es: Seguir actividad de las barreras
fr: Tracer une activité limite
gl: Trazar a actividade de barreira.
it: Segui l'attività delle barriere
ka: ტრეისის ბარიერის აქტივობა
ko: 배리어 활동 추적
nl: Barrier-activiteit volgen
pl: Śledź aktywność barier
pt: Registar a actividade das barreiras
pt_br: Rastrear atividade de barreira
sv: Spåra barriäraktivitet
tr: Bariyer etkinliği izle
uk: Трасувати дії з бар’єрами
zh_cn: 追踪同步屏障活动

source: <html><head/><body><p>Trace all condition variable activity.</p></body></html>
ar: <html><head/><body><p>تتبّع كل نشاط متغير الشرط.</p></body></html>
ca: <html><head/><body><p>Traça totes les activitats de variables de condició.</p></body></html>
eo: <html><head/><body><p>Spuri ĉiun kondiĉvariablan agadon.</p></body></html>
es: <html><head/><body><p>Seguir la actividad de todas las variables de condición.</p></body></html>
fr: <html><head/><body><p>Tracer une activité avec les variables de condition.</p></body></html>
gl: <html><head/><body><p>Trazar toda a actividade de variábeis de condición.</p></body></html>
it: <html><head/><body><p>Segui tutta l'attività delle variabili di condizione.</p></body></html>
ka: <html><head/><body><p>ყველა პირობის ცვლადის აქტივობის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 조건 변수 활동을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle activiteit van variabele voor voorwaarde volgen.</p></body></html>
pl: <html><head/><body><p>Śledź całą aktywność zmiennej warunku.</p></body></html>
pt: <html><head/><body><p>Regista toda a actividade das variáveis de condição.</p></body></html>
pt_br: <html><head/><body><p>Rastreia todas as atividades das variáveis ​​de condição.</p></body></html>
sv: <html><head/><body><p>Spåra all aktivitet för villkorsvariabler.</p></body></html>
tr: <html><head/><body><p>Tüm koşul değişkeni etkinliğini izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі дії з умовними змінними.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有条件变量活动。</p></body></html>

source: Trace condition variable activity
ar: تتبّع نشاط متغير الشرط
ca: Traça les activitats de variables de condició
eo: Spuri kondiĉvariablan agado
es: Seguir la actividad de las variables de condición
fr: Tracer l'activité des variables de condition
gl: Trazar a actividade de variábeis de condición.
it: Segui l'attività delle variabili di condizione
ka: პირობის ცვლის აქტივობის ტრეისი
ko: 조건 변수 활동 추적
nl: Activiteit van variabele voor voorwaarde volgen
pl: Śledź aktywność zmiennej warunku
pt: Registar as actividades das variáveis de condição
pt_br: Rastrear atividade da variável de condição
sv: Spåra aktivitet för villkorsvariabler
tr: Koşul değişkeni etkinliğini izle
uk: Трасувати дії з умовними змінними
zh_cn: 追踪条件变量活动

source: <html><head/><body><p>Trace all thread creation and all thread termination events.</p></body></html>
ar: <html><head/><body><p>تتبّع كل أحداث إنشاء السلسلة و إنهاء السلسلة.</p></body></html>
ca: <html><head/><body><p>Traça tots els esdeveniments de creació de fil i terminació de fil.</p></body></html>
eo: <html><head/><body><p>Spuri ĉiujn eventojn pri kreado de fadenoj kaj ĉiuj eventoj pri fino de fadenoj.</p></body></html>
es: <html><head/><body><p>Seguir todos los eventos de creación y terminación de hilos.</p></body></html>
fr: <html><head/><body><p>Tracer toutes les créations et les évènements de fermetures de processus.</p></body></html>
gl: <html><head/><body><p>Trazar todos os eventos de creación de fíos e de terminación de fíos.</p></body></html>
it: <html><head/><body><p>Segui tutti gli eventi di creazione e di terminazione dei thread.</p></body></html>
ka: <html><head/><body><p>ნაკადის ყველა შექმნისა და შეწყვეტის მოვლენის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 스레드 생성과 스레드 종료 이벤트를 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle aanmaak van thread volgen en alle gebeurtenissen van beëindigen van threads.</p></body></html>
pl: <html><head/><body><p>Śledź wszystkie zdarzenia stworzenia i zamknięcia wątku.</p></body></html>
pt: <html><head/><body><p>Regista todas as criações de tarefas e todos os eventos de finalização das tarefas.</p></body></html>
pt_br: <html><head/><body><p>Rastreia todos os eventos de criação e término de threads.</p></body></html>
sv: <html><head/><body><p>Spåra alla trådskapelse- och termineringshändelser</p></body></html>
tr: <html><head/><body><p>Tüm iş parçacığı oluşturma ve tüm iş parçacığı bitirme olaylarını izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі події зі створення та припинення роботи потоків виконання.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有线程创建和线程终止事件。</p></body></html>

source: Trace thread creation/termination events
ar: تتبّع أحداث إنشاء/إنهاء السلسلة
ca: Traça els esdeveniments de creació/terminació de fil
eo: Spuri eventojn pri kreado/fino de fadenoj
es: Seguir eventos de creación/terminación de hilos
fr: Tracer les évènements de création / fermetures
gl: Trazar os eventos de creación e terminación de fíos.
it: Eventi di creazione/terminazione dei thread
ka: ნაკადის შექმნის/შეწყვეტის მოვლენების ტრეისი
ko: 스레드 생성/종료 이벤트 추적
nl: Gebeurtenissen van aanmaken/beëindigen van threads volgen
pl: Śledź zdarzenia stworzenia/zamknięcia wątku
pt: Registar os eventos de criação/finalização das tarefas
pt_br: Rastrear eventos de criação/término de thread
sv: Spåra trådskapelse- och termineringshändelser
tr: İş parçacağı oluşturma ve bitirme olaylarını izle
uk: Трасувати події створення або переривання потоків
zh_cn: 追踪线程创建/终止事件

source: <html><head/><body><p>Trace execution of the <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> client requests.</p></body></html>
ar: <html><head/><body><p>تتبّع تنفيذ طلبات العميل <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>، <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> و <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
ca: <html><head/><body><p>Traça l'execució de les sol·licituds de client dels <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace';font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
eo: <html><head/><body><p>Spuri plenumon de la <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> kaj <span style=" font-family :'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> klientpetoj.</p></body></html>
es: <html><head/><body><p>Seguir la ejecución de las peticiones cliente <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> y <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
fr: <html><head/><body><p>Tracer l'exécution du client de requêtes <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> and <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
gl: <html><head/><body><p>Trazar a execución das solicitudes de cliente <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> და <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> კლიენტის მოთხოვნების შესრულების ტრასირებას.</p></body></html>
ko: <html><head/><body><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span>와 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> 클라이언트 요청의 실행을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Uitvoering van de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> client-verzoeken volgen.</p></body></html>
pl: <html><head/><body><p>Śledź wykonanie <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> oraz żądania klienta <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
pt: <html><head/><body><p>Registar a execução dos pedidos do cliente <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
pt_br: <html><head/><body><p>Rastrear a execução das solicitações de cliente <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> e <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
sv: <html><head/><body><p>Spåra körning av klientbegäran <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> och <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
tr: <html><head/><body><p><span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> ve <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> istemci istekleriniin çalıştırılmalarını izle .</p></body></html>
uk: <html><head/><body><p>Трасувати виконання клієнтських запитів <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> та <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span>.</p></body></html>
zh_cn: <html><head/><body><p>追踪带有 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_BEFORE()</span>，<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_AFTER()</span> 和 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ANNOTATE_HAPPENS_DONE()</span> 标记的客户请求的执行。</p></body></html>

source: Trace execution of "ANNOTATE_HAPPENS" requests
ar: تتبّع تنفيذ طلبات «ANNOTATE_HAPPENS»
ca: Traça l'execució de les sol·licituds «ANNOTATE_HAPPENS»
eo: Spuri plenumon de "ANNOTATE_HAPPENS" petoj
es: Seguir la ejecución de las peticiones «ANNOTATE_HAPPENS»
fr: Tracer l'exécution des requêtes « ANNOTATE_HAPPENS »
gl: Trazar a execución de solicitudes «ANNOTATE_HAPPENS».
ka: "ANNOTATE_HAPPENS" მოთხოვნების შესრულების ტრეისი
ko: "ANNOTATE_HAPPENS" 요청 실행 추적
nl: Uitvoeren van "ANNOTATE_HAPPENS" verzoeken volgen
pl: Śledź wykonanie żądania "ANNOTATE_HAPPENS"
pt: Registar a execução dos pedidos "ANNOTATE_HAPPENS"
pt_br: Rastrear execução de solicitações "ANNOTATE_HAPPENS"
sv: Spåra körning av "ANNOTATE_HAPPENS"-begäran
tr: "ANNOTATE_HAPPENS" isteklerinin çalıştırılmasını izle
uk: Трасувати виконання запитів «ANNOTATE_HAPPENS»
zh_cn: 追踪带有“ANNOTATE_HAPPENS”标记请求的执行

source: <html><head/><body><p>Trace all mutex activity.</p></body></html>
ar: <html><head/><body><p>تتبّع كل نشاط المؤَمّن (Mutex).</p></body></html>
ca: <html><head/><body><p>Traça totes les activitats del «mutex».</p></body></html>
eo: <html><head/><body><p>Spuri ĉian muteksan agadon.</p></body></html>
es: <html><head/><body><p>Seguir la actividad de todas las exclusiones mutuas.</p></body></html>
fr: <html><head/><body><p>Tracer toutes les activités des mutex.</p></body></html>
gl: <html><head/><body><p>Trazar toda a actividade de peche de exclusión mutua.</p></body></html>
it: <html><head/><body><p>Segui tutta l'attività dei mutex.</p></body></html>
ka: <html><head/><body><p>ყველა მუტექსის აქტივობის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 뮤텍스 활동을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle mutex activiteit volgen.</p></body></html>
pl: <html><head/><body><p>Śledź całą aktywność mutex.</p></body></html>
pt: <html><head/><body><p>Regista todas as actividades de exclusões mútuas.</p></body></html>
pt_br: <html><head/><body><p>Rastreia toda a atividade de mutex.</p></body></html>
sv: <html><head/><body><p>Spåra all mutex-aktivitet.</p></body></html>
tr: <html><head/><body><p>Tüm muteks etkinliğini izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі дії з прапорцями.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有的互斥锁活动。</p></body></html>

source: Trace mutex activity
ar: تتبّع نشاط المؤَمّن
ca: Traça l'activitat del «mutex»
eo: Spuri mutex-agadon
es: Seguir la actividad de exclusión mutua
fr: Tracer une activité d'un mutex
gl: Trazar a actividade de peche de exclusión mutua.
it: Segui l'attività dei mutex
ka: მუტექსის აქტივობის ტრეისი
ko: 뮤텍스 활동 추적
nl: Mutex activiteit volgen
pl: Śledź aktywność mutex
pt: Registar a actividade das exclusões mútuas
pt_br: Rastrear atividade mutex
sv: Spåra mutex-aktivitet
tr: Muteks etkinliğini izle
uk: Трасувати дії з прапорцями
zh_cn: 追踪互斥锁活动

source: <html><head/><body><p>Trace all reader-writer lock activity.</p></body></html>
ar: <html><head/><body><p>تتبّع كل نشاط قفل القارئ-الكاتب.</p></body></html>
ca: <html><head/><body><p>Traça totes les activitats de bloqueig de lectura-escriptura.</p></body></html>
eo: <html><head/><body><p>Spuri ĉian agadon de seruro de leganto-verkisto.</p></body></html>
es: <html><head/><body><p>Seguir la actividad de todos los bloqueos de lectura-escritura.</p></body></html>
fr: <html><head/><body><p>Tracer une activité de verrouillage lecture / écriture.</p></body></html>
gl: <html><head/><body><p>Trazar toda a actividade de bloqueador de lector-escritor.</p></body></html>
it: <html><head/><body><p>Traccia tutta l'attività dei blocchi lettura/scrittura.</p></body></html>
ka: <html><head/><body><p>ყველა წამკითხავი-ჩამწერი ბლოკის აქტივობის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 리더-라이터 잠금 활동을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle activiteit van vergrendeling van lezer-schrijver volgen.</p></body></html>
pl: <html><head/><body><p>Śledź całą aktywność blokady odczytu-zapisu.</p></body></html>
pt: <html><head/><body><p>Regista toda a actividade de bloqueios de leitura-escrita.</p></body></html>
pt_br: <html><head/><body><p>Rastreia todas as atividades de bloqueio de leitor-gravador.</p></body></html>
sv: <html><head/><body><p>Spåra all läs- och skrivlåsningsaktivitet</p></body></html>
tr: <html><head/><body><p>Tüm okuyucu-yazıcı kilit etkinliğini izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі дії з блокуванням читання-запису.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有读写锁活动。</p></body></html>

source: Trace reader-writer lock activity
ar: تتبّع نشاط قفل القارئ-الكاتب
ca: Traça les activitats de bloqueig de lectura-escriptura
eo: Spuri leganto-verkista seruro aktiveco
es: Seguir la actividad de bloqueo de lectura-escritura
fr: Tracer l'activité des verrous en lecture-écriture
gl: Trazar a actividade de bloqueador de lector-escritor.
it: Traccia l'attività dei blocchi lettura/scrittura
ka: წამკითხავი-ჩამწერი ბლოკის აქტივობის ტრეისი
ko: 리더-라이터 잠금 활동 추적
nl: Activiteit van vergrendeling van lezer-schrijver volgen
pl: Śledź aktywność blokady odczytu-zapisu
pt: Registar a actividade de bloqueios leitura-escrita
pt_br: Rastrear atividade de bloqueio do leitor-gravador
sv: Spåra läs- och skrivlåsningsaktivitet
tr: Okuyucu-yazıcı kilit etkinliğini izle
uk: Трасувати дії з блокуванням читання-запису
zh_cn: 追踪读写锁活动

source: <html><head/><body><p>Trace all semaphore activity.</p></body></html>
ar: <html><head/><body><p>تتبّع كل نشاط الإشارات الضوئية (Semaphore).</p></body></html>
ca: <html><head/><body><p>Traça totes les activitats de semàfor.</p></body></html>
eo: <html><head/><body><p>Spuri la tutan semaforan agadon.</p></body></html>
es: <html><head/><body><p>Seguir la actividad de todos los semáforos.</p></body></html>
fr: <html><head/><body><p>Tracer l'activité des sémaphores.</p></body></html>
gl: <html><head/><body><p>Trazar toda a actividade de semáforo.</p></body></html>
it: <html><head/><body><p>Traccia tutta l'attività dei semafori.</p></body></html>
ka: <html><head/><body><p>ყველა სემაფორის აქტივობის ტრეისი.</p></body></html>
ko: <html><head/><body><p>모든 세마포어 활동을 추적합니다.</p></body></html>
nl: <html><head/><body><p>Alle semafoor activiteit volgen.</p></body></html>
pl: <html><head/><body><p>Śledź całą aktywność semafor.</p></body></html>
pt: <html><head/><body><p>Regista toda a actividade de semáforos.</p></body></html>
pt_br: <html><head/><body><p>Rastreia toda a atividade do semáforo.</p></body></html>
sv: <html><head/><body><p>Spåra all semaforaktivitet.</p></body></html>
tr: <html><head/><body><p>Tüm semafor etkinliğini izle.</p></body></html>
uk: <html><head/><body><p>Трасувати усі дії з семафорами.</p></body></html>
zh_cn: <html><head/><body><p>追踪所有信号量活动。</p></body></html>

source: Trace semaphore activity
ar: تتبّع نشاط الإشارات الضوئية
ca: Traça l'activitat de semàfor
eo: Spuri semaforan agadon
es: Seguir la actividad de los semáforos
fr: Tracer l'activité des sémaphores
gl: Trazar a actividade de semáforo.
it: Traccia l'attività dei semafori
ka: სემაფორების აქტივობის ტრეკინგი
ko: 세마포어 활동 추적
nl: Semafoor activiteit volgen
pl: Śledź aktywność semafor
pt: Registar a actividade dos semáforos
pt_br: Rastrear atividade de semáforo
sv: Spåra semaforaktivitet
tr: Semafor etkinliğini izle
uk: Трасувати дії з семафорами
zh_cn: 追踪信号量活动

source: DRD (Thread Error Detector)
ar: DRD (كاشف خطأ السلسلة)
ca: DRD (Detector d'errors de fils)
eo: DRD (Detektilo pri Fadena Eraro)
es: DRD (detector de errores de hilos)
fr: DRD (Détecteur d'erreur de process)
gl: DRD (detector de erros de fíos)
ka: DRD (ნაკადის შეცდომის აღმომჩენი)
ko: DRD(스레드 오류 감지기)
nl: DRD (detector van thread-fouten)
pl: DRD (Wykrywacz błędów wątków)
pt: DRD (Detector de Erros entre Tarefas)
pt_br: DRD (Detector de Erros de Thread)
sv: DRD (detekteringsverktyg för trådfel)
tr: DRD (İş Parçacığı Hata Algılayıcı)
uk: DRD (засіб виявлення помилок із потоками)
zh_cn: DRD (线程错误检测器)

source: Full
ar: كامل
ca: Complet
eo: Plene
es: Completo
fr: Intégral
gl: Completo
it: Completo
ka: სრული
ko: 전체
nl: Volledig
pl: Pełny
pt: Completo
pt_br: Completo
sv: Fullständig
tr: Tam
uk: Повне
zh_cn: 完全

source: Approx
ar: تقريبيّ
ca: Aproximació
eo: Proks
es: Aproximado
fr: Approximatif
gl: Aproximado
it: Approssimato
ka: დაახლ
ko: 개략적
pl: Przybliżony
pt: Aprox
pt_br: Aproximado
sv: Ungefärlig
tr: Yaklaşık
uk: Приблизно
zh_cn: 近似

source: None
ar: لا شيء
ca: Cap
eo: Neniu
es: Ninguno
fr: Aucun
gl: Ningún
it: Nessuno
ka: არა
ko: 없음
nl: Geen
pl: Żaden
pt: Nenhum
pt_br: Nenhum
sv: Ingen
tr: Hiçbiri
uk: Відсутня
zh_cn: 未分组

source: History level:
ar: مستوى السجلّ:
ca: Nivell de l'historial:
eo: Historinivelo:
es: Nivel del historial:
fr: Niveau d'historique :
gl: Nivel do historial:
it: Livello di cronologia:
ka: ისტორიის დონე:
ko: 과거 기록 수준:
nl: Geschiedenisniveau:
pl: Poziom historii:
pt: Nível do histórico:
pt_br: Nível de histórico:
sv: Historiknivå:
tr: Geçmiş düzeyi:
uk: Рівень журналювання:
zh_cn: 历史级别：
