Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Specify if you want to do branch prediction simulation. Further event counters are enabled: Number of executed conditional branches and related predictor misses (&quot;Bc&quot;/&quot;Bcm&quot;), executed indirect jumps and related misses of the jump address predictor (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
ar: <html><head/><body><p>اضبط إذا أردت محاكاة التنبؤ بالفرع. تفعل عدّادات أحداث إضافية: عدد الفروع الشرطية المنفذة وأخطاء التنبؤ ذات الصلة (”Bc“/”Bcm“)، القفزات غير المباشرة المنفذة والأخطاء ذات الصلة لمُنْبئ عنوان القفز (”Bi“/”Bim“).</p></body></html>
ca: <html><head/><body><p>Especifica si es vol fer la simulació de la predicció de branca. S'activen altres comptadors d'esdeveniments: Nombre de branques condicionals executades i manques de predictor relacionades («Bc»/«Bcm»), salts indirectes executats i manques relacionades del predictor de l'adreça de salt («Bi»/«Bim»).</p></body></html>
eo: <html><head/><body><p>Specifu ĉu vi volas fari branĉan prognozan simuladon. Pliaj okazaĵaj nombriloj estas ebligitaj: Nombro de plenumitaj kondiĉaj branĉoj kaj rilataj prognozilo-maltrafitaj ("Bc"/"Bcm"), plenumitaj nerektaj saltoj kaj rilataj misfunkciadoj de la salt-adresprognozilo ("Bi"/"Bim").</p> </body></html>
es: <html><head/><body><p>Especificar si desea hacer simulación de la predicción de saltos. Se activan más contadores de eventos: número de saltos condicionales ejecutados y fallos del predictor relacionados («Bc»/«Bcm»), saltos ejecutados indirectamente y fallos relacionados del predictor de direcciones de salto («Bi»/«Bim»).</p></body></html>
fr: <html><head/><body><p>Spécifier si vous voulez faire une simulation de prédiction de branche. D'autres compteurs d'évènements sont activés : nombre de branches conditionnelles exécutées et défauts de prédiction correspondants (&quot;Bc&quot; /&quot;Bcm&quot;), sauts indirects exécutés et défauts de saut correspondants du prédicteur d'adresse de saut (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
gl: <html><head/><body><p>Indique se quere facer simulación de predición de ramas. Activaranse contadores de eventos adicionais: número de ramas condicionais executadas e predicións erradas relacionadas («Bc»/«Bcm»), saltos indirectos executados e predicións erradas relacionadas de saltos de enderezo («Bi»/«Bim»).</p></body></html>
ka: <html><head/><body><p>მიუთითეთ, გსურთ თუ არა დატოტვის პროგნოზირების სიმულაციის ჩატარება. ჩაირთვება დამატებითი მოვლენების მრიცხველები: შესრულებული პირობითი დატოტვების რაოდენობა და მასთან დაკავშირებული პროგნოზატორის გამოტოვებები (&quot;Bc&quot;/&quot;Bcm&quot;), შესრულებული არაპირდაპირი გადასვლები და გადასვლის მისამართის პროგნოზატორის შესაბამისი გამოტოვებები (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면 분기 예측 시뮬레이션을 진행합니다. 다음 추가 이벤트 카운터를 활성화합니다: 실행된 조건 분기와 연관된 분기 예측 실패(&quot;Bc&quot;/&quot;Bcm&quot;), 실행된 간접 점프 명령과 연관된 점프 주소 예측 실패(&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
nl: <html><head/><body><p>Specificeer als u simulatie van branch-voorspelling wilt doen. Verdere tellers van gebeurtenissen zijn ingeschakeld: aantal uitgevoerde voorwaardelijke branches en gerelateerde missen van voorspelling (&quot;Bc&quot;/&quot;Bcm&quot;), uitgevoerde indirecte sprongen en gerelateerde missen van de voorspeller van sprongadressen (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
pl: <html><head/><body><p>Określ czy chcesz wykonać symulację przewidywania gałęzi. Włączane są dalsze liczniki zdarzeń są: Liczba wykonanych gałęzi warunkowych i związane z tym nieudane przewidywania gałęzi (&quot;Bc&quot;/&quot;Bcm&quot;), wykonane niebezpośrednie skoki i związane z tym nieudane przewidywania adresów skoków (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
pt: <html><head/><body><p>Define se deseja fazer uma simulação da previsão dos saltos. São activados os contadores de eventos adicionais: Número de ramificações condicionais executadas e as falhas de previsão relacionadas (&quot;Bc&quot;/&quot;Bcm&quot;), os saltos indirectos executados e as falhas da previsão do endereço de salto relacionadas (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
pt_br: <html><head/><body><p>Especifique se deseja realizar a simulação de predição de desvio. Contadores de eventos adicionais estão habilitados: Número de desvios condicionais executados e falhas de preditor relacionadas (&quot;Bc&quot;/&quot;Bcm&quot;), saltos indiretos executados e falhas relacionadas do preditor de endereço de salto (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
sv: <html><head/><body><p>Ange om du vill göra simulering av hopprediktering. Ytterligare händelseräknare aktiveras: Antal utförda villkorliga hopp och relaterade predikteringsmissar (&quot;Bc&quot;/&quot;Bcm&quot;), utförda indirekta hopp och relaterade missar av hoppadresspredikteringen (&quot;Bi&quot;/&quot;Bim&quot;).</p></body></html>
tr: <html><head/><body><p>Alt grup tahmin benzetimi yapmak isteyip istemediğinizi belirtiniz. Ayrıca olay sayaçları etkinleştirilmiştir: Çalıştırılmış koşullu alt grup sayısı ve ilgili belirleyici ıskaları ("Bc"/"Bcm"), çalıştırılmış dolaylı atlamalar ve ilgili atlama adresi belirleyicisi ıskaları ("Bi"/"Bim").</p></body></html>
uk: <html><head/><body><p>Визначає, чи потрібна вам імітація передбачення розгалужень. Якщо імітацію буде увімкнено, можна буде скористатися такими лічильниками подій: кількість виконаних умовних розгалужень та пов’язаних із ними помилок передбачення («Bc»/«Bcm»), виконаних опосередкованих переходів і пов’язаних із ними помилок у передбаченні адрес переходів («Bi»/«Bim»).</p></body></html>
zh_cn: <html><head/><body><p>指定是否要进行分支预测模拟。这会启用更多的事件计数器：执行的条件分支的数量和相关的预测失误（&quot;Bc&quot;/&quot;Bcm&quot;），执行的间接跳转和相关的跳转地址预测失误（&quot;Bi&quot;/&quot;Bim&quot;）。</p></body></html>

source: callgrind_annotate parameters:
ar: معاملات callgrind_annotate:
ca: Paràmetres de «callgrind_annotate»:
eo: callgrind_annotate parametroj:
es: Parámetros de callgrind_annotate:
fr: Paramètres de « callgrind_annotate » :
gl: Parámetros de callgrind_annotate:
it: Parametri di callgrind_annotate:
ka: callgrind_annotate-ის პარამეტრები:
ko: callgrind_annotate 인자:
pl: Parametry callgrind_annotate:
pt: Parâmetros do 'callgrind_annotate':
pt_br: Parâmetros do callgrind_annotate:
sv: Väljare för callgrind_annotate:
tr: callgrind_annotate parametreleri:
uk: Параметри callgrind_annotate:
zh_cn: callgrind_annotate 参数：

source: Launch KCachegrind after analysis finish
ar: شغل KCachegrind بعد انتهاء التحليل
ca: Llança el KCachegrind després de finalitzar l'anàlisi
eo: Lanĉi KCachegrind post analiza finiĝo
es: Lanzar KCachegrind tras finalizar el análisis
fr: Lancer KCachegrind après la fin d'analyse
gl: Iniciar KCachegrind ao rematar a análise.
it: Avvia KCachegrind dopo la fine dell'analisi
ka: KCachegrind-ის გაშვება ანალიზის დასრულების შემდეგ
ko: 분석이 끝난 후 KCachegrind 실행
nl: KCachegrind opstarten na beëindigen van analyse
pl: Uruchom KCachegrind po ukończeniu analizy
pt: Lançar o KCachegrind após terminar a análise
pt_br: Iniciar o KCachegrind após o término da análise
sv: Starta KCachegrind efter analysen avslutas
tr: Çözümleme bittikten sonra KCachegrind'i başlat
uk: Запустити KCachegrind після завершення аналізу
zh_cn: 分析完成后启动 KCachegrind

source: Incl.
ar: ب تضمين
eo: Inkl.
ka: ჩათვლ.
ko: 포함
pl: Dołączane
sv: Inklusive
tr: Dahil.
uk: Вкл.
zh_cn: 包含

source: Self
ar: ذاتيّ
ca: Propi
eo: Mem
es: Auto
fr: Indépendant
gl: Propio:
ko: 자체
nl: Zichzelf
pl: Własne
pt: Próprio
pt_br: Próprio
sv: Mig själv
tr: Kendi
uk: Власний
zh_cn: 自身

source: Called
ar: المستدعى
ca: Cridat
eo: Vokita
es: Llamado
fr: Appelé
gl: Chamado
ka: გამოძახებულია
ko: 호출됨
nl: Aangeroepen
pl: Wywołane
pt: Chamado
pt_br: Chamado
sv: Anropad
tr: Çağrıldı
uk: Викликається
zh_cn: 已调用

source: Event
ar: الحدث
ca: Esdeveniment
eo: Evento
es: Evento
fr: Évènement
gl: Evento
it: Evento
ka: მოვლენა
ko: 이벤트
nl: Gebeurtenis
pl: Zdarzenie
pt: Evento
pt_br: Evento
sv: Händelse
tr: Olay
uk: Подія
zh_cn: 事件

source: Short
ar: مختصر
ca: Curt
eo: Mallonga
es: Corto
fr: Court
gl: Curto
ka: მოკლე
ko: 짧은
nl: Kort
pl: Krótki
pt: Curto
pt_br: Curto
sv: Kort
tr: Kısa
uk: Короткий
zh_cn: 短

source: %1 per call
ar: %1 لكل نداء
ca: %1 per crida
eo: %1 per voko
es: %1 por llamada
fr: %1 par appel
gl: %1 por chamada
it: %1 per chiamata
ka: %1 თითოეული გამოძახებისას
ko: 호출당 %1
nl: %1 per aanroep
pl: %1 na wywołanie
pt: %1 por chamada
pt_br: %1 por chamada
sv: %1 per anrop
tr: çağrı başına %1
uk: %1 на виклик
zh_cn: %1 每次调用

source: Count
ar: العدّ
ca: Compte
eo: Nombro
es: Contador
fr: Compte
gl: Cantidade
it: Conteggio
ka: რაოდენობა
ko: 개수
nl: Aantal
pl: Liczba
pt: Quantidade
pt_br: Contagem
sv: Antal
tr: Sayı
uk: Кількість

source: Caller
ar: المستدعِي
ca: Cridador
eo: Alvokanto
es: Llamante
fr: Appelant
gl: Chamador
it: Chiamante
ka: გამომძახებელი
ko: 호출자
nl: Aanroeper
pl: Wywołujący
pt: Chamador
pt_br: Chamador
sv: Den som anropar
tr: Çağırıcı
uk: Зовнішній виклик
zh_cn: 调用方

source: Callee
ar: المستدعَى
ca: Cridat
es: Llamada
fr: Appelant
gl: Chamado
it: Chiamato
ka: გამოძახებული
ko: 피호출자
nl: Aangeroepene
pl: Wywoływany
pt: Chamado
pt_br: Chamado
sv: Den som blir anropad
tr: Çağrılan
uk: Внутрішній виклик
zh_cn: 被调用方

source: Callgrind (Call-Graph Generating Cache and Branch Prediction Profiler)
ar: Callgrind (محلل أداء الخبيئة وتوقع التّفرّع المولّد لرسم النّداء)
ca: Callgrind (Analitzador de rendiment de la memòria cau i de predicció de branques que genera un gràfic de crides)
eo: Callgrind (Call-Graph Generating Cache kaj Branch Prediction Profiler)
es: Callgrind (analizador de rendimiento de la caché y predicción de saltos que genera un gráfico de llamadas)
fr: Callgrind (Cache de génération du graphe d'appel et profilage de prédiction de branche)
gl: Callgrind (analizador de rendemento de caché e predición de ramas que xera gráficos de chamadas)
it: Cachegrind (profiler della cache e della predizione delle diramazioni con generazione del grafo delle chiamate)
ka: Callgrind (გამოძახებების გრაფიკი, რომელიც კეშის და შტოს პროგნოზის პროფაილერის გენერაციას ახდენს)
ko: Callgrind(호출 그래프를 생성하는 캐시와 분기 예측 프로파일러)
nl: Callgrind (profiler voor call-grafiek generatie van cache en branch-voorspelling)
pl: Callgrind (Profiler tworzący wykresy wywołań pamięci podręcznej i przewidywań gałęzi)
pt: Callgrind (Analisador de 'Cache' e Previsão de Saltos)
pt_br: Callgrind (Gerador de cache de gráfico de chamadas e Criador de perfil de previsão de ramificação)
sv: Callgrind (profileringsverktyg för cache- och hopprediktering som skapar anropsgrafer)
tr: Callgrind (Önbellek ve Alt Grup Tahmin Profilleyici Oluşturan Çağrı Grafiği)
uk: Callgrind (засіб профілювання кешу і передбачення розгалужень із можливістю створення графу викликів)
zh_cn: Callgrind（可生成调用图的缓存和分支预测分析器）

source: Launch KCachegrind
ar: شغل KCachegrind
ca: Llança el KCachegrind
eo: Lanĉi KCachegrind
es: Lanzar KCachegrind
fr: Lancer KCachegrind
gl: Iniciar KCachegrind
it: Avvia KCachegrind
ka: KCachegrind-ის გაშვება
ko: KCachegrind 실행
nl: Cachegrind opstarten
pl: Uruchom KCachegrind
pt: Lançar o KCachegrind
pt_br: Iniciar o KCachegrind
sv: Starta KCachegrind
tr: KCachegrind'i başlat
uk: Запустити KCachegrind
zh_cn: 启动 KCachegrind

source: Events
ar: الأحداث
ca: Esdeveniments
eo: Eventoj
es: Eventos
fr: Évènements
gl: Eventos
it: Eventi
ka: მოვლენები
ko: 이벤트
nl: Gebeurtenissen
pl: Zdarzenia
pt: Eventos
pt_br: Eventos
sv: Händelser
tr: Olaylar
uk: Події
zh_cn: 事件

source: Direct callers
ar: المستدعِيون المباشرون
ca: Cridadors directes
eo: Rektaj alvokantoj
es: Llamantes directos
fr: Appelants directs
gl: Chamadores directos
it: Chiamanti diretti
ka: პირდაპირი გამომძახებლები
ko: 직접 호출
nl: Directe aanroepers
pl: Bezpośredni wywołujący
pt: Chamadores directos
pt_br: Chamadores diretos
sv: Direkt anrop
tr: Doğrudan çağrıcılar
uk: Безпосередні зовнішні виклики
zh_cn: 直接调用方

source: Direct callees
ar: المستدعَون المباشرون
ca: Crides directes
eo: Rektaj alvokitoj
es: Llamadas directas
fr: Appelés directs
gl: Chamadas directas
it: Chiamati diretti
ka: პირდაპირი გამოძახებულები
ko: 직접 피호출
nl: Directe aangeroepenen
pl: Bezpośredni wywoływani
pt: Chamados directos
pt_br: Chamados diretos
sv: Direkt anropade
tr: Direkt arananlar
uk: Безпосередні внутрішні виклики
zh_cn: 直接被调用方

source: Location
ar: الموقع
ca: Ubicació
eo: Loko
es: Posición
fr: Emplacement
gl: Lugar
it: Posizione
ka: დებარეობა
ko: 위치
nl: Locatie
pl: Położenie
pt: Localização
pt_br: Localização
sv: Plats
tr: Konum
uk: Розташування
zh_cn: 住址

source: Binary file:
ar: الملف الثنائي:
ca: Fitxer binari:
eo: Binara dosiero:
es: Archivo binario:
fr: Fichier binaire :
gl: Ficheiro binario:
it: File binario:
ka: ბინარული ფაილი:
ko: 바이너리 파일:
nl: Binair bestand:
pl: Plik dwójkowy:
pt: Ficheiro binário:
pt_br: Arquivo binário:
sv: Binärfil:
tr: İkili dosya:
uk: Бінарний файл:
zh_cn: 二进制文件：

source: Source file(s):
ar: ملف (ملفات) المصدر:
ca: Fitxer/s de codi:
eo: Fontdosiero(j):
es: Archivo(s) de código fuente:
fr: Fichier(s) source(s) :
gl: Ficheiros fonte:
it: File sorgente/i:
ka: კოდის ფაილები:
ko: 소스 파일:
nl: Bronbestand(en):
pl: Plik(i) źródłowy:
pt: Ficheiros de código:
pt_br: Arquivo(s) de origem:
sv: Källkodsfil(er):
tr: Kaynak Dosya(lar):
uk: Файл(и) коду:
zh_cn: 源文件：

source: Joined threads memory access list volume:
ar: حجم قائمة وصول الذاكرة للسلاسل المنضمة:
ca: Volum de la llista d'accessos a la memòria dels fils reunits:
eo: Volumo de listo de aliro al memoro de kunigitaj fadenoj:
es: Volumen de la lista de acceso a memoria de hilos unidos:
fr: Liste des volumes d'accès mémoire pour les processus liés :
gl: Volume de lista de acceso de memoria de fíos unidos:
ka: გაერთიანებული ნაკადების მეხსიერების წვდომის სიის ზომა:
ko: 종료를 대기하는 스레드의 메모리 접근 목록 개수:
nl: Volume van geheugentoegangslijst van samengevoegde threads:
pl: Wolumen listy dostępów do pamięci połączonych wątków
pt: Volume conjunto da lista de acessos à memória das tarefas:
pt_br: Volume da lista de acesso à memória de threads unidas:
sv: Volym av lista över minnesåtkomst för förenade trådar
tr: Birleştirilmiş iş parçacıkları bellek erişim listesi hacmi:
uk: Обсяг списку доступів до пам’яті з’єднаних потоків:
zh_cn: 已会合线程内存访问列表大小：

source: <html><head/><body><p>Data races that occur between a statement at the end of one thread and another thread can be missed if memory access information is discarded immediately after a thread has been joined. This option allows to specify for how many joined threads memory access information should be retained.</p></body></html>
ar: <html><head/><body><p>قد يفوت اكتشاف تزاحمات البيانات التي تحدث بين بيان في نهاية سلسلة و سلسلة أخرى إذا أهملت معلومات وصول الذاكرة فورا بعد انضمام سلسلة. يسمح هذا الخيار بتحديد لكم سلسلة منضمة يجب الاحتفاظ بمعلومات وصول الذاكرة.</p></body></html>
ca: <html><head/><body><p>La competició de dades que es produeixen entre una sentència al final d'un fil i un altre fil poden mancar si la informació d'accés a la memòria es descarta immediatament després de reunir-se amb un altre fil. Aquesta opció permet especificar quanta informació cal retenir d'accés a la memòria de fils reunits.</p></body></html>
eo: <html><head/><body><p>Datumkuroj kiuj okazas inter deklaro ĉe la fino de unu fadeno kaj alia fadeno povas esti maltrafitaj se memoralira informo estas forĵetita tuj post kiam fadeno estis kunigita. Ĉi tiu opcio ebligas specifi por kiom da kunigitaj fadenoj memoraj alirinformoj estu konservitaj.</p></body></html>
es: <html><head/><body><p>Las carreras de datos que ocurren entre una sentencia al final de un hilo y otro hilo se pueden perder si la información de acceso a memoria se descarta inmediatamente tras unir un hilo. Esta opción permite indicar durante cuántos hilos unidos se debe retener la información de acceso a a memoria.</p></body></html>
fr: <html><head/><body><p> Les accès concurrents aux données se produisant entre un état à la fin d'un processus et un autre processus peuvent être ratés si des informations d'accès mémoire sont libérées juste après qu'un processus soit fusionné. Cette option vous permet de spécifier combien d'informations d'accès mémoire sur les processus fusionnés doivent être retenues.</p></body></html>
gl: <html><head/><body><p>As carreiras de datos que ocorren entre a sentencia ao final dun fío e outro fío poden perderse se a información de acceso á memoria se desbota inmediatamente despois de unirse un fío. Esta opción permite indicar a información de cantos fíos unidos debe manterse.</p></body></html>
ka: <html><head/><body><p>მონაცემთა დავა, რომელიც ხდება ერთი ნაკადის ბოლო ოპერაციასა და სხვა ნაკადს შორის, შეიძლება შეუმჩნეველი დარჩეს, თუ მეხსიერებაზე წვდომის შესახებ ინფორმაცია ნაკადის შეერთების შემდეგ დაუყოვნებლივ წაიშლება. ეს პარამეტრი საშუალებას გაძლევთ, მიუთითოთ, თუ რამდენი შეერთებული ნაკადისთვის უნდა იყოს შენარჩუნებული ინფორმაცია მეხსიერებაზე წვდომის შესახებ.</p></body></html>
ko: <html><head/><body><p>한 스레드와 다른 스레드가 끝날 때 일어나는 데이터 경쟁은 한 스레드가 종료되었을 때 메모리 접근 정보가 사라지면 놓칠 수도 있습니다. 이 옵션은 종료를 대기하는 스레드의 메모리 접근 정보를 몇 개나 유지할지 설정합니다.</p></body></html>
nl: <html><head/><body><p>Races van gegevens die optreden tussen een statement aan het eind van één thread en een andere thread kunnen gemist worden als informatie over geheugentoegang wordt weggegooid onmiddellijk nadat een thread is samengevoegd. Deze optie stelt in staat om te specificeren voor hoeveel samengevoegde threads informatie over geheugentoegang moet worden bewaard.</p></body></html>
pl: <html><head/><body><p>Gonitwy danych, które występują pomiędzy instrukcją na końcu jednego wątku i innego wątku mogą zostać pominięte, jeśli informacja o dostępie do pamięci jest porzucana bezpośrednio po połączeniu wątków. Opcja ta określa dla ilu połączonych wątków zachowywać informacje o dostępie do pamięci.</p></body></html>
pt: <html><head/><body><p>Os erros de concorrência que ocorrem entre uma instrução no fim de uma tarefa e de outra tarefa poder-se-ão perder se a informação de acesso à memória for eliminada imediatamente após a ligação a uma outra tarefa. Esta opção permite indicar por quantas memórias reunidas deve ser retida a informação de acesso à memória.</p></body></html>
pt_br: <html><head/><body><p>Disputas de dados que ocorrem entre uma instrução no final de uma thread e outra podem ser perdidas se as informações de acesso à memória forem descartadas imediatamente após a junção de uma thread. Esta opção permite especificar para quantas threads unidas as informações de acesso à memória devem ser mantidas.</p></body></html>
sv: <html><head/><body><p>Datakapplöpning som inträffar mellan en sats i slutet på en tråd och en annan tråd kan missas om information om minnesåtkomst överges omedelbart efter en tråd har satts ihop. Alternativet gör det möjligt att ange för hur många trådar som sätts ihop som information om minnesåtkomst ska bevaras.</p></body></html>
tr: <html><head/><body><p>bir iş parçacığının sonundaki bir ifade ile başka bir iş parçacığının arasında oluşan veri yarışları bellek erişim bilgisi başka bir iş parçacığı katıldığında anında çıkarılır. Bu seçenek kaç tane birleştirilen iş parçacığına bellek erişim bilgilerinin korunması gerektiğini belirlemenize izin verir.</p></body></html>
uk: <html><head/><body><p>Конкуренцію за дані, яка трапляється між інструкцією наприкінці одного з потоків виконання і іншим потоком, може бути пропущено, якщо дані щодо доступу до пам’яті буде відкинуто одразу після з’єднання потоку виконання з основним потоком. За допомогою цього пункту можна вказати, яку кількість дій із доступу до пам’яті з боку з’єднаних потоків слід зберігати.</p></body></html>
zh_cn: <html><head/><body><p>如果在与一个线程会合后将其内存访问信息立即丢弃的话，那么在该线程结束时运行的语句和另一个线程之间发生的数据竞争性访问可能会被忽略。此选项允许您指定要保留多少已会合的线程的内存访问信息。</p></body></html>

source: Segment merging interval:
ar: فاصل دمج الأجزاء:
ca: Interval de fusió de segments:
eo: Intervalo de kunfandado de segmentoj:
es: Intervalo de fusión de segmentos:
fr: Intervalle de fusion de segment :
gl: Intervalo de mestura de segmentos:
ka: სეგმენტის შერწყმის ინტერვალი:
ko: 세그먼트 합치기 간격:
nl: Interval tussen samenvoegen van segmenten:
pl: Okres scalania segmentu:
pt: Intervalo de reunião dos segmentos:
pt_br: Intervalo de fusão de segmentos:
sv: Sammanfogningsintervall för segment:
tr: Bölüt birleştirme aralığı:
uk: Інтервал об’єднання сегментів:
zh_cn: 段合并间隔：
