Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>When enabled (not the default), Helgrind treats freeing of heap memory as if the memory was written immediately before the free. This exposes races where memory is referenced by one thread, and freed by another, but there is no observable synchronization event to ensure that the reference happens before the free.</p><p>This functionality is new in Valgrind 3.7.0, and is regarded as experimental. It is not enabled by default because its interaction with custom memory allocators is not well understood at present. User feedback is welcomed.</p></body></html>
ar: <html><head/><body><p>عند التّفعيل (ليس بشكل مبدئي)، يعامِل Helgrind تحرير ذاكرة الكومة كأن الذاكرة كُتِبت فورا قبل التحرير. هذا يكشف تزاحمات حيث الذاكرة مشار إليها بواسطة سلسلة واحدة، و تحرّر بواسطة سلسلة أخرى، و لكن لا يوجد حدث مزامنة مرئي لضمان أن الإشارة تحدث قبل التحرير.</p><p>هذه الوظيفة جديدة في Valgrind 3.7.0، و تعدّ تجريبية. لا تفعّل بشكل مبدئي لأن تفاعلها مع مخصّصات الذاكرة المخصّصة غير مفهوم جيداً في الوقت الحاضر. يرحّب بملاحظات المستخدم.</p></body></html>
ca: <html><head/><body><p>Quan està activat (no de manera predeterminada), el Helgrind tracta l'alliberament de la memòria en monticles com si la memòria fos escrita immediatament abans de l'alliberament. Això exposa les situacions de competició a on la memòria està referenciada per un fil, i alliberada per un altre, però no hi ha cap esdeveniment de sincronització observable per a assegurar que la referència es produeix abans de l'alliberament.</p><p>Aquesta funcionalitat és nova en el Valgrind 3.7.0, i és considerada com a experimental. No està activa de manera predeterminada perquè la seva interacció amb els assignadors personalitzats de memòria no s'entén bé actualment. S'agrairan els comentaris dels usuaris.</p></body></html>
eo: <html><head/><body><p>Kiam ĝi estas ebligita (ne la defaŭlta), Helgrind traktas liberigon de amasmemoro kvazaŭ la memoro estus skribita tuj antaŭ la libera. Ĉi tio elmontras vetkurojn kie memoro estas referencita per unu fadeno, kaj liberigita per alia, sed ekzistas neniu observebla sinkroniga evento por certigi ke la referenco okazas antaŭ la libera.</p><p>Ĉi tiu funkcio estas nova en Valgrind 3.7.0, kaj estas rigardata kiel eksperimenta. Ĝi ne estas ebligita defaŭlte ĉar ĝia interago kun kutimaj memor-asigniloj ne estas bone komprenita nuntempe. Uzantaj komentoj estas bonvenaj.</p></body></html>
es: <html><head/><body><p>Cuando está activado (no de forma predeterminada), Helgrind trata las liberaciones de memoria del montículo como si la memora se escribiera inmediatamente antes de la liberación. Esto revela carreras en las que un hilo hace referencia a la memoria y otro la libera, aunque no existe ningún evento de sincronización observable para asegurar que la referencia ocurre antes que la liberación.</p><p>Esta funcionalidad es nueva en Valgrind 3.7.0 y se debe considerar experimental. No se activa de forma predeterminada porque su interacción con asignadores de memoria personalizados no se entiende muy bien en la actualidad. Los comentarios del usuario son bienvenidos.</p></body></html>
fr: <html><head/><body><p>Quand cette option est activée (ce qui n'est pas par défaut), Helgrind traite les libérations de la mémoire dans le tas local comme de la mémoire pouvant être ré-utilisée immédiatement après libération. Cela provoque des accès concurrents où la mémoire adressée par un processus et libérée par un autre. Mais, il n'y a pas d'évènement de synchronisation observable pour s'assurer que la référence arrive après la libération.</p><p>Cette fonctionnalité est nouvelle dans Valgrind 3.7.0 et est à considérer comme expérimental. Elle n'est pas activée par défaut car son interaction avec les allocateurs personnalisés de mémoire n'est pas bien compris actuellement. Les retours d'utilisateurs sont les bienvenus.</p></body></html>
gl: <html><head/><body><p>Cando se activa (non de maneira predeterminada), Helgrind trata a liberación de memoria do monte como se a memoria se escribise inmediatamente antes da liberación. Isto expón carreiras onde se fai referencia á memoria desde un fío, e se libera desde outro, pero non se observa ningún evento de sincronización para asegurarse de que a referencia ocorre antes da liberación.</p> <p>Esta funcionalidade é nova na versión 3.7.0 de Valgrind, e considérase experimental. Non está activada de maneira predeterminada porque a súa interacción con asignadores de memoria personalizados non se comprende ben na actualidade. Agradécense as achegas de usuarios.</p></body></html>
ka: <html><head/><body><p>როდესაც ეს ფუნქცია ჩართულია (რაც არ არის ნაგულისხმევი), Helgrind განიხილავს დინამიური მეხსიერების (heap) გათავისუფლებას ისე, თითქოს მეხსიერებაში ჩაწერა მოხდა უშუალოდ გათავისუფლებამდე. ეს გამოავლენს დავებს, როდესაც მეხსიერებას იყენებს ერთი ნაკადი, ხოლო ათავისუფლებს მეორე, მაგრამ არ არსებობს სინქრონიზაციის შესამჩნევი მოვლენა, რომელიც უზრუნველყოფდა მეხსიერებაზე წვდომას მის გათავისუფლებამდე.</p><p>ეს ფუნქციონალი ახალია Valgrind 3.7.0 ვერსიაში და ითვლება ექსპერიმენტულად. იგი არ არის ჩართული ნაგულისხმევად, რადგან მისი ურთიერთქმედება მეხსიერების მორგებულ გამნაწილებლებთან ამჟამად კარგად არ არის შესწავლილი. მომხმარებელთა უკუკავშირი მისასალმებელია.</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면(기본값 아님) Helgrind에서는 힙 메모리를 해제하는 과정을 메모리 해제 직전에 쓰기 작업이 있었던 것처럼 취급합니다. 한 스레드에서 메모리를 참조하고 다른 스레드에서 메모리를 해제하는 경쟁 조건을 확인할 수 있지만, 메모리 참조가 해제 전에 일어남을 확신할 수 있는 관측할 수 있는 동기화 이벤트가 없습니다.</p><p>이 기능은 Valgrind 3.7.0에 새로 추가되었으며 실험적 기능으로 간주됩니다. 사용자 정의 메모리 할당자와의 상호 작용이 아직까지 잘 확인되지 않았기 때문에 이 옵션은 기본값으로 비활성화되어 있습니다. 사용자 피드백이 필요합니다.</p></body></html>
nl: <html><head/><body><p>Indien ingeschakeld (niet de standaard), behandelt Helgrind het vrijgeven van heap-geheugen als of het geheugen was beschreven onmiddellijk voor het vrijgeven. Dit maakt races duidelijk waar geheugen wordt gebruikt door de ene thread en wordt vrijgeven door een ander, maar er is geen zichtbare synchronisatiegbeurtenis om te verzekeren dat het gebruik gebeurt voor het vrijgeven.</p><p>Deze functionaliteit is nieuw in Valgrind 3.7.0 en wordt beschouwd als experimenteel. Het is niet standaard ingeschakeld omdat zijn interactie met eigen geheugen is op dit moment goed begrepen. Uw terugkoppeling wordt welkom geheten.</p></body></html>
pl: <html><head/><body><p>Gdy włączone (niedomyślnie), Helgrind traktuje zwolnienie pamięci sterty tak jakby pamięć była zapisana bezpośrednio przez zwolnieniem. Uwidacznia to gonitwy, w których następuje odwołanie do pamięci przez jeden wątek, a następnie jest ona zwalniana w innym wątku, lecz nie ma zauważalnego zdrzaenia synchronizacji, który zapewni, że odwołanie nastąpi przed zwolnieniem.</p><p>Jest to nowa funkcjonalność wValgrind 3.7.0 i jest uznawana za eksperymentalną. Nie jest włączona domyślnie, gdyż jej współdziałanie z własnym przydzielaniem pamięci jest jeszcze niedostatecznie poznana. Informacja zwrotna jest wielce oczekiwana.</p></body></html>
pt: <html><head/><body><p>Quando estiver activo (não o está por omissão), o Helgrind trata a libertação da memória de dados, como se a memória fosse escrita imediatamente antes da libertação. Isto expõe alguns problemas de concorrência onde a memória é referenciada por uma tarefa e libertada por outra, mas sem existir nenhum evento de sincronização notório para garantir que a referência ocorre antes da libertação.</p><p>Esta funcionalidade é nova no Valgrind 3.7.0 e é tida como experimental. Não está activa por omissão, porque a sua interacção com os módulos de alocação personalizados ainda não é devidamente tratado no momento presente. Agradecem-se as reacções por parte dos utilizadores.</p></body></html>
pt_br: <html><head/><body><p>Quando habilitado (não é o padrão), o Helgrind trata a liberação de memória heap como se a memória tivesse sido gravada imediatamente antes da liberação. Isso expõe disputas em que a memória é referenciada por uma thread e liberada por outra, mas não há nenhum evento de sincronização observável para garantir que a referência ocorra antes da liberação.</p><p>Esta funcionalidade é nova no Valgrind 3.7.0 e é considerada experimental. Ela não é habilitada por padrão porque sua interação com alocadores de memória personalizados não é bem compreendida no momento. Comentários dos usuários são bem-vindos.</p></body></html>
sv: <html><head/><body><p>När aktiverat (inte normalvärdet), behandlar Helgrind frigörelse av heap-minne som om minnet omedelbart skrevs innan frigörelsen. Det avslöjar kapplöpningar dör minne refereras av en tråd, och frigörs av en annan, men ingen observerbar synkroniseringshändelse finns för att försäkra att referensen sker innan frigörelsen.</p><p>Funktionen är ny i Valgrind 3.7.0, och anses experimentell. Den är inte normalt aktiverad eftersom dess växelverkan med egen minnestilldelning inte förstås väl för närvarande. Användarnas synpunkter välkomnas.</p></body></html>
tr: <html><head/><body><p>Etkinleştirildiğinde (varsayılan değil), Helgrind küme ön belleğin boşaltılmasına sanki ön belleğe boşaltmadan hemen önce yazılmış gibi davranır. Bu belleğin bir iş parçacığı tarafından adreslendiğinde ve diğer tarafından boşaltıldığında yarışlar meydana getirir ama adresin boşaltmadan önce gerçekleştiğinden emin olmak için gözlemlenebilir bir eşzamanlama olayı yoktur.</p><p>Bu işlevsellik Valgrind 3.7.0 ' de yenidir ve deneysel olarak sunulmaktadır. Varsayılan olarak etkinleştirilmemiştir çünkü özel önbellek ayırıcıları ile ilişkileri şu an iyi anlaşılmamıştır. Kullanıcı geri bildirimleri memnuniyetle karşılanır.</p></body></html>
uk: <html><head/><body><p>Якщо увімкнено (нетипова поведінка), Helgrind вважатиме, що безпосередньо перед вивільненням пам’яті «купи» до неї було виконано запис. Це надасть змогу виявити ситуації, коли на пам’ять посилався один потік виконання, а вивільнено пам’ять було у іншому потоці без видимої події синхронізації для забезпечення належного порядку: спочатку посилання, потім вивільнення.</p><p>Ця можливість є новою у Valgrind 3.7.0, вона вважається експериментальною. Типово її не увімкнено, оскільки її взаємодію із нетиповими засобами розміщення у пам’яті ще недостатньо вивчено. Розробники будуть раді відгукам користувачів.</p></body></html>
zh_cn: <html><head/><body><p>如果启用（非默认），Helgrind 会在堆内存被释放时假装这些内存在释放前刚被写入过。这可以检测到类似这样的竞争性访问：如果内存被一个线程引用，同时被另一个线程释放，但是它们之间没有可见的同步事件来保证引用一定在释放前发生。</p><p>这是一个 Valgrind 3.7.0 中的新功能，还是实验性的。之所以它默认不被启用，是因为现在对它和自定义内存分配器之间的交互还没有一个很好的理解。欢迎用户反馈。</p></body></html>

source: Free is write (experimental)
ar: التحرير كتابة (تجريبيّ)
ca: L'alliberament és una escriptura (experimental)
eo: 'Free' estas skribo (eksperimenta)
es: La liberación es una escritura (experimental)
fr: Libre veut dire écriture (expérimental)
gl: Liberar é escribir (experimental).
ka: გათავისუფლება ჩაწერაა (ექსპერიმენტული)
ko: Free를 쓰기로 간주(실험적)
nl: Vrijgeven is schrijven (experimenteel)
pl: Zwolnienie to zapis (eksperymentalnie)
pt: A libertação é uma escrita (experimental)
pt_br: Livre é escrita (experimental)
sv: Frigörelse är skrivning (experimentell)
tr: Boş yazılır (deneysel)
uk: Вивільнення є записом (експериментальне)
zh_cn: 将释放视作写入 (实验性)

source: Helgrind (Thread Error Detector)
ar: Helgrind (كاشف خطأ السلسلة)
ca: Helgrind (Detector d'errors de fils)
eo: Helgrind (Detektilo pri Fadena Eraro)
es: Helgrind (detector de errores de hilos)
fr: Helgrind (Détecteur d'erreur de process)
gl: Helgrind (detector de erros de fíos)
it: Helgrind (rilevatore di errori nei thread)
ka: Helgrind (ნაკადის შეცდომის აღმომჩენი)
ko: Helgrind(스레드 오류 감지기)
nl: Helgrind (detector van thread-fouten)
pl: Helgrind (wykrywacz błędów w wątkach)
pt: Helgrind (Detector de Erros entre Tarefas)
pt_br: Helgrind (Detector de Erros de Thread)
sv: Helgrind (detekteringsverktyg för trådfel)
tr: Helgrind (İş Parçacığı Hata Algılayıcı)
uk: Helgrind (засіб виявлення помилок із потоками)
zh_cn: Helgrind (线程错误检测器)

source: CPU instructions
ar: تعليمات وحدة المعالجة المركزية
ca: Instruccions de la CPU
eo: Instrukcioj pri CPU
es: Instrucciones de la CPU
fr: Instructions du processeur
gl: Instrucións da CPU
it: Istruzioni CPU
ka: პროცესორის ინსტრუქციები
ko: CPU 명령
nl: CPU-instructies
pl: Instrukcje CPU
pt: Instruções do CPU
pt_br: Instruções da CPU
sv: Processorinstruktioner
tr: İşlemci yönergeleri
uk: Команди процесора
zh_cn: CPU 指令

source: Milliseconds
ar: ملّي ثانية
ca: Mil·lisegons
eo: Milisekundoj
es: Milisegundos
fr: Millisecondes
gl: Milisegundos
it: Millisecondi
ka: მილიწამი
ko: 밀리초
nl: Milliseconden
pl: Milisekundy
pt: Milisegundos
pt_br: Milissegundos
sv: Millisekunder
tr: Milisaniye
uk: мілісекунди
zh_cn: 毫秒

source: Bytes allocated
ar: بايتات مخصّصة
ca: Bytes assignats
eo: Bajtoj asignitaj
es: Bytes asignados
fr: Octets alloués
gl: Bytes asignados
it: Byte allocati
ka: გამოყოფილი ბაიტი
ko: 할당한 바이트
nl: Gealloceerde bytes
pl: Przydzielonych bajtów
pt: 'Bytes' alocados
pt_br: Bytes alocados
sv: Använda byte
tr: Ayrılmış baytlar
uk: Виділені байти
zh_cn: 已分配字节

source: Time unit:
ar: وحدة الوقت:
ca: Unitat de temps:
eo: Tempounuo:
es: Unidad de tiempo:
fr: Unité de temps :
gl: Unidade de tempo:
it: Unità di tempo:
ka: დროის ერთეული:
ko: 시간 단위:
nl: Tijdseenheid:
pl: Jednostka czasu:
pt: Unidade de tempo:
pt_br: Unidade de tempo:
sv: Tidsenhet:
tr: Zaman birimi:
uk: Одиниця часу:
zh_cn: 时间单位：

source: Snapshot tree depth:
ar: عمق شجرة اللقطة:
ca: Profunditat de l'arbre de les captures:
eo: Momentfoto-arba profundo:
es: Profundidad del árbol de instantáneas:
fr: Profondeur de l'arborescence des images :
gl: Profundidade da árbore de capturas:
it: Profondità albero per le istantanee:
ka: სწრაფი ასლის ხის სიღრმე:
ko: 스냅샷 트리 깊이:
nl: Diepte van boomstructuur van momentopname:
pl: Głębokość drzewa zrzutu:
pt: Profundidade da árvore de imagens:
pt_br: Profundidade da árvore dos instantâneos:
sv: Träddjup för ögonblicksbild:
tr: Ağaç derinliği anlık görüntüsü:
uk: Глибина ієрархії знімка:
zh_cn: 快照树深度：

source: <html><head/><body><p>Maximum depth of the allocation trees recorded for detailed snapshots. Increasing it will make Massif run somewhat more slowly, use more memory, and produce bigger output files.</p></body></html>
ar: <html><head/><body><p>العمق الأقصى لأشجار التّخصيص المسجّلة للقطات المفصّلة. زيادة هذا يجعل Massif يعمل ببطء أكثر قليلاً، يستخدم ذاكرة أكثر، و ينتج ملفات مخرجات أكبر.</p></body></html>
ca: <html><head/><body><p>Profunditat màxima dels arbres d'assignació gravats per a les captures detallades. En augmentar-ho farà que el Massif s'executi una mica més lentament, usi més memòria, i produeixi fitxers de sortida més grans.</p></body></html>
eo: <html><head/><body><p>Maksimuma profundo de la asignarboj registritaj por detalaj momentfotoj. Pliigante ĝin, Massif funkciigos iom pli malrapide, uzos pli da memoro kaj produktos pli grandajn eligajn dosierojn.</p></body></html>
es: <html><head/><body><p>La profundidad máxima de los árboles de asignación que se graban en las instantáneas detalladas. Si se aumenta este valor, Massif se ejecutará algo más lento, usará más memoria y producirá archivos de salida mayores.</p></body></html>
fr: <html><head/><body><p> Profondeur maximale des arbres d'allocation enregistrés pour des instantanés détaillés. Son accroissement rendra l'exécution de Massif quelque peu plus lente, avec une plus grande utilisation mémoire et la production de fichiers de sorties plus volumineux.</p></body></html>
gl: <html><head/><body><p>Profundidade máxima das árbores de asignación gravadas para capturas detalladas. Aumentala fará que Massif funcione lixeiramente máis lento, use máis memoria, e produza ficheiros de saída máis grandes.</p></body></html>
ka: <html><head/><body><p>დეტალური სწრაფი ასლებისთვის ჩაწერილი მეხსიერების გამოყოფის ხეების მაქსიმალური სიღრმე. ამ მნიშვნელობის გაზრდა Massif-ს ოდნავ შეანელებს, გაზრდის მეხსიერების გამოყენებას და წარმოქმნის უფრო დიდ გამონატან ფაილებს.</p></body></html>
ko: <html><head/><body><p>자세한 스냅샷에 기록할 스냅샷 트리 최대 깊이입니다. 이 설정을 증가시키면 Massif 실행이 더 느려지고, 메모리를 더 사용하고, 더 큰 출력 파일을 생성합니다.</p></body></html>
nl: <html><head/><body><p>Maximum diepte van de allocatieboomstructuren opgenomen voor gedetailleerde snapshots. Het vergroten zal maken dat Massif iets langzamer zal draaien, zal meer geheugen gebruiken en zal grotere uitvoerbestanden produceren.</p></body></html>
pl: <html><head/><body><p>Największa głębokość drzew przydziałów dla szczegółowych zrzutów. Zwiększenie tej wartości sprawi, że Massif będzie działał trochę wolniej, wykorzystywał więcej pamięci i tworzył większe pliki wynikowe.</p></body></html>
pt: <html><head/><body><p>Profundidade máxima das árvores de alocação registadas para as imagens detalhadas. O aumento desta fará com que o Massif se execute de forma um pouco mais lenta, use mais memória e produza ficheiros de resultado maiores.</p></body></html>
pt_br: <html><head/><body><p>Profundidade máxima das árvores de alocação registradas para instantâneos detalhados. Aumentá-la tornará o Massif um pouco mais lento, usará mais memória e produzirá arquivos de saída maiores.</p></body></html>
sv: <html><head/><body><p>Maximalt djup av tilldelningsträden som lagras för detaljerade ögonblicksbilder. Att öka det gör att Massif kör något långsammare, använder mer minne, och skapar större utdatafiler.</p></body></html>
tr: Detaylı anlık görüntüler için tahsis ağaçlarının azami derinliği kaydedildi. Bunu artırmak bir şekilde Massif çalıştırmayı daha yavaşlatacaktır, daha fazla bellek kullanır ve daha büyük çıktı dosyaları oluşturur.</p></body></html>
uk: <html><head/><body><p>Максимальна глибина ієрархій розміщення даних, які записано для докладних знімків. Збільшення цього значення дещо уповільнить Massif та збільшить споживання пам’яті, а також призведе до зростання об’єму створених програмою файлів.</p></body></html>
zh_cn: <html><head/><body><p>详细快照中记录的分配树的最大深度。增加它会使得 Massif 运行得更慢一些，使用更多内存，还会产生更大的输出文件。</p></body></html>

source: Threshold:
ar: العتبة:
ca: Llindar:
eo: Pentrosojlo:
es: Umbral:
fr: Seuil :
gl: Limiar:
it: Soglia:
ka: ზღვარი:
ko: 임곗값:
nl: Drempel:
pl: Próg:
pt: Limiar:
pt_br: Limite:
sv: Tröskel:
tr: Eşik değer:
uk: Поріг:
zh_cn: 界限：

source: Peak inaccuracy:
ar: عدم دقة الذروة:
ca: Divergència del pic:
eo: Pinta malprecizeco:
es: Imprecisión del pico:
fr: Divergence de pic :
gl: Inexactitude do pico:
ka: პიკური უზუსტობა:
ko: 부정확도 극값:
nl: Piektolerantie:
pl: Niedokładność szczytu:
pt: Divergência do pico:
pt_br: Divergência do pico:
sv: Högsta onoggrannhet:
tr: Tepe hataları:
uk: Похибка піків:
zh_cn: 最高不精确度：

source: Maximum snapshots:
ar: اللقطات القصوى:
ca: Màxim de captures:
eo: Maksimumaj momentfotoj:
es: Máximo de instantáneas:
fr: Nombre maximum d'images :
gl: Capturas máximas:
it: Istantanee massime:
ka: მაქს. სწრაფი ასლები:
ko: 최대 스냅샷:
nl: Maximum aantal momentopnamen:
pl: Maks. zrzutów ekranu:
pt: Máximo de imagens:
pt_br: Máximo de instantâneos:
sv: Maximalt antal ögonblicksbilder:
tr: Azami anlık görüntüler:
uk: Макс. к-ть знімків:
zh_cn: 最多快照数：

source: <html><head/><body><p>The maximum number of snapshots recorded. If set to N, for all programs except very short-running ones, the final number of snapshots will be between N/2 and N.</p></body></html>
ar: <html><head/><body><p>العدد الأقصى من اللقطات المسجّلة. إذا ضُبِط على N، لكل البرامج ما عدا تلك التي تعمل لوقت قصير جداً، يكون العدد النهائي من اللقطات بين N/2 و N.</p></body></html>
ca: <html><head/><body><p>El nombre màxim de captures enregistrades. Si s'estableix a N, per a tots els programes excepte els de molt curta execució, el nombre final de captures estarà entre N/2 i N.</p></body></html>
eo: <html><head/><body><p>La maksimuma nombro da momentfotoj registritaj. Se agordita al N, por ĉiuj programoj krom tre mallongdaŭraj, la fina nombro da momentfotoj estos inter N/2 kaj N.</p></body></html>
es: <html><head/><body><p>El número máximo de instantáneas grabadas. Si se ajusta a N, para todos los programas excepto los que tienen una ejecución muy corta, el número final de instantáneas estará entre N/2 y N.</p></body></html>
fr: <html><head/><body><p>Le nombre maximum de copies d'écran enregistrés. Si positionné à « N », pour tous les programmes exceptés ceux avec un temps court d'exécution, le nombre final de copies d'écran sera entre « N / 2 » et « N »</p></body></html>
gl: <html><head/><body><p>O número máximo de capturas gravadas. Se o estabelece a N, o número final de capturas estará entre N/2 e N para todos os programas salvo os que se executen moi rápido.</p></body></html>
ka: <html><head/><body><p>ჩაწერილი სწრაფი ასლების მაქსიმალური რაოდენობა. თუ მითითებულია N, ყველა პროგრამისთვის, გარდა ძალიან ხანმოკლეებისა, სწრაფი ასლების საბოლოო რაოდენობა იქნება N/2-სა და N-ს შორის.</p></body></html>
ko: <html><head/><body><p>최대로 기록할 스냅샷 개수입니다. N으로 설정하면 매우 짧게 실행되고 끝나는 프로그램이 아니라면 최대 스냅샷 개수는 N/2에서 N개 사이입니다.</p></body></html>
nl: <html><head/><body><p>Het maximum aantal opgenomen snapshots. Indien ingesteld op N, voor alle programma's behalve erg kort durenden, zal het uiteindelijke aantal snapshots liggen tussen N/2 en N.</p></body></html>
pl: <html><head/><body><p>Największa liczba zapisanych zrzutów. Jeśli ustawiona na N, to dla wszystkich programów poza bardzo krótkimi, ostateczna liczba zrzutów będzie pomiędzy N/2 i N.</p></body></html>
pt: <html><head/><body><p>O número máximo de imagens guardadas. Se for igual a N, para todos os programas exceptuando os de execução muito curta, o número final de imagens ficará algures entre N/2 e N.</p></body></html>
pt_br: <html><head/><body><p>O número máximo de snapshots gravados. Se definido como N, para todos os programas, exceto os de duração muito curta, o número final de snapshots ficará entre N/2 e N.</p></body></html>
sv: <html><head/><body><p>Det maximala antalet ögonblicksbilder som spelas in. Om det är inställt till N, blir det slutliga antalet ögonblicksbilder mellan N/2 och N, för alla program utom sådana som kör mycket kort tid.</p></body></html>
tr: <html><head/><body><p>Kaydedilmiş anlık görüntülerin azami sayısı. N ' e ayarlandıysa, çok kısa çalışanlar hariç tüm programlar için, anlık görüntülerin nihai sayısı N/2 ve N arasında olacaktır.</p></body></html>
uk: <html><head/><body><p>Максимальна кількість записаних знімків. Якщо встановити значення N, для усіх програм, окрім тих, які виконуються дуже швидко, остаточна кількість знімків коливатиметься від N/2 до N.</p></body></html>
zh_cn: <html><head/><body><p>最多记录的快照数。如果设置为 N，那对除了运行时间非常短的程序以外的所有程序，最后快照数量会在 N/2 和 N 之间。</p></body></html>

source: Detailed snapshot frequency:
ar: تكرار اللقطة المفصّلة:
ca: Freqüència de les captures detallades:
eo: Detala momentfotofrekvenco:
es: Frecuencia de instantáneas detalladas:
fr: Fréquence détaillée d'images :
gl: Frecuencia das capturas detalladas:
it: Frequenza istantanee dettagliate:
ka: დეტალური სწრაფი ასლის სიხშირე:
ko: 자세한 스냅샷 빈도:
nl: Frequentie van gedetailleerde momentopname:
pl: Częstotliwość szczegółowych zrzutów:
pt: Frequência de imagens detalhadas:
pt_br: Frequência dos instantâneos detalhados:
sv: Detaljerad frekvens för ögonblicksbild:
tr: Detaylı anlık görüntü frekansı:
uk: Частота докладних знімків:
zh_cn: 详细快照频率：
