Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>When making blocks from the queue of freed blocks available for re-allocation, Memcheck will in priority re-circulate the blocks with a size greater or equal to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. This ensures that freeing big blocks (in particular freeing blocks bigger than <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) does not immediately lead to a re-circulation of all (or a lot of) the small blocks in the free list. In other words, this option increases the likelihood to discover dangling pointers for the &quot;small&quot; blocks, even when big blocks are freed.</p><p>Setting a value of 0 means that all the blocks are re-circulated in a FIFO order.</p></body></html>
ar: <html><head/><body><p>عند جعل الكتل من قائمة الانتظار للكتل المحررة متاحة لإعادة التخصيص، سيعيد Memcheck تدوير الكتل التي حجمها أكبر من أو يساوي <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span> كأولوية. يضمن هذا أن تحرير الكتل الكبيرة (خاصة تحرير الكتل الأكبر من <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) لا يؤدي على الفور إلى إعادة تدوير كل (أو الكثير من) الكتل الصغيرة في قائمة التحرير. بعبارة أخرى، يزيد هذا الخيار من احتمالية اكتشاف المؤشرات المعلقة للكتل «الصغيرة»، حتى عندما تحرر كتل كبيرة.</p><p>اضبط قيمة 0 تعني أن كل الكتل تعاد تدويرها بترتيب الأول-يدخل-الأول-يخرج (FIFO).</p></body></html>
ca: <html><head/><body><p>En fer blocs des de la cua de blocs alliberats disponibles per a la seva reassignació, el Memcheck prioritzarà la recirculació dels blocs amb una mida superior o igual que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Això assegura que l'alliberament de blocs grans (en particular alliberant els blocs superiors a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) no comporta immediatament la recirculació de tots (o molts) blocs petits de la llista de blocs lliures. En altres paraules, aquesta opció incrementa la possibilitat de descobrir apuntadors penjants («dangling») pels blocs «petits», encara que s'alliberin blocs grans.</p><p>Si s'estableix un valor de 0, significa que tots els blocs es recirculen segons l'ordre FIFO.</p></body></html>
eo: <html><head/><body><p>Kiam disponigas blokojn el la vico de liberigitaj blokoj por reasignado, Memcheck prioritate recirkulas la blokojn kun grandeco pli granda aŭ egala al <span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;">--freelist-big-blocks</span>. Ĉi tio certigas, ke liberigo de grandaj blokoj (precipe liberigo de blokoj pli grandaj ol <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) ne tuj kondukas al recirkulado de ĉiuj (aŭ multaj) la etaj blokoj en la libera listo. Alivorte, ĉi tiu opcio pliigas la verŝajnecon malkovri pendantajn montrilojn por la "malgrandaj" blokoj, eĉ kiam grandaj blokoj estas liberigitaj.</p><p>Agordi valoron de 0 signifas ke ĉiuj blokoj estas recirkulataj en FIFO-ordono.</p></body></html>
es: <html><head/><body><p>Cuando se ponen a disposición para volver a ser asignados los bloques existentes en la cola de bloques liberados, Memcheck redistribuirá prioritariamente los bloques con un tamaño mayor o igual a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Esto asegura que la liberación de bloques grandes (en particular la liberación de bloques mayores que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) no lleva inmediatamente a la redistribución de todos (o de gran parte) de los bloques pequeños existentes en la lista de liberados. En otras palabras, esta opción aumenta la probabilidad de descubrir punteros colgantes en los bloques «pequeños», incluso cuando se liberan bloques grandes.</p><p>Un valor de 0 significa que todos los bloques se redistribuyen siguiendo el orden FIFO.</p></body></html>
fr: <html><head/><body><p> Lors du traitement de blocs à partir de la file de blocs libérés, disponibles pour ré-allocation, Memcheck fera en priorité re-circuler les blocs avec une taille supérieure ou égale à<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Cela garantit que la libération de blocs de grande taille (en particulier ceux plus grand que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) ne conduisent pas à la re-circulation de tous (ou un grand nombre) de blocs de petite taille dans la file de libération. En d'autres termes, cette option augmente la probabilité de découvrir des pointeurs erronés pour les blocs de &quot;de petite taille&quot;, même quand les blocs de grande taille sont libérés.</p><p>Le paramétrage de la valeur à 0 signifie que tous les blocs sont ré-ordonnés en file d'attente.</p></body></html>
gl: <html><head/><body><p>Ao facer bloques da cola de bloques liberados dispoñíbeis para unha nova asignación, Memcheck circulará de novo e en orde de prioridade polos bloques cun tamaño igual ou superior a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Isto asegura que liberar bloques grandes (especialmente os máis grandes de <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) non leva inmediatamente a circular de novo por todos (ou unha gran parte de) os bloques pequenos na lista de liberación. Noutras palabras, esta opción aumenta a probabilidade de descubrir punteiros rotos para os bloques «pequenos», incluso cando se liberan os bloques grandes.</p><p>Usar o valor «0» significa que se circulará por todos os bloques en orde de entrada (FIFO).</p></body></html>
ka: <html><head/><body><p>გათავისუფლებული ბლოკების რიგიდან ხელახალი გამოყოფისთვის ბლოკების მომზადებისას, Memcheck პრიორიტეტულად დააბრუნებს ბრუნვაში იმ ბლოკებს, რომელთა ზომა მეტია ან ტოლია <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span> მნიშვნელობაზე. ეს უზრუნველყოფს, რომ დიდი ბლოკების გათავისუფლებამ (კერძოდ, <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>-ზე დიდი ბლოკების) დაუყოვნებლივ არ გამოიწვიოს გათავისუფლებულთა სიაში არსებული ყველა (ან ბევრი) მცირე ბლოკის ხელახალი მიმოქცევა. სხვა სიტყვებით, ეს პარამეტრი ზრდის „მცირე“ ბლოკებისთვის დაკიდებული მიმთითებლების აღმოჩენის ალბათობას, მაშინაც კი, როდესაც დიდი ბლოკები თავისუფლდება.</p><p>0 მნიშვნელობის დაყენება ნიშნავს, რომ ყველა ბლოკი ბრუნვაში ბრუნდება FIFO (პირველი შემოსული - პირველი გასული) პრინციპით.</p></body></html>
ko: <html><head/><body><p>해제된 블록 대기열을 다시 할당할 수 있도록 만들 때 Memcheck에서는 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span> 옵션으로 지정한 크기보다 크거나 같은 블록을 더 먼저 재순환시킵니다. 큰 블록을 해제했을 때(<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>보다 큰 경우) 해제 목록의 모든(또는 대량의) 작은 블록을 곧바로 재순환시키지 않습니다. 즉, 이 옵션은 큰 블록이 해제되었다고 하더라도 &quot;작은&quot; 블록을 가리키는 허상 포인터를 발견할 수 있는 기회를 증가시킵니다.</p><p>0으로 설정하면 모든 블록을 FIFO 순서로 재순환시킵니다.</p></body></html>
nl: <html><head/><body><p>Bij het beschikbaar maken van blokken uit de lijst van vrijgegeven blokken voor her-allocatie, zal Memcheck prioriteit geven aan blokken met een grootte die groter of gelijk is dan <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blokken</span>. Dit zorgt ervoor dat door vrijgave van grote blokken (met name door vrijgave van blokken groter dan <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) niet onmiddellijk tot hercirculatie lijdt van alle (of een heleboel) van de kleine blokken in de vrijgave lijst. Met andere woorden, deze instelling vergroot de kans op ontdekking van hangende pointers naar de &quot;kleine&quot; blokken, zelfs als de grote blokken zijn vrijgegeven.</p><p>Een waarde van 0 instellen houdt in dat alle blokken in circulatie komen op een FIFO-volgorde.</p></body></html>
pl: <html><head/><body><p>Przy tworzeniu bloków z kolejki zwolnionych bloków dostępnych do ponownego przydzielenia, Memcheck będzie przedkładał bloki o rozmiarze większym lub równym <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Zapewnia to, że zwalnianie dużych bloków (w szczególności zwalnianie bloków większych niż <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) nie sprawia od razu ponownej recyrkulacji wszystkich (lub wielu) małych bloków na liście zwalnianych. Innymi słowy, opcja ta zwiększa prawdopodobieństwo wykrycia zagubionych wskaźników dla &quot;małych&quot; bloków, nawet w przypadku zwalniania dużych bloków.</p><p>Ustawienie wartości na 0 oznacza, że wszystkie bloki są poddane recyrkulacji w kolejności FIFO.</p></body></html>
pt: <html><head/><body><p>Ao criar blocos a partir da lista de blocos libertados e disponíveis para nova alocação, o Memcheck irá voltar a circular por prioridade os blocos com um tamanho maior ou igual ao valor do <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Isto garante que a libertação de blocos grandes (em particular, a libertação de blocos maiores que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) não conduz imediatamente a uma nova circulação de todos (ou uma boa parte) dos pequenos blocos na lista de libertações. Por outras palavras, esta opção aumenta a probabilidade de descobrir ponteiros 'soltos' para os blocos &quot;pequenos&quot;, mesmo quando os blocos grandes são libertados.</p><p>A definição de um valor como igual a 0 significa que todos os blocos são circulados segundo uma ordem FIFO.</p></body></html>
pt_br: <html><head/><body><p>Ao disponibilizar blocos da fila de blocos liberados para realocação, o Memcheck recirculará prioritariamente os blocos com tamanho maior ou igual a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Isso garante que a liberação de blocos grandes (em particular, a liberação de blocos maiores que <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) não leve imediatamente à recirculação de todos (ou de muitos) os blocos pequenos na lista livre. Em outras palavras, essa opção aumenta a probabilidade de descobrir ponteiros pendentes para o bloco &quot;pequeno&quot; blocos, mesmo quando blocos grandes são liberados.</p><p>Definir um valor de 0 significa que todos os blocos são recirculados em uma ordem FIFO.</p></body></html>
sv: <html><head/><body><p>När block från kön med frigjorda block görs tillgängliga för ny tilldelning, återcirkulerar Memcheck blocken i prioritetsordning med en storlek större än eller lika med <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Det försäkrar ett frigörelse av stora block (i synnerhet frigörelse av block större än <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) inte omedelbart leder till att alla (eller många) av de små blocken i frilistan återcirkuleras. Med andra ord ökar alternativet sannolikheten att upptäcka dinglande pekare för &quot;små&quot; block, även när stora block frigörs.</p><p>Att ange värdet 0 betyder att alla block återcirkuleras i FIFO-ordning.</p></body></html>
tr: <html><head/><body><p>Tekrar tahsis etme için hazır boşaltılmış blokların kuyruğundan bloklar oluştururken, Memcheck öncelikle blokları <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span> ' dan büyük veya ona eşit bir boyutla tekrar dolaştırır. Bu büyük blokların (özellikle <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span> 'den büyük blokların boşaltılması) boşaltılmasının aniden serbest listesindeki küçük blokların hepsinin (veya birçoğunun) tekrar dolaşımına yol açmamasını sağlar. Başka bir deyişle, bu seçenek büyük bloklar serbest bırakıldığında bile "küçük" bloklar için asılı işaretçileri bulma olasılığını artırır..</p><p>0 ' a ayarlamak tüm blokların bir FIFO sırası içinde tekrar dolaşıma çıkarıldığı anlamına gelir.</p></body></html>
uk: <html><head/><body><p>Роблячи блоки з черги вивільнених блоків доступними для повторного розміщення даних, Memcheck за пріоритетністю повертає до обігу блоки з розміром, який рівний або перевищує значення параметра <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span>. Таким чином забезпечується те, що вивільнення великих блоків (зокрема вивільнення блоків, розмір яких перевищує значення параметра <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span>) не призводить до негайного повернення до обігу усіх (або більшості) малих блоків у списку вивільнення. Іншими словами, цей параметр збільшує ймовірність виявлення «завислих» вказівників на «малі» блоки, навіть коли вивільняються великі блоки.</p><p>Встановлення значення 0 для цього параметра означатиме, що усі блоки повертатимуться до обігу у порядку «перший надійшов — перший вивільниться».</p></body></html>
zh_cn: <html><head/><body><p>当从已被释放的块队列中取出块来用于重新分配时，Memcheck 会优先重用那些大小大于等于 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-big-blocks</span> 的块。这保证了释放掉一个大的块（特别是那些大于 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">--freelist-vol</span> 的块）不会立刻导致所有（或者大量）已释放列表中的小块被重用。换句话说，这个选项提高了发现指向 &quot;小&quot; 块的悬空指针的可能性，即使在有大块被释放的情况下。</p><p>将此值设置为 0 意味着所有块会按照 FIFO（先进先出）的次序被重用。</p></body></html>

source: <html><head/><body><p>Controls whether Memcheck reports uses of undefined value errors. Set this to <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> if you don't want to see undefined value errors. It also has the side effect of speeding up Memcheck somewhat.</p></body></html>
ar: <html><head/><body><p>يتحكّم في ما إذا أبلغ Memcheck عن استخدامات أخطاء القيمة غير المحدّدة. اضبط هذا على <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> إن لم ترد رؤية أخطاء القيمة غير المحدّدة. له أيضًا تأثير جانبي وهو تسريع Memcheck إلى حد ما.</p></body></html>
ca: <html><head/><body><p>Controla si els informes del Memcheck usen errors de valors no definits. Establiu això a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> si no voleu veure errors de valors no definits. També té l'efecte lateral d'accelerar una mica el Memcheck.</p></body></html>
eo: <html><head/><body><p>Regas ĉu Memcheck raportas uzojn de nedifinitaj valoreraroj. Agordu ĉi tion al <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">ne</span> se vi ne volas vidi nedifinitajn valorerarojn. Ĝi ankaŭ havas la kromefikon iom plirapidigi Memcheck.</p></body></html>
es: <html><head/><body><p>Controla si Memcheck informa de los errores de usos de valores no definidos. Use el valor <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> si no desea ver errores de valores no definidos. Esto también tiene el efecto colateral de acelerar de algún modo la ejecución de Memcheck.</p></body></html>
fr: <html><head/><body><p>Contrôle si Memcheck t utilisations des erreurs de valeurs indéfinies. Définir ceci à <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">non</span> si vous ne voulez pas voir les erreurs sur valeurs indéfinies. Cela présente aussi un effet de bord en accélérant quelque peu Memcheck.</p></body></html>
gl: <html><head/><body><p>Controla se Memcheck informa de usos de valores sen definir. Estabelézao a <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> se non quere ver os erros de valores sen definir. Tamén ten o efecto secundario de aumentar lixeiramente a velocidade de Memcheck.</p></body></html>
ka: <html><head/><body><p>აკონტროლებს, უნდა მოახსენოს თუ არა Memcheck-მა განუსაზღვრელი მნიშვნელობების გამოყენების შეცდომები. მიანიჭეთ მნიშვნელობა <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, თუ არ გსურთ ამ შეცდომების ნახვა. ამას ასევე აქვს თანმდევი ეფექტი — Memcheck-ის მუშაობის გარკვეულწილად დაჩქარება.</p></body></html>
ko: <html><head/><body><p>Memcheck에서 정의되지 않은 값 사용 오류를 보고할지 설정합니다. <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>로 설정하면 정의되지 않은 값을 표시하지 않습니다. Memcheck 성능을 향상시킬 수도 있습니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in of Memcheck foutmeldingen geeft over het gebruik van ongedefinieerde waarden. Stel dit in op <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">nee</span> als u geen foutmeldingen wilt zien over ongedefinieerde waarden. Een bijeffect is dat Memcheck een beetje sneller is.</p></body></html>
pl: <html><head/><body><p>Określa czy Memcheck zgłasza użycia niezdefiniowanych wartości. Ustaw to na <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> jeśli nie chcesz widzieć błędów związanych z niezdefiniowanymi wartościami. Ma to efekt uboczny w postaci przyspieszenia Memcheck .</p></body></html>
pt: <html><head/><body><p>Controla se o Memcheck comunica os erros dos usos de valores indefinidos. Configure isto como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> se não quiser ver erros de valores indefinidos. Também tem o efeito colateral de acelerar um pouco o Memcheck.</p></body></html>
pt_br: <html><head/><body><p>Controla se o Memcheck reporta o uso de erros de valores indefinidos. Defina como <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> se não quiser ver erros de valores indefinidos. Isso também tem o efeito colateral de acelerar o Memcheck um pouco.</p></body></html>
sv: <html><head/><body><p>Bestämmer om Memcheck rapporterar fel för användning av odefinierade värden. Ställ in det till <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> om du inte vill se fel för odefinierade värden. Det har också sidoeffekten att Memcheck blir något snabbare.</p></body></html>
tr: <html><head/><body><p>Memcheck ' in tanımlanmamış değer hatalarının kullanımlarını raporlayıp raporlamayacağını denetler. Eper tanımlanmamış değer hatalarını görmek istemiyorsanız bunu <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span> ' a ayarlayınız. Bunun ayrıca Memcheck ' in bir şekilde hızlanmasına etkisi de vardır.</p></body></html>
uk: <html><head/><body><p>Керує тим, чи слід Memcheck звітувати про помилки, які пов’язано із використанням невизначених значень. Встановіть значення <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>, якщо вам непотрібні повідомлення щодо таких помилок. Побіжним ефектом вимикання цих помилок є певне пришвидшення роботи Memcheck.</p></body></html>
zh_cn: <html><head/><body><p>控制 Memcheck 是否要报告未定义值错误。如果您不想看见未定义值错误，将此设置为 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">no</span>。这同时也有稍微加快 Memcheck 运行速度的副作用。</p></body></html>

source: Show undefined values usage
ar: اعرض استخدام القيم غير المحدّدة
ca: Mostra l'ús de valors sense definir
eo: Montri uzadon de nedifinitaj valoroj
es: Mostrar el uso de valores no definidos
fr: Afficher l'usage des valeurs non initialisées
gl: Mostrar o uso de valores non definidos.
it: Mostra l'uso di valori non definiti
ka: განუსაზღვრელი მნიშვნელობების გამოყენების ჩვენება
ko: 정의되지 않은 값 사용 표시:
nl: Gebruik van ongedefinieerde waarden tonen
pl: Pokaż niezainicjowane wartości
pt: Mostrar o uso de valores indefinidos
pt_br: Mostrar uso de valores não inicializados
sv: Visa användning av oinitierade värden
tr: Tanımlanmamış değerlerin kullanımını göster
uk: Показувати використання невизначних значень
zh_cn: 显示对未定义值的使用
