Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: Freelist maximum size:
ar: أقصى حجم للقائمة الحرة:
ca: Mida màxima de la llista de blocs lliures:
eo: Maksimuma grandeco de liberlisto:
es: Tamaño máximo de la lista de bloques libres:
fr: Taille maximale de la liste des blocs libres :
gl: Tamaño máximo da lista de bloques libres:
it: Dimensione massima della lista dei blocchi liberi:
ka: თავისუფალი ბლოკების სიის მაქს. ზომა:
ko: 해제 목록 최대 크기:
nl: Maximum grootte van vrije lijst:
pl: Graniczny rozmiar listy zwolnień:
pt: Tamanho máximo da lista de blocos livres:
pt_br: Tamanho máximo da lista de liberados:
sv: Maximal storlek på lediglista:
tr: Freelist azami boyutu:
uk: Максимальний розмір списку вільних блоків:
zh_cn: 已释放列表最大大小：

source: <html><head/><body><p>When the client program releases memory using <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (in <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) or <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), that memory is not immediately made available for re-allocation. Instead, it is marked inaccessible and placed in a queue of freed blocks. The purpose is to defer as long as possible the point at which freed-up memory comes back into circulation. This increases the chance that Memcheck will be able to detect invalid accesses to blocks for some significant period of time after they have been freed.</p><p>This option specifies the maximum total size, in bytes, of the blocks in the queue. The default value is twenty million bytes. Increasing this increases the total amount of memory used by Memcheck but may detect invalid uses of freed blocks which would otherwise go undetected.</p></body></html>
ar: <html><head/><body><p>عندما يحرّر البرنامج العميل الذاكرة باستخدام <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (في <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) أو <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>)، لا تتاح تلك الذاكرة على الفور لإعادة التخصيص. بدلاً من ذلك، توسم على أنّها غير قابلة للوصول وتوضع في طابور من الكتل المحرّرة. الغرض هو تأجيل أطول فترة ممكنة للنقطة التي تعود فيها الذاكرة المحرّرة للتداول. يزيد هذا من فرصة اكتشاف Memcheck لعمليات الوصول غير الصالحة للكتل لبعض الوقت الهام بعد تحريرها.</p><p>يحدد هذا الخيار الحدّ الأقصى للحجم الإجمالي، بالبايت، للكتل في الطابور. القيمة المبدئية هي عشرون مليون بايت. تزيد زيادته المقدار الإجمالي للذاكرة المستخدمة بواسطة Memcheck ولكن قد يكتشف استخدامات غير صالحة للكتل المحرّرة والتي قد تمرّ دون اكتشاف.</p></body></html>
ca: <html><head/><body><p>Quan el programa client allibera memòria usant <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), aquesta memòria no es fa accessible immediatament per a la reassignació. Per contra, es marca com a inaccessible i se situa en una cua de blocs alliberats. La finalitat és diferir tant com sigui possible el punt en què la memòria alliberada torna a la circulació. Això incrementa la possibilitat que el Memcheck podrà detectar accessos no vàlids a blocs durant un període de temps significatiu després que s'hagin alliberat.</p><p>Aquesta opció especifica la mida total màxima, en bytes, dels blocs a la cua. El valor predeterminat són vint milions de bytes. Incrementant això, augmenta la quantitat total de memòria usada pel Memcheck, però pot detectar usos no vàlids dels blocs alliberats que altrament no serien detectats.</p></body></html>
eo: <html><head/><body><p>Kiam la klienta programo liberigas memoron per <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (en <span style=" font-family:'Monospace'; font-weight:600; font-style:kursivo;">C</span>) aŭ <span style=" font- familio:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; tiparostilo :italic;">C++</span>), tiu memoro ne estas tuj disponigita por reasignado. Anstataŭe, ĝi estas markita nealirebla kaj metita en vicon de liberigitaj blokoj. La celo estas prokrasti kiel eble plej longe la punkton ĉe kiu liberigita memoro revenas en cirkuladon. Ĉi tio pliigas la ŝancon ke Memcheck povos detekti nevalidajn alirojn al blokoj dum iom da signifa tempo post kiam ili estis liberigitaj.</p><p>Ĉi tiu opcio specifas la maksimuman totalan grandecon, en bajtoj, de la blokoj en la vico. La defaŭlta valoro estas dudek milionoj da bajtoj. Pliigi ĉi tion pliigas la totalan kvanton de memoro uzata de Memcheck sed povas detekti malvalidajn uzojn de liberigitaj blokoj kiuj alie restus nerimarkitaj.</p></body></html>
es: <html><head/><body><p>Cuando el programa cliente libera memoria usando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), dicha memoria no se pone inmediatamente en disposición de volver a ser asignada. En lugar de ello, se marca como inaccesible y se sitúa en una cola de bloques liberados. El propósito de este procedimiento es diferir tanto como sea posible el punto en el que la memoria liberada vuelve a estar en circulación. Esto aumenta la posibilidad de que Memcheck sea capaz de detectar accesos no válidos a estos bloques durante un período de tiempo significativo desde que hayan sido liberados.</p><p>Esta opción indica el tamaño total máximo, en bytes, de los bloques de esta cola. El valor predeterminado es de veinte millones de bytes. Al aumentar este valor se incrementa la cantidad total de memoria usada por Memcheck, aunque se pueden detectar usos no válidos de bloques liberados, que de otra forma pasarían inadvertidos.</p></body></html>
fr: <html><head/><body><p>Quand le programme client libère de la mémoire en utilisant <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (in <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), la mémoire n'est pas immédiatement rendue disponible pour une ré-allocation. A la place, elle est marquée inaccessible et placée dans une file de blocs libérés. La raison est de décaler autant que possible le moment auquel la mémoire redevient disponible. Ceci augmente les chances pour que Memcheck soit capable de détecter des accès incorrects à des blocs pour une période notable après leurs libérations.</p> <p>Cette option spécifie la taille maximale totale en octets des blocs dans la file. La valeur par défaut est de 20 Mo. Son augmentation accroît la quantité totale de mémoire utilisée par Memcheck mais peut détecter des utilisations incorrectes des blocs libérés, qui, sinon, ne seraient pas détectées.</p></body></html>
gl: <html><head/><body><p>Cando o programa cliente libera memoria usando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (en <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), esa memoria non pasa a estar inmediatamente dispoñíbel para volver a usar, senón que se marca como inaccesíbel e se coloca nunha cola de bloques libres. O propósito é atrasar o máximo posíbel o que a memoria liberada tarda en volver á circulación. Isto aumenta a probabilidade de que Memcheck consiga detectar accesos incorrectos a bloques un tempo significativo despois de liberárense.</p> <p>Esta opción indica o tamaño total máximo, en bytes, dos bloques da cola. O valor predeterminado é vinte millóns de bytes. Aumentalo aumenta a cantidade total de memoria que Memcheck usa pero podería detectar uso incorrectos de bloques liberados que noutros casos non se detectarían.</p></body></html>
ka: <html><head/><body><p>როდესაც კლიენტის პროგრამა ათავისუფლებს მეხსიერებას <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (C-ში) ან <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (C++-ში) ოპერაციების გამოყენებით, ეს მეხსიერება დაუყოვნებლივ არ ხდება ხელმისაწვდომი ხელახალი გამოყოფისთვის. ამის ნაცვლად, იგი ინიშნება როგორც მიუწვდომელი და თავსდება გათავისუფლებული ბლოკების რიგში. მიზანია, მაქსიმალურად გადავადდეს ის მომენტი, როდესაც გათავისუფლებული მეხსიერება კვლავ ბრუნვაში დაბრუნდება. ეს ზრდის იმის შანსს, რომ Memcheck-მა შეძლოს ბლოკებზე არავალიდური წვდომის აღმოჩენა მათი გათავისუფლებიდან გარკვეული დროის განმავლობაში.</p><p>ეს პარამეტრი განსაზღვრავს რიგში არსებული ბლოკების მაქსიმალურ საერთო ზომას ბაიტებში. ნაგულისხმევი მნიშვნელობა არის ოცი მილიონი ბაიტი. ამ მნიშვნელობის გაზრდა ზრდის Memcheck-ის მიერ გამოყენებული მეხსიერების მთლიან რაოდენობას, მაგრამ საშუალებას იძლევა აღმოაჩინოს გათავისუფლებული ბლოკების არასწორი გამოყენების ისეთი შემთხვევები, რომლებიც სხვაგვარად შეუმჩნეველი დარჩებოდა.</p></body></html>
ko: <html><head/><body><p>클라이언트 프로그램에서 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) 또는 <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>)를 사용하여 메모리를 해제할 때 해당 메모리는 곧바로 다시 할당되지 않습니다. 해당 메모리는 접근할 수 없는 것으로 표시되며 해제된 블록 대기열에 추가됩니다. 대기열을 사용하는 목적은 해제된 메모리를 다시 할당하는 것을 최대한 지연시키는 것입니다. Memcheck에서 메모리가 해제된 후 긴 시간 동안 블록에 대한 잘못된 접근이 일어나는지를 확인할 수 있는 확률을 증가시킵니다.</p><p>이 옵션은 대기열 블록 최대 총 크기를 바이트 단위로 지정합니다. 기본값은 20,000,000바이트입니다. 이 값을 증가시키면 Memcheck의 총 메모리 사용량이 증가하지만 감지할 수 없는 해제된 블록의 잘못된 사용을 감지할 수도 있습니다.</p></body></html>
nl: <html><head/><body><p>Als een programma geheugen vrijgeeft met behulp van <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (in <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) of <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), dan komt dat geheugen niet onmiddellijk beschikbaar voor her-allocatie. In plaats daarvan, wordt het gemarkeerd als ontoegankelijk en in een rij met vrijgegeven blokken geplaatst. Het doel is om het moment dat de vrijgegeven geheugen terug in circulatie zoveel mogelijk uit te stellen. Dit vergroot de kans dat Memcheck ongeldige accesses tot blokken tijdens een behoorlijke periode na de vrijgave detecteert.</p><p>Hier stelt u de maximale totale grootte in, in bytes, van de blokken in de rij. De standaardinstelling is twintig miljoen bytes. Door dit groter te maken, vergroot u ook het geheugen dat Memcheck nodig heeft, maar vergroot ook de kans op detectie van ongeldig gebruik van vrijgegeven blokken die anders wellicht niet gedetecteerd zouden worden.</p></body></html>
pl: <html><head/><body><p>Gdy program kliencki zwalnia pamięć przy użyciu <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (w <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) lub <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), to pamięć ta nie jest od razu dostępna do ponownego przydziału. Zamiast tego oznaczona jest jako niedostępna i umieszczna w kolejce zwolnionych bloków. Celem jest opóźnienie tak długo jak to możliwe chwili, w której zwolniona pamięć zostanie ponownie wykorzystana. Zwiększa to szansę wykrycia przez Memcheck nieprawidłowych odczytów bloków przez pewien znaczący okres czasu po ich zwolnieniu.</p><p>Opcja ta określa graniczny rozmiar całości, w bajtach, bloków w kolejce. Domyślna wartość to dwadzieścia milionów bajtów. Zwiększenie tego zwiększa całkowitą ilość pamięci wykorzystywanej przez Memcheck, lecz może wykryć nieprawidłowe wykorzystanie zwolnionych bloków, które w innych przypadkach nie zostałyby wykryte.</p></body></html>
pt: <html><head/><body><p>Quando o programa-cliente liberta memória com o <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (em <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), essa memória não fica imediatamente disponível para nova alocação. Em vez disso, é marcada como inacessível e é colocada numa fila de blocos libertados. O objectivo é adiar ao máximo possível o ponto em que a memória libertada volta a entrar em circulação. Isto aumenta a hipótese de que o Memcheck seja capaz de detectar os acessos inválidos a blocos durante um dado período de tempo significativo, depois da sua libertação.</p><p>Esta opção define o tamanho máximo total, em 'bytes', dos blocos na fila. O valor por omissão é de 20 milhões de 'bytes'. O aumento deste valor aumenta a quantidade total de memória usada pelo Memcheck, mas poderá detectar os usos inválidos de blocos libertados que não seriam detectados de outra forma.</p></body></html>
pt_br: <html><head/><body><p>Quando o programa cliente libera memória usando <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (em <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) ou <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), essa memória não é imediatamente disponibilizada para realocação. Em vez disso, ela é marcada como inacessível e colocada em uma fila de blocos liberados. O objetivo é adiar o máximo possível o ponto em que a memória liberada volta a circular. Isso aumenta a chance de o Memcheck conseguir detectar acessos inválidos a blocos por um período significativo de tempo após eles terem sido liberados.</p><p>Esta opção especifica o tamanho total máximo, em bytes, dos blocos na fila. O valor padrão é vinte milhões de bytes. Aumentar esse valor aumenta a quantidade total de memória usada pelo Memcheck, mas pode detectar usos inválidos de blocos liberados que, de outra forma, passariam despercebidos.</p></body></html>
sv: <html><head/><body><p>När klientprogrammet frigör minne genom att använda <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (i <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) eller <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), görs inte minnet omedelbart tillgängligt för återtilldelning. Istället markeras det som otillgängligt och placeras i en kö med frigjorda block. Syftet är att fördröja tillfället då frigjort minne kommer tillbaka i cirkulation så länge som möjligt. Det ökar chansen att Memcheck kommer att kunna detektera ogiltiga accesser till block under en signifikant tidsperiod efter de har frigjorts.</p><p>Alternativet anger den maximala totala storleken, i byte, för blocken i kön. Normalvärdet ät tjugo miljoner byte. Ökas det ökar den totala mängden minne som Memcheck använder, men bör detektera ogiltig användning av frigjorda block som annars skulle förbli oupptäckt.</p></body></html>
tr: <html><head/><body><p>Bir istemci programı <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span> içinde) veya <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>) seçeneklerini kullanarak bellek serbest bıraktığında, o bellek tekrar tahsis edilmek için hemen hazır olmaz. Bunun yerine, erişilmez olarak işaretlenir ve boşaltılmış bloklar kuyruğunun içine yerleştirilir. Amaç boşaltılmış belleğin tekrar geri dolaşıma çıktığı noktayı olabildiğince çok ertelemektir. Bu, Memcheck'in blokların serbest bırakıldıktan sonra belirli bir süre için geçersiz blok erişimlerini tespit etme şansını artırır.</p><p>Bu seçenek kuyruktaki blokların bayt cinsinden azami toplam boyutunu belirtir. Varsayılan değer yirmi milyon bayttır. Bunu artırmak, Memcheck tarafından kullanılan bellek miktarını artırır ama boşaltılmış blokların aksi takdirde tespit edilemeyeceği geçersiz kullanımlarını belki tespit edebilir.</p></body></html>
uk: <html><head/><body><p>Коли клієнтська програма вивільняє пам’ять за допомогою <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span> (у <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C</span>) або <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span> (у <span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>), ця пам’ять не одразу стає знову придатною для розміщення у ній даних. Замість цього, система позначає її як недоступну і розміщує у черзі звільнених блоків. Метою є якомога більше віддалення моменту, коли вивільнена пам’ять знову надходить у обіг. Це збільшує ймовірність того, що Memcheck вдасться виявити некоректні доступу до блоків за певний час після їхнього вивільнення.</p><p>За допомогою цього параметра визначається максимальний загальний об’єм, у байтах, блоків у черзі. Типовим є значення у двадцять мільйонів байтів. Збільшення цього значення збільшує загальний об’єм пам’яті, що використовується Memcheck, але надає змогу виявити некоректне використання вивільнених блоків, яке за інших обставин залишилося непоміченим.</p></body></html>
zh_cn: <html><head/><body><p>当客户端程序使用<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">free</span>（<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C 语言</span>）或者<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">delete</span>（<span style=" font-family:'Monospace'; font-weight:600; font-style:italic;">C++</span>）释放内存时，此内存并不能立刻用于重新分配。相反，它会被标记为不可用，并被添加到已释放内存块的队列中。这么做的目的是为了尽可能延缓被释放的内存重新回流的时间。这大幅增加了 Memcheck 在内存块被释放很久之后检测到对它们的非法访问的机会。</p><p>该选项指定了在该队列中内存块的最大总大小。默认值为两千万字节。增加这个值会增加 Memcheck 使用的总内存量，但是也会能够检测到那些一般无法检测到的对已被释放内存块的错误使用。</p></body></html>

source: Freelist big-blocks:
ar: الكتل الكبيرة في القائمة الحرة:
ca: Blocs grans de memòria lliure:
eo: Liberlistaj grandblokoj:
es: Bloques grandes de la lista de bloques libres:
fr: Super-blocs de la liste des blocs libres :
gl: Bloques grandes da lista de bloques libres:
ka: თავისუფალი ბლოკების სიის დიდი ბლოკები:
ko: 해제 목록 큰 블록:
nl: Lijst van vrije grote-blokken:
pl: Lista zwolnienia dużych bloków:
pt: Lista de blocos grandes livres:
pt_br: Grandes blocos na lista de liberados:
sv: Stora block i frilista:
tr: Freelist büyük-bloklar:
uk: Великі блоки списку вільних блоків:
zh_cn: 已释放列表大块阈值：
