Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: <html><head/><body><p>Specifies whether stack profiling should be done. This option slows Massif down greatly, and so is off by default. Note that Massif assumes that the main stack has size zero at start-up. This is not true, but doing otherwise accurately is difficult. Furthermore, starting at zero better indicates the size of the part of the main stack that a user program actually has control over.</p></body></html>
ar: <html><head/><body><p>يحدّد ما إذا كان يجب إجراء تحليل أداء المكدّس. يبطّئ هذا الخيار Massif بشكل كبير، لذا يكون مطفأ بشكل مبدئي. لاحظ أن Massif يفترض أن المكدّس الرئيسي حجمه صفر عند البدء. هذا ليس صحيحاً، و لكن فعل غير ذلك بدقة صعب. بالإضافة، البدء بصفر يشير بشكل أفضل إلى حجم الجزء من المكدّس الرئيسي الذي يتحكّم فيه برنامج المستخدم فعلاً.</p></body></html>
ca: <html><head/><body><p>Especifica si s'ha de fer l'anàlisi de rendiment de la pila. Aquesta opció alenteix força el Massif, i per tant, està apagat de manera predeterminada. Cal tenir en compte que el Massif assumeix que la pila principal té una mida de zero en començar. Això no és veritat, però fer-ho amb precisió d'una altra manera és difícil. A més, en començar de zero s'indica la mida de la part de la pila principal sobre la qual realment té control un programa d'usuari.</p></body></html>
eo: <html><head/><body><p>Specifas ĉu stakprofilado devus esti farita. Ĉi tiu opcio malrapidigas Massif multe, kaj do estas malŝaltita defaŭlte. Notu ke Massif supozas ke la ĉefa stako havas grandecon nul ĉe ekfunkciigo. Ĉi tio ne estas vera, sed fari alie precize estas malfacila. Krome, komenci je nulo pli bone indikas la grandecon de la parto de la ĉefa stako, kiun uzantprogramo efektive regas.</p></body></html>
es: <html><head/><body><p>Indica si se debe analizar el rendimiento de la pila. Esta opción ralentiza bastante la ejecución de Massif, por lo que está desactivada por omisión. Tenga en cuenta que Massif asume que la pila principal tiene tamaño cero durante el inicio. Esto no es cierto, pero hacer cualquier otra cosa con precisión es difícil. Además, empezar en cero indica mejor el tamaño de la parte de la pila principal sobre la que tiene control realmente un programa de usuario.</p></body></html>
fr: <html><head/><body><p>Spécifie si le profilage de la pile doit être réalisé. Cette option ralentit grandement Massif et donc, est désactivée par défaut. Veuillez noter que Massif prend comme hypothèse, qu'au départ, la taille de la pile principale est de zéro au démarrage. Ceci est incorrect mais faire autrement de façon précise est difficile. De plus, un démarrage avec une valeur zéro indique la taille de la zone de la pile principale que le programme utilisateur a sous son contrôle. </p></body></html>
gl: <html><head/><body><p>Indica se debe facerse unha análise de rendemento da rima. Esta opción lentifica Massif de maneira significativa, e polo tanto está desactivada de maneira predeterminada. Teña en conta que Massif asume que o tamaño da rima é cero no inicio. Isto non é certo, pero determinalo con exactitude é difícil. Ademais, comezar en cero indica mellor o tamaño da parte da rima principal sobre a que o programa do usuario ten control real.</p></body></html>
ka: <html><head/><body><p>განსაზღვრავს, უნდა მოხდეს თუ არა სტეკის პროფილირება. ეს პარამეტრი მნიშვნელოვნად ანელებს Massif-ის მუშაობას, ამიტომ ნაგულისხმევად გამორთულია. გაითვალისწინეთ, რომ Massif უშვებს, თითქოს მთავარი სტეკის ზომა გაშვებისას ნულის ტოლია. ეს ასე არ არის, თუმცა რეალური ზომის ზუსტად განსაზღვრა სირთულეებთანაა დაკავშირებული. გარდა ამისა, ნულიდან ათვლა უკეთ აჩვენებს მთავარი სტეკის იმ ნაწილის ზომას, რომელზეც მომხმარებლის პროგრამას რეალურად აქვს კონტროლი.</p></body></html>
ko: <html><head/><body><p>스택 프로파일링 실행 여부를 결정합니다. 이 옵션은 Massif 실행을 느리게 하기 때문에 기본값으로 꺼져 있습니다. Massif는 시작할 때 주 스택 크기가 0이라고 가정합니다. 항상 참은 아니지만 다른 값으로 가정하기는 더 어렵습니다. 또한 0에서 시작하면 사용자 프로그램이 제어할 수 있는 주 스택 부분 크기를 정확하게 측정할 수 있습니다.</p></body></html>
nl: <html><head/><body><p>Hier stelt u in of u stack profiling wilt uitvoeren. Dit maakt Massif erg traag, en is daarom standaard uitgeschakeld. Merk op dat Massif er van uit gaat dat de grootte van de main stack bij opstarten nul is. Dit klopt niet, maar anders is de nauwkeurigheid erg moeilijk. Daarnaast, geeft door bij nul te starten een betere indicatie van de grootte van het gedeelte van de main stack dat een programma gebruikt.</p></body></html>
pl: <html><head/><body><p>Określa czy wykonywać profilowanie stosu. Opcja ta znacznie spowalnia Massif i przez to jest domyślnie wyłączona. Zauważ, że Massif zakłada zerowy rozmiar głównego stosu na początku. Nie jest to prawdą, lecz robienie tego inaczej jest bardzo trudne. Ponadto, rozpoczynanie od zera lepiej wskazuje rozmiar części głównego stosu, nad którym program użytkownika ma nadzór.</p></body></html>
pt: <html><head/><body><p>Indica se deverá ser feita uma análise da pilha. Esta opção torna o Massif bastante mais lento, estando desligada por omissão. Lembre-se que o Massif assume que a pilha principal tem um tamanho nulo no arranque. Isto não é verdade, mas é difícil corrigir esse detalhe. Para além disso, um início a zeros indica melhor o tamanho da parte da pilha principal que um programa de utilizador controla de facto.</p></body></html>
pt_br: <html><head/><body><p>Especifica se o perfil de pilha deve ser feito. Esta opção torna o Massif bastante lento e, portanto, está desativada por padrão. Observe que o Massif assume que a pilha principal tem tamanho zero na inicialização. Isso não é verdade, mas fazer o contrário com precisão é difícil. Além disso, começar do zero indica melhor o tamanho da parte da pilha principal sobre a qual um programa de usuário realmente tem controle.</p></body></html>
sv: <html><head/><body><p>Anger om stackprofilering ska utföras. Alternativet gör Massif mycket långsammare och är därför normalt avstängt. Observera att Massif antar att huvudstacken har storlek noll vid start. Det är inte sant, men att göra något annat med noggrannhet är svårt. Dessutom, att börja på noll anger bättre storleken på den delen av huvudstacken som användarprogrammet faktiskt har kontroll över.</p></body></html>
tr: <html><head/><body><p>Yığın profillemenin yapılmasının gerekip gerekmediğini belirtir. Bu seçenek Massif ' i çok büyük şekilde yavaşlatır bu yüzden varsayılan olarak kapalıdır. Massif ' in ana yığının başlangıçta 0 boyutuna sahip olduğunu varsaydığını unutmayınız. Bu doğru değildir ama aksi halde doğru bir şekilde yapmak zordur. Dahası 0 ' da başlamak, bir kullanıcı programının gerçekten denetim sahibi olduğu ana yığının parçasının boyutunu daha iyi gösterir.</p></body></html>
uk: <html><head/><body><p>Визначає, чи слід виконувати профілювання стека. Використання цього параметра значно уповільнює роботу Massif, тому типового його вимкнено. Зауважте, що Massif припускає, що одразу після запуску головний стек має нульовий розмір. На практиці, такого не буває, але точно визначити справжній розмір стека важко. Крім того, нульове значення краще свідчить про розмір частини основного стека, який насправді контролює запущена користувачем програма.</p></body></html>
zh_cn: <html><head/><body><p>指定是否进行堆栈分析。该选项会大幅降低 Massif 的速度，因此默认是关闭的。注意 Massif 假设启动时主堆栈大小为零。这并不准确，然而要精确地计算是很困难的。此外，以零作为起始能够更好地显示主堆栈中用户程序能够实际控制的部分的大小。</p></body></html>

source: Profile stack (slows profiling down greatly)
ar: تحليل أداء المكدّس (يبطّئ تحليل الأداء بشكل كبير)
ca: Anàlisi de rendiment de la pila (alenteix significativament l'anàlisi)
eo: Profila stako (malrapidigas profiladon tre)
es: Analizar la pila de llamadas (ralentiza mucho el análisis)
fr: Profiler la pile (ralentit considérablement le profilage)
gl: Analizar o rendemento da rima (reduce bastante o rendemento da análise).
it: Esegui profiling dello stack (rallenta notevolmente il profiling)
ka: სტეკის პროფილირება (პროფილებას მნიშვნელოვნად ანელებს)
ko: 스택 프로필(프로필 속도를 매우 낮춤)
nl: Profielstack (vertraagt ernstig profilering)
pl: Przeprowadź profilowanie stosu (znacznie spowalnia profilowanie)
pt: Analisar a pilha (torna a análise muito mais lenta)
pt_br: Analisar a pilha (torna a análise muito mais lenta)
sv: Profilera stack (gör profilering mycket långsammare)
tr: Profil yığını (profillemeyi çokça yavaşlatır)
uk: Профілювати стек (значно сповільнює профілювання)
zh_cn: 分析堆栈（大幅减缓分析速度）

source: <html><head/><body><p>Tells Massif to profile memory at the page level rather than at the malloc'd block level.</p></body></html>
ar: <html><head/><body><p>يخبر Massif بتحليل أداء الذاكرة على مستوى الصفحة بدلاً من مستوى كتلة malloc'd.</p></body></html>
ca: <html><head/><body><p>Indica que el Massif analitzarà el rendiment de la memòria al nivell de pàgina en lloc del nivell de bloc de «malloc».</p></body></html>
eo: <html><head/><body><p>Diras al Massif profili memoron ĉe la paĝnivelo prefere ol ĉe la mallok-a bloknivelo.</p></body></html>
es: <html><head/><body><p>Le indica a Massif que perfile la memoria a nivel de páginas en lugar de a nivel de bloques asignados con malloc.</p></body></html>
fr: <html><head/><body><p>Indique à Massif d'établir le profil de la mémoire au niveau de la page mémoire plutôt qu'au niveau du bloc d'allocation de « malloc ».</p></body></html>
gl: <html><head/><body><p>Fai que Massif analice o rendemento da memoria a nivel de páxina en vez de a nivel de bloque de malloc'd.</p></body></html>
ka: <html><head/><body><p>მიუთითებს Massif-ს, რომ აწარმოოს მეხსიერების პროფილირება გვერდების დონეზე და არა malloc-ით გამოყოფილი ბლოკების დონეზე.</p></body></html>
ko: <html><head/><body><p>Massif에 malloc 블록 수준이 아닌 페이지 수준으로 메모리 프로필 작성을 요청합니다.</p></body></html>
nl: <html><head/><body><p>Vertelt Massif om geheugen te profileren op het paginaniveau in plaats van op het blokniveau van malloc.</p></body></html>
pl: <html><head/><body><p>Mówi Massif, aby profilował pamięć raczej na poziomie strony niż na poziomie przydzielonego bloku malloc.</p></body></html>
pt: <html><head/><body><p>Diz ao Massif para analisar os dados da memória ao nível das páginas, em vez de ser ao nível do bloco reservado com 'malloc'.</p></body></html>
pt_br: <html><head/><body><p>Instrui o Massif a criar um perfil de memória no nível da página em vez do nível do bloco malloc.</p></body></html>
sv: <html><head/><body><p>Talar om för Massif att profilera minne på sidnivå istället på blocknivå i malloc.</p></body></html>
tr: <html><head/><body><p>Massif ' e belleği malloc'd blok düzeyinden ziyade sayfa düzeyindeprofillemesini söyler.</p></body></html>
uk: <html><head/><body><p>Повідомляє Massif, що слід профілювати пам’ять на рівні сторінок, а не на рівні блоків, які отримано за допомогою malloc.</p></body></html>
zh_cn: <html><head/><body><p>让 Massif 在页面级别进行内存分析，而不是在 malloc 的块级别。</p></body></html>

source: Pages as heap
ar: الصفحات ككومة
ca: Pàgines com a memòria en monticles
eo: Paĝoj kiel amaso
es: Páginas como montículo
fr: Pages comme tas local
gl: Páxinas como monte.
it: Pagine come heap
ka: გვერდები მეხსიერების გროვის სახით
ko: 페이지를 힙으로
nl: Pagina's als heap
pl: Strony jako sterta
pt: Páginas como memória de dados
pt_br: Páginas como heap
sv: Sidor som heap
tr: Küme olarak sayfalar
uk: Сторінки як «купа»
zh_cn: 页面作为堆

source: <html><head/><body><p>&quot;Pages as heap&quot; cannot be used together with &quot;Profile stack&quot;.</p></body></html>
ar: <html><head/><body><p>لا يمكن استخدام «الصفحات ككومة» مع «تحليل أداء المكدّس».</p></body></html>
ca: <html><head/><body><p>«Pàgines com a memòria en monticles» no es pot utilitzar junt amb «Pàgines com a memòria en monticles».</p></body></html>
eo: <html><head/><body><p>"Paĝoj kiel amaso" ne povas esti uzata kune kun "Profilo-stako".</p></body></html>
es: <html><head/><body><p>«Páginas como montículo» no se puede usar junto a «Analizar la pila de llamadas».</p></body></html>
fr: <html><head/><body><p>Les &quot;pages comme tas local&quot; ne peuvent être utilisées ensemble avec &quot; la pile de profils&quot;.</p></body></html>
gl: <html><head/><body><p>«Páxinas como monte» non se pode usar xunto con «Analizar o rendemento da rima».</p></body></html>
it: <html><head/><body><p>&quot;Pagine come heap&quot; non può essere usato insieme con &quot;Esegui profiling dello stack&quot;.</p></body></html>
ka: <html><head/><body><p>&quot;გვერდები, როგორც მეხსიერების გროვა&quot; და &quot;სტეკის პროფილირება&quot; ერთდროულად ვერ იქნება გამოყენებული.</p></body></html>
ko: <html><head/><body><p>&quot;페이지를 힙으로&quot; 설정은 &quot;스택 프로필&quot; 설정과 같이 사용할 수 없습니다.</p></body></html>
nl: <html><head/><body><p>&quot;Pagina's als heap&quot; kan niet worden gebruikt samen met &quot;Stack profileren&quot;.</p></body></html>
pl: <html><head/><body><p>&quot;Stron jako sterty&quot; nie można użyć razem z &quot;Profilowanie stosu&quot;.</p></body></html>
pt: <html><head/><body><p>A opção &quot;Páginas como memória de dados&quot; não pode ser usada em conjunto com a &quot;Análise da pilha&quot;.</p></body></html>
pt_br: <html><head/><body><p>&quot;Páginas como heap&quot; não pode ser usado junto com &quot;Pilha de perfil&quot;.</p></body></html>
sv: <html><head/><body><p>&quot;Sidor som heap&quot; kan inte användas tillsammans med "Profilera stack".</p></body></html>
tr: <html><head/><body><p>"Küme olarak sayfalar" "Profil yığını" ile birlikte kullanılamaz.</p></body></html>
uk: <html><head/><body><p>«Сторінки як «купа»» не можна використовувати разом із «Профілювати стек».</p></body></html>
zh_cn: <html><head/><body><p>&quot;页面作为堆&quot; 不能和 &quot;分析堆栈&quot; 同时启用。</p></body></html>

source: Launch Massif Visualizer after analysis finish
ar: شغل برنامج تصوير Massif بعد انتهاء التحليل
ca: Llança el Massif Visualizer després de finalitzar l'anàlisi
eo: Lanĉi Massif Visualizer post analiza finiĝo
es: Lanzar el visor Massif tras finalizar el análisis
fr: Lancer l'afficheur de Massif une fois l'analyse terminée
gl: Iniciar o visualizador Massif cando remate a análise.
it: Avvia visualizzatore Massif dopo la fine dell'analisi
ka: Massif ვიზუალიზატორის გაშვება ანალიზის დასრულების შემდეგ
ko: 분석이 끝난 후 Massif 시각화 도구 실행
nl: Massif-visualizer opstarten na beëindigen van analyse
pl: Uruchom Massif Visualizer po ukończeniu analizy
pt: Lançar o Visualizador do Massif após terminar a análise
pt_br: Executar o Massif Visualizer após o término da análise
sv: Starta Massif visualisering efter analysen avslutas
tr: Çözümleme bittikten sonra Massif Görselleyici ' yi başlat
uk: Запустити візуалізатор Massif після завершення аналізу
zh_cn: 分析完成后启动 Massif 可视化程序

source: Snapshot
ar: لقطة
ca: Captura
eo: Momentfoto
es: Instantánea
fr: Instantané
gl: Captura
it: Istantanea
ka: სნეპშოტი
ko: 스냅샷
nl: Momentopname
pl: Migawka
pt: Imagem
pt_br: Instantâneo
sv: Ögonblicksbild
tr: Anlık Görüntü
uk: Знімок
zh_cn: 快照

source: Time
ar: الوقت
ca: Temps
eo: Tempo
es: Tiempo
fr: Heure
gl: Tempo
ka: დრო
ko: 시간
nl: Tijd
pl: Czas
pt: Tempo
pt_br: Tempo
sv: Tid
tr: Zaman
uk: Час
zh_cn: 时间

source: Heap
ar: الكومة
ca: Memòria en monticles
es: Montículo
fr: Tas local
gl: Monte
ka: მეხსიერების გროვა
ko: 힙
pl: Sterta
pt: Dados
tr: Küme
uk: Купа
zh_cn: 堆

source: Heap (extra)
ar: الكومة (إضافي)
ca: Memòria en monticles (extra)
eo: Amaso (kromaĵo)
es: Montículo (extra)
fr: Tas local (extra)
gl: Monte (adicional)
ka: მეხსიერების გროვა (დამატებით)
ko: 힙(추가)
pl: Sterta (ekstra)
pt: Dados (extra)
tr: Küme (ek)
uk: Купа (додаткова)
zh_cn: 堆 (额外)

source: Stack
ar: المكدّس
ca: Pila
eo: Pilo
es: Pila de llamadas
fr: Pile
gl: Montón
ka: დასტა
ko: 스택
nl: Stapel
pl: Stos
pt: Pilha
pt_br: Pilha
tr: Yığın
uk: Стек
zh_cn: 堆叠

source: Massif (Heap Profiler)
ar: Massif (محلل أداء الكومة)
ca: Massif (Analitzador de rendiment de la memòria en monticles)
eo: Masivo (Heap Profiler)
es: Massif (analizador de rendimiento del montículo)
fr: Massif (Profileur de tas)
gl: Massif (analizador de rendemento do monte)
it: Massif (profiler dello heap)
ka: Massif (მეხსიერების გროვის პროფაილერი)
ko: Massif(힙 프로파일러)
nl: Massif (profiler voor heap)
pl: Massif (Profiler sterty)
pt: Massif (Analisador da Memória de Dados)
pt_br: Massif (Perfil de Heap)
sv: Massif (heap-profileringsverktyg)
tr: Masif (Küme Profilleyici)
uk: Massif (засіб профілювання «купи»)
zh_cn: Massif（堆分析器）

source: Snapshots
ar: لقطات
ca: Captures
eo: Momentfotoj
es: Instantáneas
fr: Instantané
gl: Capturas
it: Istantanee
ka: სწრაფი ასლები
ko: 스냅샷
nl: Momentopnamen
pl: Zrzuty danych
pt: Capturas
pt_br: Instantâneos
sv: Ögonblicksbilder
tr: Anlık Görüntüler
uk: Знімки
zh_cn: 快照

source: Heap trees
ar: أشجار الكومة
ca: Arbres de la memòria en monticles
eo: Hek arboj
es: Árboles del montículo
fr: Arbres de tas
gl: Árbores do monte
it: Alberi di heap
ka: მეხსიერების გროვის ხეები
ko: 힙 트리
nl: Boomstructuur in heap
pl: Drzewa sterty
pt: Árvores dos dados
pt_br: Árvores heap
sv: Heap-träd
tr: Küme ağaçları
uk: Дерева купи даних
zh_cn: 堆树

source: Launch visualizer
ar: شغل برنامج التصوير
ca: Llança el visualitzador
eo: Lanĉi vidigilon
es: Lanzar visor
fr: Lancer l'afficheur
gl: Iniciar o visualizador
it: Avvia visualizzatore
ka: ვიზუალიზატორის გაშვება
ko: 시각화 도구 실행
nl: Visualizer starten
pl: Uruchom wizualizera
pt: Lançar o visualizador
pt_br: Executar visualizador
sv: Starta visualisering
tr: Görselleyiciyi başlat
uk: Запустити візуалізатор
zh_cn: 启动可视化程序

source: definite
ar: مؤكّد
ca: definida
eo: difinita
es: definido
fr: Précis
gl: definitivas
it: sicuro
ka: განსა
ko: 확실함
nl: bepaald
pl: skończony
pt: garantido
pt_br: definitivo
sv: definitiv
tr: kesin
uk: визначений
zh_cn: 确定

source: possible
ar: محتمل
eo: ebla
es: posible
gl: posíbeis
it: possibile
ka: შესაძლო
ko: 가능함
nl: mogelijk
pl: możliwy
pt: possível
pt_br: possível
sv: möjlig
tr: olası
uk: можливий
zh_cn: 可能

source: indirect
ar: غير مباشر
ca: indirecta
eo: nerekta
es: indirecto
gl: indirectas
it: indiretto
ka: არაპირდაპირი
ko: 직접적
pl: pośredni
pt: indirecto
pt_br: indireto
sv: Indirekt
tr: dolaylı
uk: опосередкований
zh_cn: 间接

source: reachable
ar: يمكن الوصول إليه
ca: accessible
eo: atingebla
es: alcanzable
fr: Atteignable
gl: alcanzábeis
it: raggiungibile
ka: ხელმისაწვდომი
ko: 접근 가능
nl: bereikbaar
pl: w zasięgu
pt: acessível
pt_br: acessível
sv: nåbar
tr: erişilebilir
uk: досяжний
zh_cn: 可达

source: stdstring
ar: سلسلة قياسية
ca: cadena_estàndard
fr: Chaîne standard
gl: cadea estándar
ka: სტანდარტულისტრიქონი
pl: standardowyciągznaków
sv: stdsträng
uk: стандартний рядок

source: length64
ar: طول 64
ca: durada64
eo: longeco64
es: longitud64
fr: Durée
gl: lonxitude 64
ka: სიგრძე64
nl: lengte64
pl: długość64
sv: längd64
uk: довжина64

source: newarray
ar: صفيف جديد
ca: matriunova
eo: novatabelo
es: nuevoarray
fr: Nouveau tableau
gl: nova matriz
ka: ახალიმასივი
ko: 새 배열
pl: nowamacierz
pt_br: novamatriz
sv: nyttfält
tr: yenidizilim
uk: новий масив
zh_cn: 新数组

source: multipleinheritance
ar: وراثة متعدّدة
ca: herènciamúltiple
eo: multoblaheredo
es: herenciamúltiple
fr: Héritage multiple
gl: herdanza múltiple
ka: ერთზემეტიმემკვიდრეობა
ko: 다중 상속
pl: wielokrotnedziedziczenie
pt_br: herançamúltipla
sv: multipeltarv
tr: çoklukalıt
uk: кратне успадковування
zh_cn: 多重继承

source: high
ar: عالي
ca: alta
eo: alta
es: alta
fr: élevé
gl: alta
ka: მაღალი
ko: 높음
nl: hoog
pl: wysoki
pt: alta
pt_br: alta
sv: hög
tr: yüksek
uk: високий
zh_cn: 高

source: medium
ar: متوسّط
ca: mitjana
eo: mediumo
es: media
fr: moyen
gl: media
ka: საშუალო
ko: 중간
pl: średni
pt: média
pt_br: média
tr: orta
uk: середній
zh_cn: 中

source: low
ar: منخفض
ca: baixa
eo: malalta
es: baja
fr: bas
gl: baixa
ka: დაბალი
ko: 낮음
nl: laag
pl: niski
pt: baixa
pt_br: baixa
sv: låg
tr: düşük
uk: низький
zh_cn: 低

source: alloc
ar: تخصيص
es: asignación
gl: asignar
ko: 할당
pl: przydział
pt: alocação
pt_br: alocação
sv: tilldelning
zh_cn: 分配

source: free
ar: تحرير
es: liberación
fr: libre
gl: liberar
ka: თავისუფალია
ko: 해제
nl: vrij
pl: zwolnienie
pt: libertação
pt_br: livre
sv: frigörelse
zh_cn: 释放

source: alloc-and-free
ar: تخصيص و تحرير
eo: alloc-kaj-free
es: asignación y liberación
fr: alloué-et-libéré
gl: asignar-e-liberar
ko: 할당과-해제
nl: alloceren-en-vrijgave
pl: przydział-i-zwolnienie
pt: alocação-e-libertação
pt_br: alocada-e-livre
sv: tilldelning och frigörelse
zh_cn: 分配和释放

source: alloc-then-free
ar: تخصيص ثم تحرير
eo: alloc-tiam-free
es: asignación y luego liberación
fr: alloué-puis-libéré
gl: asignar-logo-liberar
ko: 할당-직후-해제
nl: vrijgave-na-allocatie
pl: przydział-później-zwolnienie
pt: libertação-após-alocação
pt_br: alocada-então-livre
sv: tilldelning sedan frigörelse
zh_cn: 分配后释放

source: Leak resolution:
ar: دقّة التّسرّب:
ca: Resolució de fuites:
eo: Liko-rezolucio:
es: Resolución de fugas:
fr: Résolution des fuites :
gl: Resolución de perdas:
it: Risoluzione delle perdite:
ka: გაჟონვის გარჩევადობა:
ko: 누수 해결:
nl: Resolutie van lekken:
pl: Rozdzielczość wycieków:
pt: Resolução de fugas:
pt_br: Resolução de vazamentos:
sv: Upplösning av läckor:
tr: Sızma çözünürlüğü:
uk: Розв’язування витоків:
zh_cn: 泄漏检测分辨率：
