Repository: KDE/kdev-valgrind
Catalog: po/*/kdevvalgrind.po
Languages: ar, ca, eo, es, fr, gl, it, ka, ko, nl, pl, pt, pt_br, sv, tr, uk, zh_cn

source: &Extra parameters:
ar: المعاملات الإضافيّة:
ca: Paràmetres a&ddicionals:
eo: &Kromaj parametroj:
es: Pa&rámetros adicionales:
fr: Paramètres supplém&entaires :
gl: Parám&etros adicionais:
it: Param&etri aggiuntivi:
ka: &დამატებითი პარამეტრები:
ko: 추가 인자(&E):
pl: Dodatkowe param&etry:
pt: Parâmetros &extra:
pt_br: Parâmetros &extras:
sv: &Extra väljare:
tr: &Ek Parametreler:
uk: Додаткові &параметри:
zh_cn: &额外参数:

source: <html><head/><body><p>When enabled, Valgrind stops reporting errors after 10,000,000 in total, or 1,000 different ones, have been seen. This is to stop the error tracking machinery from becoming a huge performance overhead in programs with many errors.</p></body></html>
ar: <html><head/><body><p>عند التّفعيل، يوقف Valgrind الإبلاغ عن الأخطاء بعد رؤية 10,000,000 خطأ إجمالاً، أو 1,000 خطأ مختلف. هذا لإيقاف آلية تتبع الأخطاء من أن تصبح عبئاً كبيراً على الأداء في البرامج ذات الأخطاء الكثيرة.</p></body></html>
ca: <html><head/><body><p>Quan està activat, el Valgrind atura l'informe d'errors després trobar-ne 10.000.000 en total, o 1.000 de diferents. Això és per a aturar el sistema de seguiment d'errors i que esdevingui una gran sobrecàrrega de rendiment en programes amb molts errors.</p></body></html>
eo: <html><head/><body><p>Kiam ĝi estas ebligita, Valgrind ĉesas raporti erarojn post kiam 10,000,000 entute, aŭ 1,000 malsamaj, estis viditaj. Ĉi tio estas por malhelpi la erarspuran maŝinaron fariĝi grandega rendimento superkoste en programoj kun multaj eraroj.</p></body></html>
es: <html><head/><body><p>Cuando está activada, Valgrind detiene el informe de errores al llegar a 10.000.000 en total, o a 1.000 distintos. Esto se usa para evitar que el sistema de seguimiento de errores se convierta en una gran sobrecarga para el rendimiento de los programas que contienen muchos errores.</p></body></html>
fr: <html><head/><body><p>Quand activé, Valgrind arrête de signaler des erreurs après 10 000 000 occurrences au total ou 1 000 erreurs du même nom. Cela permet d'arrêter le processus de recherche d'erreurs avant de faire face à surcroît énorme de calcul dans les programmes avec beaucoup d'erreurs.</p></body></html>
gl: <html><head/><body><p>Cando se activa, Valgrind deixa de informar de erros tras verse 10.000.000 totais ou 1.000 distintos. Isto é para evitar que a maquinaria de seguimento de erros se volva un gran lastre para o rendemento de programas con moitos erros.</p></body></html>
ka: <html><head/><body><p>როდესაც ჩართულია, Valgrind წყვეტს შეცდომების შესახებ შეტყობინებას მას შემდეგ, რაც ჯამში 10,000,000, ან 1,000 განსხვავებული შეცდომა დაფიქსირდება. ეს კეთდება იმისთვის, რომ შეცდომების თვალყურის დევნების მექანიზმი არ გახდეს მეტისმეტად დიდი წარმადობის დანახარჯი ბევრი შეცდომის მქონე პროგრამებში.</p></body></html>
ko: <html><head/><body><p>이 옵션을 사용하면 Valgrind는 총 10,000,000회의 오류를 보고했거나 서로 다른 1,000회의 오류를 보고하면 오류 보고를 중단합니다. 많은 오류가 발생하는 프로그램에서 오류 추적으로 인한 성능 오버헤드를 줄입니다.</p></body></html>
nl: <html><head/><body><p>Indien ingeschakeld, zal Valgrind stoppen met rapportagefouten na 10.000.000 in totaal of 1.000 verschillenden, zijn gezien. Dit is om het foutenvolgsysteem te stoppen van het worden van een enorm grote overhead voor prestaties in programma's met vele fouten.</p></body></html>
pl: <html><head/><body><p>Gdy włączone, to Valgrind wstrzymuje zgłaszanie błędów po 10,000,000 lub 1,000 różnych błędów. Przeznaczone jest to do uniknięcia dużego obciążenia od programu do śledzenia błędów w programach z wieloma błędami.</p></body></html>
pt: <html><head/><body><p>Quando estiver activa a opção, o Valgrind pára o registo de erros ao fim do total de 10 000 000 elementos totais, ou 1 000 diferentes, observados. Isto é para impedir os módulos de registo de erros de se tornarem uma grande sobrecarga na performance nos programas com muitos erros.</p></body></html>
pt_br: <html><head/><body><p>Quando habilitado, o Valgrind para de reportar erros após 10.000.000 no total, ou 1.000 erros diferentes, terem sido observados. Isso serve para impedir que o mecanismo de rastreamento de erros se torne uma enorme sobrecarga de desempenho em programas com muitos erros.</p></body></html>
sv: <html><head/><body><p>När aktiverat, slutar Valgrind rapportera fel efter totalt 10 000 000, eller efter 1 000 olika fel har observerats. Det görs för att förhindra att felspårningsmaskineriet blir en enorm prestandaomkostnad i program med många fel.</p></body></html>
tr: <html><head/><body><p>Etkinleştirildiğinde, Valgrind toplamda 10,000,000 hatadan veya 1,000 farklı hatadan sonraki hataları raporlamayı durdurur, görülmüştür. Bu hata izleme makinesinin programlarda birçok hatalarla büyük bir performans yüküne dönüşmesini engellemek içindir.</p></body></html>
uk: <html><head/><body><p>Якщо увімкнено, Valgrind припинить звітувати про помилки, якщо їхня кількість перевищить 10000000 будь-яких або 1000 різних записів. Так зроблено для того, щоб механізми стеження за помилками не заважали створенню звітів у програмах з багатьма помилками.</p></body></html>
zh_cn: <html><head/><body><p>启用后，Valgrind 在显示了超过 10000000 个错误或超过 1000 个不同的错误之后会停止报告错误。这么做是为了不让错误跟踪系统在程序有很多错误的情况下成为一个可观的性能瓶颈。</p></body></html>

source: Limit errors if too many
ar: حدّد الأخطاء إذا كانت كثيرة جداً
ca: Limita els errors si n'hi ha massa
eo: Limigi erarojn se tro multaj
es: Limitar errores si hay demasiados
fr: Limiter les erreurs s'il y en a trop
gl: Limitar os erros de hai demasiados.
it: Limita gli errori se sono molti
ka: შეცდომების შეზღუდვა, თუ რაოდენობა მეტისმეტად დიდია
ko: 오류가 너무 많은 경우 제한
nl: Fouten beperken als er te veel zijn
pl: Ogranicza błędy, gdy jest ich za dużo
pt: Limitar os erros se demasiados
pt_br: Limitar a quantidade exagerada de erros
sv: Begränsa antal fel om för många
tr: Çok fazla olduğunda hataları süz
uk: Обмежувати повідомлення щодо помилок, якщо їх багато
zh_cn: 避免显示过多错误

source: Valgrind XML Parsing: error at line %1, column %2: %3
ar: تحليل Valgrind XML: خطأ في السطر %1، العمود %2: %3
ca: Anàlisi XML de Valgrind: error a la línia %1, columna %2: %3
eo: Valgrind XML Parsing: eraro ĉe linio %1, kolumno %2: %3
es: Análisis XML de Valgrind: error en la línea %1, columna %2: %3
fr: Analyse syntaxique XML de Valgrind : erreur à la ligne %1, colonne %2 : %3
gl: Procesamento XML de Valgrind: erro na liña %1, columna %2:%3
it: Analisi XML di Valgrind: errore alla riga %1, colonna %2: %3
ka: Valgrind-ის XML-ის დამუშავება: შეცდომა ხაზზე %1, სვეტი %2: %3
ko: Valgrind XML 처리 오류: 줄 %1, 칸 %2: %3
nl: Valgrind XML ontleden: fout in regel %1, kolom %2: %3
pl: Przetwarzanie XML Valgrinda: błąd w wierszu %1, kolumna %2: %3
pt: Processamento de XML do Valgrind: erro na linha %1, coluna %2: %3
pt_br: Processamento de XML do Valgrind: erro na linha %1, coluna %2: %3
sv: Valgrind XML-tolk: fel på rad %1, kolumn %2: %3
tr: Valgrind XML Ayrıştırması: %1 satırı, %2 sütununda hata: %3
uk: Розбір XML Valgrind: помилка у рядку %1, позиція %2: %3
zh_cn: Valgrind XML 解析：错误位于 行 %1，列 %2：%3

source: Instruction Fetch
ar: جلب التّعليمة
ca: Obtenció de la instrucció
eo: Instrukci-Akiro
es: Obtención de instrucción
fr: Instructions de recherche
gl: Alcance da instrución
it: Recupero istruzione
ka: ინსტრუქციის გამოთხოვა
ko: 명령 가져오기
nl: Instructie ophalen
pl: Pobranie instrukcji
pt: Obtenção da Instrução
pt_br: Obtenção da instrução
sv: Instruktionshämtning
tr: Yönerge Çekme
uk: Отримання інструкцій
zh_cn: 指令获取

source: Data Read Access
ar: وصول قراءة البيانات
ca: Accés de lectura a les dades
eo: Datumlega Aliro
es: Acceso de lectura de datos
fr: Accès en lecture des données
gl: Acceso de lectura aos datos
it: Accesso a dati in lettura
ka: მონაცემების კითხვის წვდომა
ko: 데이터 읽기 접근
nl: Gegevensleestoegang
pl: Dostęp do odczytu danych
pt: Acesso de Leitura aos Dados
pt_br: Acesso de leitura de dados
sv: Dataläsaccess
tr: Veri Okuma Erişimi
uk: Доступ для читання даних
zh_cn: 数据读访问

source: Data Write Access
ar: وصول كتابة البيانات
ca: Accés d'escriptura a les dades
eo: Datumskriba Aliro
es: Acceso de escritura de datos
fr: Accès en écriture des données
gl: Acceso de escritura aos datos
it: Accesso a dati in scrittura
ka: მონაცემების ჩაწერის წვდომა
ko: 데이터 쓰기 접근
nl: Gegevensschrijftoegang
pl: Dostęp do zapisu danych
pt: Acesso de Escrita aos Dados
pt_br: Acesso de escrita de dados
sv: Dataskrivaccess
tr: Veri Yazma Erişimi
uk: Доступ для запису даних
zh_cn: 数据写访问

source: L1 Instr. Fetch Miss
ar: خطأ جلب تعليمة L1
ca: Manca llegir la instrucció L1
eo: L1 Instr.-Akira Maltrafo
es: Fallo al obtener instrucción de L1
fr: Défaut d'obtention d'instruction du cache L1
gl: Fallo na obtención de instrucións do L1
it: Insuccesso nel recupero di istruzione L1
ka: L1 ინსტრ. გამოთხ. აცდ
ko: L1 명령 가져오기 누락
nl: L1 Instr. oph. mis
pl: L1 Instr. Niezgodność pobrania
pt: Falha da L1 na Leitura da Instrução
pt_br: Falha de obtenção da instrução da L1
sv: L1 instruktionshämtningsmiss
tr: L1 Yönerge Çekme Iskası
uk: Похибка отримання інстр. L1
zh_cn: L1 指令获取失败

source: L1 Data Read Miss
ar: خطأ قراءة بيانات L1
ca: Manca llegir les dades L1
eo: L1 Datumlega Maltrafo
es: Fallo al leer datos de L1
fr: Défaut de lecture de données du cache L1
gl: Fallo na lectura de datos do L1
it: Insuccesso nella lettura di dati L1
ka: L1 მონაც. წაკითხვ. აცდ
ko: L1 데이터 읽기 누락
nl: L1 Data lees mis
pl: L1 Niezgodność odczytu danych
pt: Falha da L1 na Leitura dos Dados
pt_br: Falha de leitura de dados da L1
sv: L1 dataläsmiss
tr: L1 Veri Okuma Iskası
uk: Похибка читання даних L1
zh_cn: L1 数据读取失败

source: L1 Data Write Miss
ar: خطأ كتابة بيانات L1
ca: Manca escriure les dades L1
eo: L1 Datumskriba Maltrafo
es: Fallo al escribir datos en L1
fr: Défaut d'écriture de données du cache L1
gl: Fallo de escritura de datos do L1
it: Insuccesso nella scrittura di dati L1
ka: L1 მონაც. ჩაწერ. აცდ
ko: L1 데이터 쓰기 누락
nl: L1 Data schrijf mis
pl: L1 Niezgodność zapisu danych
pt: Falha da L1 na Escrita dos Dados
pt_br: Falha de gravação de dados da L1
sv: L1 dataskrivmiss
tr: L1 Veri Yazma Iskası
uk: Похибка запису даних L1
zh_cn: L1 数据写入失败

source: LL Instr. Fetch Miss
ar: خطأ جلب تعليمة LL
ca: Manca obtenir la instrucció LL
eo: LL Instr.-Akira Maltrafo
es: Fallo al obtener instrucción de LL
fr: Défaut d'obtention d'instructions du cache « LL »
gl: Fallo na obtención de instrucións do LL
it: Insuccesso nel recupero di istruzione LL
ka: LL ინსტრ. გამოთხ. აცდ
ko: LL 명령 가져오기 누락
nl: LL Instr. oph. mis
pl: LL Niezgodność pobrania instr.
pt: Falha da LL na Leitura da Instrução
pt_br: Falha de obtenção da instrução da LL
sv: LL instruktionshämtningsmiss
tr: LL Yönerge Çekme Iskası
uk: Похибка отримання інстр. LL
zh_cn: LL 指令获取失败

source: LL Data Read Miss
ar: خطأ قراءة بيانات LL
ca: Manca llegir les dades LL
eo: LL Datumlega Maltrafo
es: Fallo al leer datos de LL
fr: Défaut de lecture de données du cache LL
gl: Fallo na lectura de datos do LL
it: Insuccesso nella lettura di dati LL
ka: LL მონაც. წაკითხვ. აცდ
ko: LL 데이터 읽기 누락
nl: LL Data lees mis
pl: LL Niezgodność odczytu danych
pt: Falha da LL na Leitura dos Dados
pt_br: Falha de leitura de dados da LL
sv: LL dataläsmiss
tr: LL Veri Okuma Iskası
uk: Похибка читання даних LL
zh_cn: LL 数据读取失败

source: LL Data Write Miss
ar: خطأ كتابة بيانات LL
ca: Manca escriure les dades LL
eo: LL Datumskriba Maltrafo
es: Fallo al escribir datos en LL
fr: Défaut d'écriture de données du cache LL
gl: Fallo de escritura de datos do LL
it: Insuccesso nella scrittura di dati LL
ka: LL მონაც. ჩაწერ. აცდ
ko: LL 데이터 쓰기 누락
nl: LL Data schrijf mis
pl: LL Niezgodność zapisu danych
pt: Falha da LL na Escrita dos Dados
pt_br: Falha de gravação de dados da LL
sv: LL dataskrivmiss
tr: LL Veri Yazma Iskası
uk: Похибка запису даних LL
zh_cn: LL 数据写入失败

source: Conditional Branch
ar: تفرع شرطي
ca: Branca condicional
eo: Kondiĉa Branĉo
es: Salto condicional
fr: Branchement conditionnel
gl: Rama condicional
it: Ramo condizionale
ka: პირობითი ბრენჩი
ko: 조건 분기
nl: Voorwaardelijke branch
pl: Warunkowa gałąź
pt: Ramificação Condicional
pt_br: Ramificação condicional
sv: Villkorligt hopp
tr: Koşullu dallanmalar
uk: Умовне відгалуження
zh_cn: 条件分支

source: Mispredicted Cond. Branch
ar: تفرّع شرطيّ خاطئ التّوقّع
ca: Branca condicional no prevista
eo: Misantaŭdirita Kond. Branĉo
es: Salto condicional mal predicho
fr: Mauvaise prédiction de branche conditionnelle.
gl: Rama condicional inesperada
it: Ramo condizionale predetto male
ka: გამოუცნობი პირობ. ბრენჩი
ko: 잘못 예측한 조건 분기
nl: Foutvoorspelde vrw. branch
pl: Źle przewidziana warunkowa gałąź
pt: Ramificação Cond. Mal-Prevista
pt_br: Ramificação condicional não prevista
sv: Felpredikterat villkorligt hopp
tr: Yanlış tahmin edilmiş Koşullu Dallar
uk: Помилково прогнозоване ум. відгалуження
zh_cn: 预测失败的条件分支

source: Indirect Branch
ar: تفرع غير مباشر
ca: Branca indirecta
eo: Nerekta Branĉo
es: Salto indirecto
fr: Branches indirectes
gl: Rama indirecta
it: Ramo indiretto
ka: არაპირდაპირი ბრენჩი
ko: 간접 분기
nl: Indirecte branch
pl: Niebezpośrednia gałąź
pt: Ramificação Indirecta
pt_br: Ramificação indireta
sv: Indirekt hopp
tr: Dolaylı Dallanma
uk: Непряме відгалуження
zh_cn: 间接分支

source: Mispredicted Ind. Branch
ar: تفرّع غير مباشر خاطئ التّوقّع
ca: Branca indirecta no prevista
eo: Mispredicted Ind. Branĉo
es: Salto indirecto mal predicho
fr: Mauvaise prédiction de branche indirecte.
gl: Rama indirecta inesperada
it: Ramo indiretto predetto male
ka: გამოუცნობი არაპ. ბრენჩი
ko: 잘못 예측한 간접 분기
nl: Foutvoorspelde ind. branch
pl: Źle przewidziana bezpośrednia gałąź
pt: Ramificação Ind. Mal-Prevista
pt_br: Ramificação indireta não prevista
sv: Felpredikterat indirekt hopp
tr: Yanlış Tahmin Edilmiş Dal
uk: Помилково прогнозоване непр. відгалуження
zh_cn: 预测失败的间接分支

source: Failed to start visualizer from "%1".
ar: أخفق بدء تشغيل برنامج التصوير من «%1».
ca: Ha fallat en iniciar el visualitzador des de «%1».
eo: Malsukcesis lanĉi vidilon de "%1".
es: No se ha podido iniciar el visor desde «%1».
fr: Impossible de démarrer l'afficheur à partir de « %1 ».
gl: Non se puido iniciar o visualizador desde «%1».
it: Avvio del visualizzatore da «%1» non riuscito.
ka: ვიზუალიზატორის გაშვების შეცდომა "%1"-დან.
ko: "%1"에서 시각화 도구를 실행할 수 없습니다.
nl: Opstarten van visualizer vanuit "%1" is mislukt.
pl: Nie udało się uruchomić valgrind z "%1".
pt: Não foi possível iniciar o visualizador a partir do "%1".
pt_br: Não foi possível iniciar o visualizador a partir do "%1".
sv: Misslyckades starta visualiseringsprogram från "%1".
tr: "%1" konumundan görselleyici başlatma başarısız oldu.
uk: Не вдалося запустити візуалізатор з «%1».
zh_cn: 无法从“%1”启动可视化工具。

source: Check your settings and install the visualizer if necessary.
ar: افحص إعداداتك و ثبّت برنامج التصوير إذا لزم.
ca: Comproveu la configuració i instal·leu el visualitzador si fos necessari.
eo: Kontrolu viajn agordojn kaj instalu la vidigilon se necese.
es: Compruebe su configuración e instale el visor si es necesario.
fr: Vérifiez vos paramètres et installez l'afficheur si nécessaire.
gl: Comprobe a configuración e instale o visualizador se é necesario.
it: Controlla le tue impostazioni e installa il visualizzatore se necessario.
ka: შეამოწმეთ პარამეტრები და დააყენეთ ვიზუალიზატორიც, თუ საჭიროა.
ko: 설정을 확인하고 필요한 경우 시각화 도구를 설치하십시오.
nl: Controleer uw instellingen en installeer de visualizer indien nodig.
pl: Sprawdź swoje ustawienia i wgraj wizualizer, jeśli potrzeba.
pt: Verificar a sua configuração e instalar o visualizador, se necessário.
pt_br: Verifique suas configurações e instale o visualizador se necessário.
sv: Kontrollera inställningarna och installera visualiseringsprogram vid behov.
tr: Ayarlarınızı denetleyin ve gerekiyorsa görselleyiciyi kurun.
uk: Перевірте, чи правильно вказано параметри, і, якщо потрібно, встановіть візуалізатор.
zh_cn: 检查您的设置，如有需要，安装可视化工具。

source: Error during visualizer execution:
ar: خطأ أثناء تنفيذ برنامج التصوير:
ca: Error durant l'execució del visualitzador:
eo: Eraro dum efektivigo de la bildigilo:
es: Error durante la ejecución del visor:
fr: Erreur durant l'exécution de l'afficheur :
gl: Erro durante a execución do visualizador:
it: Errore durante l'esecuzione del visualizzatore:
ka: შეცდომა ვიზუალიზატორის შესრულებისას:
ko: 시각화 도구 실행 오류:
nl: Fout bij uitvoeren van visualizer:
pl: Błąd przy wykonywaniu wizualizera:
pt: Erro durante a execução do visualizador:
pt_br: Erro durante a execução do visualizador:
sv: Fel vid körning av visualiseringsprogram:
tr: Görselleyici çalıştırma sırasında hata gerçekleşti:
uk: Помилка під час спроби запустити візуалізатор:
zh_cn: 可视化工具运行时出现错误：

source: none
ar: لا شيء
eo: neniu
es: ninguno
fr: aucun
gl: ningunha
it: nessuno
ka: არცერთი
ko: 없음
nl: geen
pl: brak
pt: nenhum
pt_br: nenhum
sv: ingen
zh_cn: 无可用密钥

source: all
ar: الكلّ
ca: tot
eo: ĉiuj
es: todo
fr: tout
gl: todo
it: tutti
ka: ყველა
ko: 모두
nl: alles
pl: wszystkie
pt: tudo
pt_br: todos
sv: alla
tr: tümü
uk: усі
zh_cn: 全部

source: Run Valgrind Analysis
ar: شغل تحليل Valgrind
ca: Executa l'anàlisi del Valgrind
eo: Lanĉi Valgrind-Analizon
es: Ejecutar el análisis de Valgrind
fr: Lancer l'analyse de Valgrind
gl: Executar a análise de Valgrind
it: Esegue l'analisi di Valgrind
ka: Valgrind-ის ანალიზის გაშვება
ko: Valgrind 분석 실행
nl: Valgrind-analyse uitvoeren
pl: Rozpocznij analizę Valgrinda
pt: Executar a Análise do Valgrind
pt_br: Executar análise Valgrind
sv: Utför analys med Valgrind
tr: Valgrind Çözümleme Çalıştır
uk: Виконати аналіз Valgrind
zh_cn: 运行 Valgrind 分析

source: Run %1
ar: شغل %1
ca: Executa %1
eo: Lanĉi %1
es: Ejecutar %1
fr: Exécuter %1
gl: Executar %1
it: Esegui %1
ka: %1-ის გაშვება
ko: %1 실행
nl: %1 uitvoeren
pl: Rozpocznij %1
pt: Executar o %1
pt_br: Executar %1
sv: Kör %1
tr: Çalıştır %1
uk: Виконати %1
zh_cn: 运行 %1

# @info:tooltip
source: Re-Run %1 Analysis for Current Launch Configuration
ar: أعد تشغيل تحليل %1 لإعدادات التشغيل الحالية
ca: Torna a analitzar %1 per a la configuració de llançament actual
eo: Relanĉi %1 Analizon por Aktuala Lanĉ-Agordo
es: Volver a ejecutar el análisis de %1 para la configuración de lanzamiento actual
fr: Relancer l'analyse %1 pour la configuration de lancement actuelle
gl: Executar de novo a análise %1 para a configuración de inicio actual
it: Ri-esegue l'analisi %1 per la configurazione di lancio attuale
ka: %1-ის ანალიზის თავიდან გაშვება მიმდინარე გაშვების კონფიგურაციისთვის
ko: 현재 시작 설정으로 %1 분석 다시 실행
nl: Opnieuw uitvoeren van %1 analyse voor huidige opstartconfiguratie
pl: Rozpocznij analizę %1 na nowo dla bieżących ustawień uruchomienowych
pt: Executar de Novo a Análise do %1 com a Configuração de Lançamento Actual
pt_br: Reexecuta %1 análise para a configuração de inicialização atual
sv: Kör om analys med %1 för aktuell startinställning
tr: Geçerli Başlatma Yapılandırması için %1 Çözümlemesini Yeniden Çalıştır
uk: Повторно виконати аналіз %1 для поточних налаштувань запуску
zh_cn: 以当前启动配置重新运行 %1 分析

source: <html><head/><body><p>Enables or disables collection of cache access and miss counts.</p></body></html>
ar: <html><head/><body><p>يفعّل أو يعطّل جمع وصولات الخبيئة (Cache) وعدد الأخطاء.</p></body></html>
ca: <html><head/><body><p>Activa o desactiva la recol·lecció d'accessos a la memòria cau i el comptador de faltes.</p></body></html>
eo: <html><head/><body><p>Ebligas aŭ malŝaltas kolekton de kaŝmemoro-aliro kaj miskalkulojn.</p></body></html>
es: <html><head/><body><p>Activa o desactiva la recopilación de accesos a la caché y de la cuenta de fallos.</p></body></html>
fr: <html><head/><body><p>Active ou désactive la collecte des accès au cache et compte les erreurs.</p></body></html>
gl: <html><head/><body><p>Activa ou desactiva a recollida de accesos á caché e o contador de accesos errados.</p></body></html>
it: <html><head/><body><p>Abilita o disabilita la raccolta di accessi alla cache e il conteggio dei fallimenti (miss).</p></body></html>
ka: <html><head/><body><p>ჩართავს, ან გამორთავს კეშის წვდომებისა და აცილებების რაოდენობის დათვლას.</p></body></html>
ko: <html><head/><body><p>캐시 접근과 캐시 누락 개수 집계를 활성화하거나 비활성화합니다.</p></body></html>
nl: <html><head/><body><p>In- of uitschakelen van verzamelen van toegang tot cache en aantal missen.</p></body></html>
pl: <html><head/><body><p>Włącza lub wyłącza zbieranie liczby dostępu i nieudanego dostępu do pamięci podręcznej.</p></body></html>
pt: <html><head/><body><p>Activa ou desactiva a recolha de acessos à 'cache' e número de falhas.</p></body></html>
pt_br: <html><head/><body><p>Ativa ou desativa a coleta de acesso ao cache e contagens de falhas.</p></body></html>
sv: <html><head/><body><p>Aktiverar eller inaktiverar insamling av cache-access och räkning av missar.</p></body></html>
tr: <html><head/><body><p>Önbellek erişim ve ıskalama sayılarının toplanmasını etkinleştirir veya devre dışı bırakır.</p></body></html>
uk: <html><head/><body><p>Вмикає або вимикає збирання даних щодо кількості доступів до кешу та промахів у кеші.</p></body></html>
zh_cn: <html><head/><body><p>启用或禁用缓存访问与未命中计数。</p></body></html>

source: Cache simulation
ar: محاكاة الخبيئة
ca: Simulador de memòria cau
eo: Kaŝmemora simulado
es: Simulación de caché
fr: Simulation de cache
gl: Simulación da caché
it: Simulazione cache
ka: კეშის სიმულაცია
ko: 캐시 시뮬레이션
nl: Cache-simulatie
pl: Symulacja pamięci podręcznej
pt: Simulação da 'cache'
pt_br: Simulação do cache
sv: Cachesimulering
tr: Önbellek simülasyonu
uk: Імітатор кешу
zh_cn: 缓存模拟
